Repository: Justasic/setroubleshoot
Catalog: plugins/po/*.po
Languages: es, fr, it

source: you need to diagnose why your system is running out of system resources and fix the problem. According to /usr/include/linux/capability.h, sys_resource is required to: /* Override resource limits. Set resource limits. */ /* Override quota limits. */ /* Override reserved space on ext2 filesystem */ /* Modify data journaling mode on ext3 filesystem (uses journaling resources) */ /* NOTE: ext2 honors fsuid when checking for resource overrides, so you can override using fsuid too */ /* Override size restrictions on IPC message queues */ /* Allow more than 64hz interrupts from the real-time clock */ /* Override max number of consoles on console allocation */ /* Override max number of keymaps */ /* Override resource limits. Set resource limits. */ /* Override quota limits. */ /* Override reserved space on ext2 filesystem */ /* Modify data journaling mode on ext3 filesystem (uses journaling resources) */ /* NOTE: ext2 honors fsuid when checking for resource overrides, so you can override using fsuid too */ /* Override size restrictions on IPC message queues */ /* Allow more than 64hz interrupts from the real-time clock */ /* Override max number of consoles on console allocation */ /* Override max number of keymaps */ /* Override resource limits. Set resource limits. */ /* Override quota limits. */ /* Override reserved space on ext2 filesystem */ /* Modify data journaling mode on ext3 filesystem (uses journaling resources) */ /* NOTE: ext2 honors fsuid when checking for resource overrides, so you can override using fsuid too */ /* Override size restrictions on IPC message queues */ /* Allow more than 64hz interrupts from the real-time clock */ /* Override max number of consoles on console allocation */ /* Override max number of keymaps */
es: necesita diagnosticar por qué su sistema se está quedando sin recursos del sistema y corregir el problema. Según /usr/include/linux/capability.h, sys_resource se requiere para: /* Sobrescribir los límites de recursos. Fijar los límites de recursos. */ /* Sobrescribir los límites de cuota. * /* Sobrescribir el espacio reservado en sistemas de archivos ext2 */ /* Modificar el modo de journaling en sistemas de archivos ext3 (usa recursos de journaling) */ /* NOTA: ext2 tiene en cuenta a fsuid en la comprobación a la hora de sobrescribir recursos, de forma que puede sobrescribirlos también por medio de fsuid */ /* Sobrescribir las restricciones de tamaño de las colas de mensaje IPC */ /* Permitir interrupciones de más de 64hz desde el reloj de tiempo real */ /* Sobrescribir el número máximo de consolas en la reserva de consolas */ /* Sobrescribir el número máximo de mapas de teclado */ /* Sobrescribir los límites de recursos. Fijar los límites de recursos. */ /* Sobrescribir los límites de cuota. */ /* Sobrescribir el espacio reservado en sistemas de archivos ext2 */ /* Modificar el modo de journaling de datos en sistemas de archivos ext3 (usa recursos de journaling) */ /* NOTA: ext2 tiene en cuenta a fsuid en la comprobación a la hora de sobrescribir recursos, de forma que puede sobrescribirlos también por medio de fsuid */ /* Sobrescribir las restricciones de tamaño de las colas de mensaje IPC */ /* Permitir interrupciones de más de 64hz desde el reloj de tiempo real */ /* Sobrescribir el número máximo de consolas en la reserva de consolas */ /* Sobrescribir el número máximo de mapas de teclado */ /* Sobrescribir los límites de recursos. Fija los límites de recursos. */ /* Sobrescribir los límites de cuota. */ /* Sobrescribir el espacio reservado en sistemas de archivos ext2 */ /* Modificar los datos en el modo de journaling en sistemas de archivos ext3 (usa recursos de journaling) */ /* NOTA: ext2 tiene en cuenta a fsuid en la comprobación a la hora de sobrescribir recursos, de forma que usted puede sobrescribirlos también por medio de fsuid */ /* Sobrescribir las restricciones de tamaño de las colas de mensajes IPC */ /* Permitir interrupciones de más de 64hz desde el reloj de tiempo real */ /* Sobrescribir el número máximo de consolas en la reserva de consolas */ /* Sobrescribir el número máximo de mapas de teclado */
fr: vous devez diagnostiquer pourquoi votre système est à court de ressources système et corriger le problème. Selon /usr/include/linux/capability.h, sys_resource est nécessaire pour : FIXME /* Override resource limits. Set resource limits. */ /* Override quota limits. */ /* Override reserved space on ext2 filesystem */ /* Modify data journaling mode on ext3 filesystem (uses journaling resources) */ /* NOTE: ext2 honors fsuid when checking for resource overrides, so you can override using fsuid too */ /* Override size restrictions on IPC message queues */ /* Allow more than 64hz interrupts from the real-time clock */ /* Override max number of consoles on console allocation */ /* Override max number of keymaps */ /* Override resource limits. Set resource limits. */ /* Override quota limits. */ /* Override reserved space on ext2 filesystem */ /* Modify data journaling mode on ext3 filesystem (uses journaling resources) */ /* NOTE: ext2 honors fsuid when checking for resource overrides, so you can override using fsuid too */ /* Override size restrictions on IPC message queues */ /* Allow more than 64hz interrupts from the real-time clock */ /* Override max number of consoles on console allocation */ /* Override max number of keymaps */ /* Override resource limits. Set resource limits. */ /* Override quota limits. */ /* Override reserved space on ext2 filesystem */ /* Modify data journaling mode on ext3 filesystem (uses journaling resources) */ /* NOTE: ext2 honors fsuid when checking for resource overrides, so you can override using fsuid too */ /* Override size restrictions on IPC message queues */ /* Allow more than 64hz interrupts from the real-time clock */ /* Override max number of consoles on console allocation */ /* Override max number of keymaps */
it: è necessario stabilire perché il tuo sistema sta esaurendo le risorse e correggere il problema. Secondo /usr/include/linux/capability.h, sys_resource deve poter: /* Superare i limiti delle risorse. Impostare i limiti delle risorse. */ /* Superare i limiti di quota. */ /* Superare lo spazio riservato sui filesystem ext2 */ /* Modificare la modalità di journaling dei dati sui filesystem ext3 (utilizza le risorse di journaling) */ /* NOTA: ext2 rispetta fsuid durante il controllo del superamento delle risorse, quindi è possibile superare le risorse anche usando fsuid */ /* Superare le restrizioni della dimensione delle code messaggi di IPC */ /* Permettere interrupt maggiori di 64hz dall'orologio in real-time */ /* Superare il numero massimo di console nella allocazione di console */ /* Superare il numero massimo di mappature tasti */ /* Superare i limiti delle risorse. Impostare i limiti delle risorse. */ /* Superare i limiti di quota. */ /* Superare lo spazio riservato sui filesystem ext2 */ /* Modificare la modalità di journaling dei dati sui filesystem ext3 (utilizza le risorse di journaling) */ /* NOTA: ext2 rispetta fsuid durante il controllo del superamento delle risorse, quindi è possibile superare le risorse anche usando fsuid */ /* Superare le restrizioni della dimensione delle code messaggi di IPC */ /* Permettere interrupt maggiori di 64hz dall'orologio in real-time */ /* Superare il numero massimo di console nella allocazione di console */ /* Superare il numero massimo di mappature tasti */ /* Superare i limiti delle risorse. Impostare i limiti delle risorse. */ /* Superare i limiti di quota. */ /* Superare lo spazio riservato sui filesystem ext2 */ /* Modificare la modalità di journaling dei dati sui filesystem ext3 (utilizza le risorse di journaling) */ /* NOTA: ext2 rispetta fsuid durante il controllo del superamento delle risorse, quindi è possibile superare le risorse anche usando fsuid */ /* Superare le restrizioni della dimensione delle code messaggi di IPC */ /* Permettere interrupt maggiori di 64hz dall'orologio in real-time */ /* Superare il numero massimo di console nella allocazione di console */ /* Superare il numero massimo di mappature tasti */

source: SELinux has prevented vbetool from performing an unsafe memory operation.
es: SELinux impidió a vbetool ejecutar una operación insegura de memoria.
fr: SELinux a empêché vbetool d'effectuer une dangereuse opération mémoire.
it: SELinux ha impedito a vbetool di eseguire una operazione non sicura della memoria.

source: SELinux denied an operation requested by $SOURCE, a program used to alter video hardware state. This program is known to use an unsafe operation on system memory but so are a number of malware/exploit programs which masquerade as vbetool. This tool is used to reset video state when a machine resumes from a suspend. If your machine is not resuming properly your only choice is to allow this operation and reduce your system security against such malware.
es: SELinux impidió una operación solicitada por $SOURCE, un programa usado para alterar el estado del hardware de vídeo. Este programa es conocido por usar una operación insegura en la memoria del sistema por lo que hay un número de programas malware/exploit que se enmascaran como vbetool. Esta herramienta se usa para resetear el estado del vídeo cuando una máquina se reanuda desde una suspensión. Si su máquina no está reanudando apropiadamente, su única opción es permitir esta operación y reducir la seguridad de su sistema contra este tipo de malware.
fr: SELinux a refusé une opération demandée par $SOURCE, un programme utilisé pour modifier l'état du matériel vidéo. Ce programme est connu pour utiliser une opération dangereuse sur la mémoire système mais c'est également le cas pour un certain nombre de programmes malveillants qui se substituent à vbetool. Cet outil est utilisé pour initialiser l'état de la vidéo lorsqu'une machine redémarre après une mise en veille. Si votre machine ne redémarre pas correctement, votre unique solution est d'autoriser cette opération et de réduire la sécurité de votre système contre ces programmes malveillants.
it: SELinux ha negato l'operazione richiesta da $SOURCE, un programma usato per alterare lo stato dell'hardware video. Questo programma utilizza una operazione non sicura sulla memoria del sistema in modo simile ad un numero di programmi malware/exploit i quali si mascherano come vbetool. Questo tool viene usato per resettare lo stato del video quando una macchina ripristina le proprie funzioni da uno stato di sospensione. Se la macchina non esegue questa procedura correttamente, l'unica opzione disponibile è quella di permettere tale operazione e diminuire così la sicurezza del sistema nei confronti dei suddetti malware.

source: If you decide to continue to run the program in question you will need to allow this operation. This can be done on the command line by executing: # setsebool -P mmap_low_allowed 1
es: Si decide continuar ejecutando el programa en cuestión, necesitará permitir esta operación. Esto se puede hacer por la línea de comando ejecutando: # setsebool -P mmap_low_allowed 1
fr: Si vous décidez de continuer à exécuter le programme en question, vous devez autoriser cette opération. Cela peut se faire par la ligne de commande en y exécutant : # setsebool -P mmap_low_allowed 1
it: Se si desidera di continuare ad eseguire il programma in questione bisogna consentire questa operazione. Ciò può essere fatto tramite linea di comando usando: # setsebool -P mmap_low_allowed 1

source: you want to ignore this AVC because it is dangerous and your machine seems to be working correctly.
es: quiere ignorar este AVC ya que es peligroso y pareciera ser que su máquina está funcionando correctamente.
fr: vous souhaitez ignorer cet AVC car il est dangereux et votre machine semble fonctionner correctement.
it: si desidera ignorare questo AVC perché è pericoloso e la macchina sembra funzionare correttamente.

source: you must tell SELinux about this by enabling the vbetool_mmap_zero_ignore boolean.
es: debe informarle esto a SELinux habilitando el booleano vbetool_mmap_zero_ignore.
fr: vous devez le faire savoir à SELinux en activant le booléen vbetool_mmap_zero_ignore.
it: è necessario informare SELinux sulla questione abilitando il booleano vbetool_mmap_zero_ignore .

source: Turn off memory protection
es: Apagar la protección de memoria
fr: Désactive la protection mémoire
it: Disabilitare la protezione della memoria

source: SELinux has prevented wine from performing an unsafe memory operation.
es: SELinux negó a wine hacer uso inseguro de la memoria.
fr: SELinux a empêché wine d'effectuer une dangereuse opération mémoire.
it: SELinux ha impedito a wine di eseguire una operazione non sicura della memoria.

source: SELinux denied an operation requested by wine-preloader, a program used to run Windows applications under Linux. This program is known to use an unsafe operation on system memory but so are a number of malware/exploit programs which masquerade as wine. If you were attempting to run a Windows program your only choices are to allow this operation and reduce your system security against such malware or to refrain from running Windows applications under Linux. If you were not attempting to run a Windows application this indicates you are likely being attacked by some for of malware or program trying to exploit your system for nefarious purposes. Please refer to http://wiki.winehq.org/PreloaderPageZeroProblem Which outlines the other problems wine encounters due to its unsafe use of memory and solutions to those problems.
es: SELinux negó una operación pedida por el precargador de wine, un programa usado para ejecutar una aplicación Windows bajo Linux. Este programa es conocido por usar una operación insegura sobre la memoria del sistema y también hay muchos programas malware/exploit que se enmascaran como wine. Si estuvo intentando ejecutar un programa Windows, su única opción es permitir esta operación y reducir la seguridad del sistema contra esos malware o abstenerse de ejecutar aplicaciones Windows bajo Linux. Si no está intentando ejecutar una aplicación Windows, esto indica que puede estar bajo ataque de alguno de los malware o programas que explotan su sistema con fines nefastos. Por favor, vea en http://wiki.winehq.org/PreloaderPageZeroProblem donde se delinean todos los demás problemas de wine descubiertos debido a su uso inseguro de la memoria y las soluciones a esos problemas.
fr: SELinux a refusé une opération demandée par wine-preloader, un programme utilisé pour exécuter des applications Windows sous Linux. Ce programme est connu pour son utilisation d'une opération dangereuse pour la mémoire système, mais c'est également le cas pour un certain nombre de programmes malveillants qui se substituent à wine. Si vous aviez l'intention d'exécuter un programme Windows, votre unique solution est d'autoriser cette opération et donc aussi de réduire la sécurité de votre système contre ces programmes malveillants, ou bien de s'abstenir d'exécuter des applications Windows sous Linux. Si vous n'aviez pas l'intention d'exécuter une application Windows, cela signifie que vous êtes susceptibles d'être attaqué par un programme malveillant essayant d'exploiter votre système à des fins néfastes. Veuillez vous référer à http://wiki.winehq.org/PreloaderPageZeroProblem Ce wiki décrit les autres problèmes que wine rencontre en raison d'un usage dangereux de la mémoire et les solutions à ces problèmes.
it: SELinux ha negato l'operazione richiesta da wine-preloader, un programma usato per eseguire le applicazioni di Windows con Linux. Questo programma utilizza una operazione non sicura sulla memoria del sistema, in modo simile ad un numero di programmi malware/exploit i quali si mascherano come wine. Se stavi cercando di eseguire un programma Windows le uniche opzioni disponibili sono quelle di permettere tale operazione, e diminuire così la sicurezza del sistema nei confronti dei suddetti malware, o di non eseguire le applicazioni Windows con Linux. Se non stavi cercando di eseguire un'applicazione Windows tale comportamento potrebbe indicare un attacco da parte di un malware o programma malizioso al sistema per scopi maliziosi. Consultare http://wiki.winehq.org/PreloaderPageZeroProblem Il quale riporta altre problematiche incontrate da wine a causa di un utilizzo non sicuro della memoria insieme alle soluzioni ai suddetti problemi.

source: you want to ignore this AVC because it is dangerous and your wine applications are working correctly.
es: quiere ignorar este AVC ya que es peligroso y pareciera ser que sus plicaciones wine están funcionando correctamente.
fr: vous souhaitez ignorer cet AVC car il est dangereux et vos applications wine fonctionnent correctement.
it: si desidera ignorare questo AVC perché è pericoloso e le applicazioni wine funzionano correttamente.

source: you must tell SELinux about this by enabling the wine_mmap_zero_ignore boolean.
es: debe informarle esto a SELinux habilitando el booleano wine_mmap_zero_ignore.
fr: vous devez le faire savoir à SELinux en activant le booléen wine_mmap_zero_ignore.
it: è necessario informare SELinux sulla questione abilitando il booleano wine_mmap_zero_ignore .

source: SELinux is preventing xen ($SOURCE_PATH) "$ACCESS" access to $TARGET_PATH.
es: SELinux está negando a xen ($SOURCE_PATHcp
fr: SELinux empêche l'accès « $ACCESS » xen ($SOURCE_PATH) au périphérique $TARGET_PATH.
it: SELinux impedisce a xen ($SOURCE_PATH) l'accesso "$ACCESS" a $TARGET_PATH.

source: SELinux denied xen access to $TARGET_PATH. If this is a XEN image, it has to have a file context label of xen_image_t. The system is setup to label image files in directory /var/lib/xen/images correctly. We recommend that you copy your image file to /var/lib/xen/images. If you really want to have your xen image files in the current directory, you can relabel $TARGET_PATH to be xen_image_t using chcon. You also need to execute semanage fcontext -a -t xen_image_t '$FIX_TARGET_PATH' to add this new path to the system defaults. If you did not intend to use $TARGET_PATH as a xen image it could indicate either a bug or an intrusion attempt.
es: SELinux impidió a xen acceder a $TARGET_PATH. Si ésta es una imagen XEN, debería tener un contexto de archivo etiquetado como xen_image_t. El sistema está configurado para etiquetar correctamente los archivos de imagen en la carpeta /var/lib/xen/images. Le recomendamos que copie su archivo de imagen a /var/lib/xen/images. Si realmente quiere mantener su archivo de imagen xen en su carpeta actual, puede reetiquetar $TARGET_PATH para que sea un archivo xen_image_t utilizando chcon. También necesitará ejecutar semanage fcontext -a -t xen_image_t '$FIX_TARGET_PATH' para añadir esta nueva ruta a las predeterminadas del sistema. Si no pretende utilizar $TARGET_PATH como una imagen xen, ésto podría indicar un error o un intento de ataque.
fr: SELinux a refusé à xen l'accès à $TARGET_PATH. S'il s'agit d'une image XEN, elle doit porter un étiquetage de contexte tel que xen_image_t. Ce système est configuré pour étiqueter correctement les fichiers image dans /var/lib/xen/images Nous vous recommandons de copier votre fichier image dans le répertoire /var/lib/xen/images. Si vous souhaitez vraiment avoir vos fichiers images xen dans le répertoire courant, vous pouvez réétiqueter $TARGET_PATH pour qu'il porte xen_image_t en utilisant chcon. Vous devriez également exécuter semanage fcontext -a -t xen_image_t '$FIX_TARGET_PATH' pour ajouter ce nouveau chemin à la configuration par défaut du système. Si vous n'aviez pas l'intention d'utiliser $TARGET_PATH en tant qu'image xen, cela pourrait signifier soit un bug, soit une tentative d'intrusion.
it: SELinux ha negato l'accesso xen a $TARGET_PATH. Se questa è un immagine XEN allora dovrà possedere una etichetta del contesto del file xen_image_t. Il sistema è impostato per etichettare correttamente i file immagine in /var/lib/xen/images. Si consiglia copiare il file immagine in /var/lib/xen/images. Se si desidera veramente avere i file immagine xen nella directory corrente, è possibile rietichettare $TARGET_PATH in xen_image_t usando chcon. Se si vuole farlo si dovrà anche eseguire semanage fcontext -a -t xen_image_t '$FIX_TARGET_PATH' per aggiungere questo nuovo percorso alle impostazioni di sistema predefinite. Se non si intende utilizzare $TARGET_PATH come una immagine xen ciò potrebbe indicare un bug o un tentativo di intrusione.

source: You can alter the file context by executing chcon -t xen_image_t '$TARGET_PATH' You must also change the default file context files on the system in order to preserve them even on a full relabel. "semanage fcontext -a -t xen_image_t '$FIX_TARGET_PATH'"
es: Puede modificar el contexto de archivo ejecutando chcon -t xen_image_t '$TARGET_PATH' También debe cambiar el archivo predeterminado de contexto de archivos en el sistema, para preservarlos incluso después de un reetiquetado completo del sistema. "semanage fcontext -a -t xen_image_t '$FIX_TARGET_PATH'"
fr: Vous pouvez modifier le contexte du fichier en exécutant chcon -t xen_image_t '$TARGET_PATH' Vous devez aussi changer le contexte par défaut des fichiers de votre système pour les préserver d'un réétiquetage complet. « semanage fcontext -a -t xen_image_t '$FIX_TARGET_PATH' »
it: È possibile alterare il contesto del file eseguendo chcon -t xen_image_t '$TARGET_PATH' È necessario inoltre modificare il contesto file predefinito dei file sul sistema per preservarli anche da una completa rietichettatura. "semanage fcontext -a -t xen_image_t '$FIX_TARGET_PATH'"

source: If you want to determine whether ftpd can read and write files in user home directories.
es: Si quiere comprobar si ftpd puede leer y escribir archivos en las carpetas de usuario.
fr: Si vous souhaitez déterminer si ftp peut accéder à des fichiers en lecture et en écriture dans les répertoires utilisateurs.
it: Se si desidera determinare se ftpd può leggere e scrivere file nelle cartelle home degli utenti.

source: If you want to determine whether privoxy can connect to all tcp ports.
es: Si quiere determinar si privoxy puede conectarse a todos los puertos tcp.
fr: Si vous souhaitez déterminer si privoxy peut se connecter sur tous les ports TCP.
it: Se si desidera determinare se privoxy può connettersi a tutte le porte tcp.

source: If you want to determine whether mpd can traverse user home directories.
es: Si quiere comprobar si mpd puede atravesar las carpetas de usuario.
fr: Si vous souhaitez déterminer si mpd peut traverser les répertoires utilisateurs.
it: Se si desidera determinare se mpd può attraversare le cartelle home degli utenti.

source: If you want to allow the graphical login program to login directly as sysadm_r:sysadm_t
es: Si quiere permitir que el programa gráfico de inicio de sesión se registre directamente como sysadm_r:sysadm_t
fr: Si vous souhaitez autoriser le programme de connexion graphique à se connecter directement en tant que sysadm_r:sysadm_t
it: Se si desidera consentire al programma di login grafico di effettuare l'accesso direttamente come sysadm_r:sysadm_t

source: If you want to allow xen to manage nfs files
es: Si quiere permitir que xen administre archivos nfs
fr: Si vous souhaitez autoriser xen à gérer les fichiers nfs
it: Se si desidera consentire a xen di gestire file nfs

source: If you want to allow confined web browsers to read home directory content
es: Si quiere permitir a los navegadores web confinados leer el contenido de la carpeta home
fr: Si vous souhaitez autoriser les navigateurs web confinés à lire le contenu des répertoires utilisateurs
it: Se si desidera consentire ai browser web confinati di leggere il contenuto della cartella home
