Repository: Justasic/setroubleshoot
Catalog: plugins/po/*.po
Languages: es, fr, it

source: SELinux has denied $SOURCE "$ACCESS" access to device $TARGET_PATH. $TARGET_PATH is mislabeled, this device has the default label of the /dev directory, which should not happen. All Character and/or Block Devices should have a label. You can attempt to change the label of the file using restorecon -v '$TARGET_PATH'. If this device remains labeled device_t, then this is a bug in SELinux policy. Please file a bg report. If you look at the other similar devices labels, ls -lZ /dev/SIMILAR, and find a type that would work for $TARGET_PATH, you can use chcon -t SIMILAR_TYPE '$TARGET_PATH', If this fixes the problem, you can make this permanent by executing semanage fcontext -a -t SIMILAR_TYPE '$FIX_TARGET_PATH' If the restorecon changes the context, this indicates that the application that created the device, created it without using SELinux APIs. If you can figure out which application created the device, please file a bug report against this application.
es: SELinux impidió a $SOURCE el acceso "$ACCESS" a $TARGET_PATH. $TARGET_PATH está mal etiquetado: este dispositivo posee la etiqueta predeterminada de la carpeta /dev, y esto no debería ocurrir. Todos los dispositivos de carácteres y/o de bloques deben tener una etiqueta. Puede intentar cambiar la etiqueta del archivo usando restorecon -v '$TARGET_PATH'. Si este dispositivo continúa etiquetado como device_t, entonces se trata de un error en la política de SELinux. Por favor, informe acerca de este error. Si observa otras etiquetas de dispositivos similares, ls -lZ /dev/SIMILAR, y encuentra un tipo que pueda funcionar para $TARGET_PATH, puede utilizar chcon -t TIPO_SIMILAR '$TARGET_PATH'. Si esto corrige el problema, puede hacer esta modificación permanente ejecutando semanage fcontext -a -t SIMILAR_TYPE '$FIX_TARGET_PATH' Si restorecon modifica el contexto, esto indica que la aplicación que ha creado al dispositivo, lo ha hecho sin utilizar la API de SELinux. Si puede descubrir qué aplicación creó el dispositivo, informe acerca de este error de la aplicación.
fr: SELinux a refusé l'accès de $SOURCE « $ACCESS » au périphérique $TARGET_PATH. $TARGET_PATH est mal étiqueté, ce périphérique porte l'étiquetage par défaut du répertoire /dev, ce qui ne devrait pas se produire. Tous les caractères ou les blocs de périphériques devraient être étiquetés. Vous pouvez tenter de modifier l'étiquetage du fichier en utilisant restorecon -v $TARGET_PATH. Si ce périphérique reste étiqueté, il s'agit alors d'un bug de la stratégie de SELinux. Merci de remplir un rapport de bug. Si vous cherchez des étiquetages de périphériques semblables, ls -lZ /dev/SIMILAR, et trouvez un type qui fonctionnerait pour $TARGET_PATH, vous pouvez utiliser chcon -t SIMILAR_TYPE '$TARGET_PATH'. Si cela corrige le problème, vous pouvez rendre le tout permanent en exécutant semanage fcontext -a -t SIMILAR_TYPE '$FIX_TARGET_PATH' Si restorecon modifie le contexte, cela signifie que l'application qui a créé le périphérique l'a créé sans utiliser les API de SELinux. Si vous arrivez à déterminer quelle application a créé le périphérique, merci de remplir un rapport d'anomalie sur cette application.
it: SELinux ha negato a $SOURCE l'accesso "$ACCESS" al dispositivo $TARGET_PATH. $TARGET_PATH non è etichettato correttamente, questo dispositivo possiede l'etichetta predefinita della directory /dev, e questo non è corretto. Tutti i dispositivi a blocchi e/o a caratteri, dovrebbero avere una etichetta. È possibile modificare l'etichetta del file utilizzando restorecon -v '$TARGET_PATH'. Se questo dispositivo resta etichettato device_t, ciò risulterà essere un bug relativo alla politica di SELinux. Inviare un bug report Se si controllano le altre etichette simili del dispositivo, ls -lZ /dev/SIMILAR, e si trova un tipo in grado di funzionare con $TARGET_PATH, è possibile utilizzare chcon -t SIMILAR_TYPE '$TARGET_PATH', Se tale operazione corregge il problema è possibile renderla permanente eseguendo semanage fcontext -a -t SIMILAR_TYPE '$FIX_TARGET_PATH' Se restorecon modifica il contesto, ciò indicherà che l'applicazione che ha creato il dispositivo, lo ha creato senza utilizzare le API di SELinux. Se si è in grado di sapere quale applicazione ha creato il dispositivo, si prega di inviare un bug report relativo a questa applicazione.

source: Attempt restorecon -v '$TARGET_PATH' or chcon -t SIMILAR_TYPE '$TARGET_PATH'
es: Intente restorecon -v '$TARGET_PATH' o chcon -t TIPO_SIMILAR '$TARGET_PATH'
fr: Essayez restorecon -v '$TARGET_PATH' or chcon -t SIMILAR_TYPE $TARGET_PATH
it: Tentare restorecon -v $TARGET_PATH oppure chcon -t SIMILAR_TYPE $TARGET_PATH

source: You need to change the label on $TARGET_PATH to a type of a similar device.
es: Necesita modificar la etiqueta en $TARGET_PATH con el tipo de un dispositivo similar.
fr: Vous devez modifier l'étiquette sur $TARGET_PATH en un type de périphérique similaire.
it: E' necessario modificare l'etichetta su $TARGET_PATH in un tipo di dispositivo simile.

source: Disable IPV6 properly.
es: Inhabilte IPV6 correctamente.
fr: Désactiver IPV6 correctement.
it: Disabilitare IPV6 in maniera propria.

source: you want to disable IPV6 on this machine
es: Si quiere desactivar IPV6 en esta máquina
fr: vous souhaitez désactiver IPV6 sur cette machine
it: si desidera disabilitare IPV6 su questa macchina

source: you need to set /proc/sys/net/ipv6/conf/all/disable_ipv6 to 1 and do not blacklist the module'
es: necesita establecer /proc/sys/net/ipv6/conf/all/disable_ipv6 a 1 y no poner en lista negra el módulo'
fr: vous devez définir set /proc/sys/net/ipv6/conf/all/disable_ipv6 sur 1 et ne pas mettre le module sur liste noire
it: è necessario impostare /proc/sys/net/ipv6/conf/all/disable_ipv6 ad 1 e non inserire il modulo nella blacklist'

source: Add net.ipv6.conf.all.disable_ipv6 = 1 to /etc/sysctl.conf
es: Añada net.ipv6.conf.all.disable_ipv6 = 1 a /etc/sysctl.conf
fr: Ajoutez net.ipv6.conf.all.disable_ipv6 = 1 à /etc/sysctl.conf
it: Aggiungere net.ipv6.conf.all.disable_ipv6 = 1 a /etc/sysctl.conf

source: SELinux is preventing access to files with the label, file_t.
es: SELinux está impidiendo el acceso a archivos con etiqueta file_t.
fr: SELinux empêche l'accès aux fichiers ayant l'étiquetage, file_t.
it: SELinux impedisce l'accesso ai file con l'etichetta file_t.

source: SELinux permission checks on files labeled file_t are being denied. file_t is the context the SELinux kernel gives to files that do not have a label. This indicates a serious labeling problem. No files on an SELinux box should ever be labeled file_t. If you have just added a disk drive to the system you can relabel it using the restorecon command. For example if you saved the home directory from a previous installation that did not use SELinux, 'restorecon -R -v /home' will fix the labels. Otherwise you should relabel the entire file system.
es: Las comprobaciones de permiso de SELinux en archivos con etiqueta file_t están siendo denegadas. file_t es el contexto que le da el kernel de SELinux a los archivos que no tienen ninguna etiqueta. Ésto indica un problema serio de etiquetado. Ningún archivo en un equipo con SELinux debería tener la etiqueta file_t. Si agregó una unidad de disco al sistema, puede reetiquetarla usando el comando restorecon. Por ejemplo, si guardó la carpeta home de una instalación previa que no usaba SELinux, 'restorecon -R -v /home' corregirá las etiquetas. Si no, debería reetiquetar todo el sistema de archivos.
fr: Les vérifications de permissions SELinux sur les fichiers file_t ont été refusées. file_t est le contexte donné par le noyau SELinux aux fichiers qui ne sont pas étiquetés. Ceci indique un problème d'étiquetage important. Aucun fichier sur une machine SELinux ne devrait avoir l'étiquette file_t. Si vous venez juste d'ajouter un nouveau lecteur de disque au système, vous pouvez le réétiqueter en utilisant la commande restorecon. Par exemple, si vous avez sauvegardé le dossier persobnel d'une installation antérieure qui n'utilisait pas SELinux, « restorecon -R -v /home » corrigera l'étiquetage. Autrement vous devriez réétiqueter tout le système de fichiers.
it: I controlli dei permessi di SELinux sui file etichettati file_t sono stati negati. file_t è il contesto che il kernel SELinux conferisce ai file che non possiedono un'etichetta. Ciò potrebbe indicare un serio problema riguardo l'etichettatura. Nessun file di SELinux dovrebbe essere etichettato file_t. Se è stata appena aggiunta una unità disco al sistema, è possibile rietichettarla utilizzando il comando restorecon. Per esempio se la home directory è stata salvata da una installazione precedente la quale non utilizzava SELinux, 'restorecon -R -v /home' correggerà le etichette. In caso contrario si può rietichettare l'intero file system.

source: You can execute the following command as root to relabel your computer system: "touch /.autorelabel; reboot"
es: Puede ejecutar el siguiente comando como root para reetiquetar su sistema: "touch /.autorelabel; reboot"
fr: Vous pouvez exécuter la commande suivante en tant que super-utilisateur pour réétiqueter le système de votre ordinateur : « touch /.autorelabel; reboot »
it: È possibile eseguire il seguente comando come utente root, in modo da rietichettare il sistema: "touch /.autorelabel; reboot"

source: this is caused by a newly created file system.
es: esto es causado por la creación de un nuevo sistema de archivos.
fr: ceci est dû à la création d'un nouveau système de fichiers.
it: ciò viene causato da un filesystem creato di recente.

source: you think this is caused by a badly mislabeled machine.
es: cree que esto es causado por una maquina muy mal etiquetada.
fr: vous pensez que ceci est dû à une machine mal étiquettée.
it: si pensa che la causa sia una macchina con etichetta errata.

source: you need to add labels to it.
es: necesita agregarle etiquetas.
fr: vous devez y ajouter des étiquettes.
it: è necessario aggiungergli una etichetta.

source: you need to fully relabel.
es: necesita reetiquetar completamente.
fr: vous devez complètement ré-étiqueter.
it: è necessaria una completa rietichettatura.

source: SELinux is preventing $SOURCE_PATH from creating a file with a context of $SOURCE_TYPE on a filesystem.
es: SELinux está previniendo acerca de la intención de $SOURCE_PATH de crear un archivo con el contexto $SOURCE_TYPE en un sistema de archivo.
fr: SELinux empêche $SOURCE_PATH de créer un fichier dans un contexte de $SOURCE_TYPE sur un système de fichiers.
it: SELinux impedisce a $SOURCE_PATH di creare un file con un contesto di $SOURCE_TYPE su un filesystem.

source: SELinux is preventing $SOURCE from creating a file with a context of $SOURCE_TYPE on a filesystem. Usually this happens when you ask the cp command to maintain the context of a file when copying between file systems, "cp -a" for example. Not all file contexts should be maintained between the file systems. For example, a read-only file type like iso9660_t should not be placed on a r/w system. "cp -p" might be a better solution, as this will adopt the default file context for the destination.
es: SELinux está previniendo acerca de la intención de $SOURCE de crear un archivo con el contexto $SOURCE_TYPE en un sistema de archivo. Normalmente esto pasa cuando se le pide al comando cp que mantenga el contexto de un archivo cuando copia de un sistema de archivo a otro. Por ejemplo "cp -a". No todos los contextos de archivo se deben mantener entre sistemas de archivo. Por ejemplo, un tipo de archivo sólo lectura como el iso9660_t no debe ser puesto en un sistema de l/e. "cp -p" puede ser una mejor solución, dado que adoptará el contexto de archivo por defecto en el destino.
fr: SELinux empêche $SOURCE de créer un fichier avec un contexte $SOURCE_TYPE sur un système de fichiers. Habituellement, ceci se produit lorsque vous demandez à la commande cp de maintenir le contexte d'un fichier lors d'une copie entre systèmes de fichiers, par exemple avec « cp -a ». Tous les contextes de fichiers ne doivent pas être maintenus entre systèmes de fichiers. Par exemple, un type de fichier lecture-seule comme iso9660_t ne doit pas être placé sur un système accessible en lecture/écriture. « cp -p » pourrait être une meilleure solution, car cette commande adoptera le contexte de fichier par défaut pour la destination.
it: SELinux ha impedito che $SOURCE crei un file con un contesto di $SOURCE_TYPE su un filesystem. Solitamente ciò avviene quando si chiede al comando cp di mantenere il contesto di un file quando si copia tra file system, ad esempio "cp -a". Non tutti i file di contesto dovrebbero essere mantenuti tra i file system. Ad esempio un tipo di file di sola lettura come l'iso9660_t non dovrebbe essere posto in un sistema r/w. "cp -p" potrebbe essere una soluzione migliore, in quanto adotterebbe il contesto file predefinito per la destinazione.

source: Use a command like "cp -p" to preserve all permissions except SELinux context.
es: Use un comando como "cp -p" para preservar todos los permisos excepto el contexto SELinux.
fr: Veuillez utiliser une commande comme « cp -p » pour préserver toutes les permissions sauf le contexte SELinux.
it: Usare un comando come "cp -p" per preservare tutti i permessi tranne il contesto SELinux.

source: you believe $SOURCE_BASE_PATH should be allowed to create $TARGET_BASE_PATH files
es: cree que $SOURCE_BASE_PATH debería permitir crear archivos $TARGET_BASE_PATH
fr: vous pensez que $SOURCE_BASE_PATH doit être autorisé à créer des fichiers $TARGET_BASE_PATH
it: si crede che $SOURCE_BASE_PATH dovrebbe essere autorizzato a creare file in $TARGET_BASE_PATH

source: you need to use a different command. You are not allowed to preserve the SELinux context on the target file system.
es: necesita utilizar un comando diferente. No tiene permitido preservar el contexto SELinux en el sistema de archivos elegido.
fr: vous devez utiliser une commande différente. Vous n'êtes pas autorisé à préserver le context SELinux sur le système de fichiers cible.
it: è necessario usare un comando differente. Non si è autorizzati a mantenere il contesto SELinux sul file system desiderato.

source: use a command like "cp -p" to preserve all permissions except SELinux context.
es: utilice un comando como "cp -p" para preservar todos los permisos excepto el contexto SELinux.
fr: utilisez une commande comme « cp -p » pour présever toutes les permissions à l'exception du contexte SELinux.
it: Usare un comando come "cp -p" per preservare tutti i permessi tranne il contesto SELinux.

source: SELinux is preventing the http daemon from sending mail.
es: SELinux está impidiendo al demonio http el envío de correo-e.
fr: SELinux empêche le démon http d'envoyer des courriels.
it: SELinux ha impedito al demone http di inviare posta.

source: SELinux has denied the http daemon from sending mail. An httpd script is trying to connect to a mail port or execute the sendmail command. If you did not setup httpd to sendmail, this could signal a intrusion attempt.
es: SELinux impidió al demonio http el envío de correo-e. Un guión de httpd está intentando conectarse a un puerto de correo o ejecutar sendmail. Si no configuró a httpd para usar sendmail, ésto podría indicar un intento de ataque.
fr: SELinux a refusé au démon http d'envoyer des courriels. Un script httpd essaye de se connecter à un port courriel ou d'exécuter une commande sendmail. Si vous n'avez pas configuré httpd pour envoyer des courriels, cela pourrait signaler une tentative d'intrusion.
it: SELinux ha impedito al demone http di inviare posta. Uno script httpd sta cercando di collegarsi ad una porta di posta oppure di eseguire il comando sendmail. Se non è stato impostato httpd in modo da inviare posta, ciò potrebbe segnalare un tentativo d'intrusione.

source: If you want httpd to send mail you need to turn on the $BOOLEAN boolean: "setsebool -P $BOOLEAN=1"
es: Si quiere que httpd pueda mandar correo, necesita poner en 1 el booleano $BOOLEAN: "setsebool -P $BOOLEAN=1"
fr: Si vous souhaitez que httpd puisse envoyer des courriels, vous devez activer le booléen $BOOLEAN : « setsebool -P $BOOLEAN=1 »
it: Se si desidera che httpd invii posta, allora bisogna abilitare il booleano $BOOLEAN: "setsebool -P $BOOLEAN=1"

source: you want to allow httpd to send mail
es: quiere permitir que httpd envíe correos
fr: vous souhaitez autoriser httpd à envoyer des courriels
it: Si desidera consentire ad httpd di inviare mail

source: you must setup SELinux to allow this
es: debe configurar a SELinux para permitir esto.
fr: vous devez paramétrer SELinux pour autoriser ceci
it: è necessario impostare SELinux per consentire ciò

source: SELinux prevented httpd $ACCESS access to http files.
es: SELinux le negó acceso httpd $ACCESS a archivos http.
fr: SELinux a empêché l'accès httpd $ACCESS aux fichiers http.
it: SELinux ha impedito a httpd l'accesso $ACCESS ai file http.

source: SELinux prevented httpd $ACCESS access to http files. Ordinarily httpd is allowed full access to all files labeled with http file context. This machine has a tightened security policy with the $BOOLEAN turned off, This requires explicit labeling of all files. If a file is a cgi script it needs to be labeled with httpd_TYPE_script_exec_t in order to be executed. If it is read only content, it needs to be labeled httpd_TYPE_content_t, it is writable content. it needs to be labeled httpd_TYPE_script_rw_t or httpd_TYPE_script_ra_t. You can use the chcon command to change these context. Please refer to the man page "man httpd_selinux" or <a href="http://fedora.redhat.com/docs/selinux-apache-fc3">FAQ</a> "TYPE" refers to one of "sys", "user" or "staff" or potentially other script types.
es: SELinux evitó que $ACCESS de httpd acceda a archivos http. Lo común es que a httpd se le garantice acceso completo a todos los archivos etiquetados con contexto de archivo http. Esta máquina tiene una política de seguridad muy estricta con $BOOLEAN deshabilitado. Esto necesita un etiquetado explícito de todos los archivos. Si un archivo es un script cgi necesita ser etiquetado con httpd_TYPE_script_exec_t para poder ser ejecutado. Si su contenido es de solo lectura, necesita ser reetiquetado como httpd_TYPE_content_t, si su contenido es de escritura, necesita ser reetiquetado como httpd_TYPE_script_rw_t o httpd_TYPE_script_ra_t. Puede utilizar el comando chcon para modificar este conexto. Por favor consulte la página man "man httpd_selinux" or <a href="http://fedora.redhat.com/docs/selinux-apache-fc3">FAQ</a> "TYPE" se o bien a "sys", "user" o "staff" o potencialmente otro tipo de script.
fr: SELinux a empêché l'accès httpd $ACCESS aux fichiers http. Normalement, httpd possède un accès complet à tous les fichiers étiquetés avec un contexte de fichier http. Cette machine possède une stratégie de sécurité plus stricte avec $BOOLEAN désactivé. Ceci requiert un étiquetage explicite de tous les fichiers. Si un fichier est un script cgi, il doit être étiqueté avec httpd_TYPE_script_exec_t afin de pouvoir être exécuté. Si son contenu est accessible en lecture seule, il doit être étiqueté httpd_TYPE_content_t. S'il s'agit d'un contenu accessible en écriture, il doit être étiqueté httpd_TYPE_script_rw_t ou httpd_TYPE_script_ra_t. Vous pouvez utiliser la commande chcon pour modifier ces contextes. Veuillez vous reporter à la page man « man httpd_selinux » ou à la <a href="http://fedora.redhat.com/docs/selinux-apache-fc3">FAQ</a> "TYPE" fait référence à « sys », « user », « staff » ou à d'autres types de scripts potentiels.
it: SELinux ha impedito ad httpd l'accesso $ACCESS ai file http. Normalmente httpd può accedere completamente a tutti i file con etichetta di contesto file http. Questa macchina possiede una politica di sicurezza serrata con il $BOOLEAN spento. Ciò richiede una etichettatura specifica per tutti i file. Se un file è uno script cgi, allora deve essere rietichettato con httpd_TYPE_script_exec_t per poter essere eseguito. Se invece rientra nel contesto di sola scrittura, è necessario rietichettarlo httpd_TYPE_content_t. Se è un contenuto scrivibile è necessario rietichettarlo httpd_TYPE_script_rw_t oppure httpd_TYPE_script_ra_t. E' possibile usare il comando chcon per modificare questo contesto. Fare riferimento alle pagine di man "man httpd_selinux" oppure alle <a href="http://fedora.redhat.com/docs/selinux-apache-fc3">FAQ</a> "TYPE" si riferisce ad uno fra "sys", "user" o "staff" oppure ad altri potenziali tipi di script.

source: Changing the "$BOOLEAN" boolean to true will allow this access: "setsebool -P $BOOLEAN=1"
es: Cambiando el valor "$BOOLEAN" a verdadero permitirá este acceso: "setsebool -P $BOOLEAN=1"
fr: Changer le booléen B $BOOLEAN » sur vrai permettra cet accès : « setsebool -P $BOOLEAN=1 »
it: Cambiando il booleano "$BOOLEAN" in true si permetterà questo accesso: "setsebool -P $BOOLEAN=1"

source: you want to allow httpd to execute cgi scripts and to unify HTTPD handling of all content files.
es: quiere permitir que httpd ejecute scripts cgi y que unifique manipulaciones HTTPD de todos los archivos de contenido.
fr: vous souhaitez autoriser httpd à exécuter des scripts cgi et à unifier la gestion HTTPD de tous les fichiers de contenu.
it: si vuole consentire ad httpd di eseguire script cgi e di unificare la gestione HTTPD di tutti i file di contenuto.

source: you must tell SELinux about this by enabling the 'httpd_unified' and 'http_enable_cgi' booleans
es: debe informarle esto a SELinux habilitando los booleanos 'httpd_unified' y 'http_enable_cgi'
fr: vous devez faire savoir ceci à SELinux en activant les booléens 'httpd_unified' et 'http_enable_cgi'
it: bisogna informare SELinux riguardo ciò abilitando i booleani 'httpd_unified' e 'http_enable_cgi'

source: SELinux prevented httpd $ACCESS access to $TARGET_PATH. httpd scripts are not allowed to write to content without explicit labeling of all files. If $TARGET_PATH is writable content. it needs to be labeled httpd_sys_rw_content_t or if all you need is append you can label it httpd_sys_ra_content_t. Please refer to 'man httpd_selinux' for more information on setting up httpd and selinux.
es: SELinux evitó acceso httpd $ACCESS a $TARGET_PATH. Los scripts de httpd no tienen permitido modificar contenidos sin etiquetado específico de todos los archivos. Si $TARGET_PATH es contenido modificable necesita ser etiquetado como httpd_sys_rw_content_t, o , si todo lo que necesita es agregar, se lo puede etiquetar conmo httpd_sys_ra_content_t. Por favor, lea 'man httpd_selinux' para más información sobre la configuración de httpd y selinux.
fr: SELinux a empêché l'accès httpd $ACCESS à $TARGET_PATH. Les scripts httpd n'ont pas le droit d'écrire sur un contenu sans un étiquetage explicite de tous les fichiers. Si $TARGET_PATH est un contenu accessible en écriture, il doit être étiqueté httpd_sys_rw_content_t, si vous avez uniquement besoin d'effectuer un ajout, vous pouvez l'étiqueter httpd_sys_ra_content_t. Veuillez vous reporter à « man httpd_selinux » pour obtenir davantage d'informations sur le paramétrage de selinux et httpd.
it: SELinux ha impedito l'accesso httpd $ACCESS a $TARGET_PATH. Gli script httpd non possono scrivere il contenuto senza una etichettatura esplicita di tutti i file. Se $TARGET_PATH è un contenuto scrivibile esso deve essere etichettato httpd_sys_rw_content_t oppure se è necessario solo aggiungere del contenuto sarà possibile etichettarlo httpd_sys_ra_content_t. Consultare 'man httpd_selinux' per maggiori informazioni su come impostare httpd e selinux.

source: You need to change the label on '$FIX_TARGET_PATH'
es: Necesita modificar la etiqueta a '$FIX_TARGET_PATH'
fr: Vous devez modifier l'étiquette sur « $FIX_TARGET_PATH »
it: E' necessario modificare l'etichetta su '$FIX_TARGET_PATH'
