Repository: Justasic/setroubleshoot
Catalog: plugins/po/*.po
Languages: es, fr, it

source: SELinux is preventing Samba ($SOURCE_PATH) "$ACCESS" access to $TARGET_PATH.
es: SELinux está impidiendo a Samba ($SOURCE_PATH) el acceso "$ACCESS" a $TARGET_PATH.
fr: SELinux empêche Samba ($SOURCE_PATH) d'« $ACCESS » au périphérique $TARGET_PATH.
it: SELinux impedisce a Samba l'accesso ($SOURCE_PATH) "$ACCESS" al dispositivo $TARGET_PATH.

source: SELinux denied samba access to $TARGET_PATH. If you want to share this directory with samba it has to have a file context label of samba_share_t. If you did not intend to use $TARGET_PATH as a samba repository it could indicate either a bug or it could signal a intrusion attempt. Please refer to 'man samba_selinux' for more information on setting up Samba and SELinux.
es: SELinux impidió a samba el acceso a $TARGET_PATH. Si quiere compartir esta carpeta con samba, debe tener el contexto de archivo etiquetado como samba_share_t. Si no pretende utilizar $TARGET_PATH como un repositorio samba, ésto podría indicar un error o un intento de ataque. Vea 'man samba_selinux' para obtener mayor información acerca de la configuración de Samba y SELinux.
fr: SELinux a refusé à samba l'accès à $TARGET_PATH. Si vous souhaitez partager ce répertoire avec samba, il doit comporter un étiquetage de contexte de fichier tel que samba_share_t. Si vous n'avez pas l'intention d'utiliser $TARGET_PATH en tant que répertoire samba cela peut soit signifier une anomalie, soit une tentative d'intrusion. Veuillez vous référer à la page de manuel 'man samba_selinux' pour plus d'informations sur la manière de configurer Samba et SELinux.
it: SELinux ha negato a samba l'accesso a $TARGET_PATH. Se si desidera condividere questa directory con samba, allora sarà necessaria l'etichetta del contesto del file samba_share_t. Se non si desidera utilizzare $TARGET_PATH come repositorio di samba, tale situazione potrebbe indicare un bug oppure un tentativo d'intrusione. Consultare 'man samba_selinux' per maggiori informazioni su come impostare Samba e SELinux.

source: You can alter the file context by executing chcon -R -t samba_share_t '$TARGET_PATH' You must also change the default file context files on the system in order to preserve them even on a full relabel. "semanage fcontext -a -t samba_share_t '$FIX_TARGET_PATH'"
es: Puede modificar el contexto de archivo ejecutando chcon -R -t samba_share_t '$TARGET_PATH' También debe cambiar el archivo predeterminado de contexto de archivos en el sistema, para preservarlos incluso después de un reetiquetado completo. "semanage fcontext -a -t samba_share_t '$FIX_TARGET_PATH'"
fr: Vous pouvez modifier le contexte de fichier en exécutant chcon -R -t samba_share_t '$TARGET_PATH' Vous devez aussi changer le dossier par défaut des fichiers de contexte de votre système, même lors d'un réétiquetage complet, de manière à les préserver. « semanage fcontext -a -t samba_share_t '$FIX_TARGET_PATH' »
it: È possibile alterare il contesto del file eseguendo chcon -R -t samba_share_t '$TARGET_PATH' È necessario inoltre modificare il contesto file predefinito dei file sul sistema per preservarli anche da una completa rietichettatura. "semanage fcontext -a -t samba_share_t '$FIX_TARGET_PATH'"

source: SELinux has denied $SOURCE from connecting to a network port $PORT_NUMBER within a sandboxt. If $SOURCE should be allowed to connect on $PORT_NUMBER, use need to use a different sandbox type like sandbox_web_t or sandbox_net_t. sandbox -X -t sandbox_net_t $SOURCE. If $SOURCE is not supposed to connect to $PORT_NUMBER, this could signal a intrusion attempt.
es: SELinux impidió a $SOURCE conectarse al puerto de red $PORT_NUMBER dentro de sandboxt. Si $SOURCE debería poder conectarse a $PORT_NUMBER, necesita usar un tipo de sandbox como sandbox_web_t o sandbox_net_t. sandbox -X -t sandbox_net_t $SOURCE. Si se supone que $SOURCE no debería conectarse a $PORT_NUMBER, ésto podría indicar de intento de ataque.
fr: SELinux a interdit à $SOURCE de se connecter à un port réseau $PORT_NUMBER depuis un bac à sable. Si $SOURCE doit être autorisé à se connecter au port $PORT_NUMBER, vous devrez utiliser un type de bac à sable différent comme sandbox_web_t ou sandbox_net_t. sandbox -X -t sandbox_net_t $SOURCE. Si $SOURCE n'est pas supposé se connecter à $PORT_NUMBER, cela peut signifier une tentative d'intrusion.
it: SELinux ha negato a $SOURCE di connettersi alla porta di rete $PORT_NUMBER dentro una sandboxt. Se a $SOURCE dovrebbe essere permesso di connettersi alla $PORT_NUMBER, bisogna utilizzare un tipo differente di sandbox come sandbox_web_t o sandbox_net_t. sandbox -X -t sandbox_net_t $SOURCE. Se non si suppone la connessione su $PORT_NUMBER, questo potrebbe essere un segnale di un tentativo di intrusione.

source: If you want to allow $SOURCE to connect to $PORT_NUMBER, you can execute # sandbox -X -t sandbox_net_t $SOURCE
es: Si quiere permitir que $SOURCE se conecte a $PORT_NUMBER, ejecute # sandbox -X -t sandbox_net_t $SOURCE
fr: Si vous souhaitez autoriser $SOURCE à se connecter à $PORT_NUMBER, vous pouvez exécuter # sandbox -X -t sandbox_net_t $SOURCE
it: Se si desidera permettere a $SOURCE di connettersi a $PORT_NUMBER, si può eseguire # sandbox -X -t sandbox_net_t $SOURCE

source: you want to allow $SOURCE_PATH to connect to network port $PORT_NUMBER
es: quiere permitir a $SOURCE_PATH conectarse al puerto de red $PORT_NUMBER
fr: vous souhaitez autoriser $SOURCE_PATH à se connecter au port réseau $PORT_NUMBER
it: Si desidera permettere a $SOURCE_PATH la connessione alla porta di rete $PORT_NUMBER

source: you need to modify the sandbox type. sandbox_web_t or sandbox_net_t. For example: sandbox -X -t sandbox_net_t $SOURCE_PATH Please read 'sandbox' man page for more details.
es: necesita modificar el tipo de caja de arena. sandbox_web_t o sandbox_net_t. Por ejemplo: sandbox -X -t sandbox_net_t $SOURCE_PATH Para mas detalles, por favor lea las páginas man de 'sandbox'.
fr: vous devez modifier le type sandbox. sandbox_web_t ou sandbox_net_t. Par exemple : sandbox -X -t sandbox_net_t $SOURCE_PATH Consulter la page de manuel de « sandbox » pour plus d'informations.
it: bisogna modificare il tipo di sandbox. sandbox_web_t o sandbox_net_t. Per esempio: sandbox -X -t sandbox_net_t $SOURCE_PATH Leggere la pagina man di 'sandbox' per maggiori informazioni.

source: Your system may be seriously compromised!
es: ¡Su sistema puede estar seriamente comprometido!
fr: Votre système peut être sérieusement compromis !
it: Il sistema potrebbe essere seriamente compromesso!

source: SELinux has prevented $SOURCE from modifying $TARGET. This denial indicates $SOURCE was trying to modify the selinux policy configuration. All applications that need this access should have already had policy written for them. If a compromised application tries to modify the SELinux policy this AVC will be generated. This is a serious issue. Your system may very well be compromised.
es: SELinux impidió a $SOURCE modificar $TARGET. Esta negación muestra que $SOURCE intentaba modificar la política de configuración de selinux. Todas las aplicaciones que necesiten este acceso, deberían haber tenido algún tipo de política definida. Si una aplicación vulnerada intenta modificar la política de selinux, este AVC será generado. Este es un problema serio. Su sistema puede estar comprometido.
fr: SELinux a empêché $SOURCE de modifier $TARGET. Ce déni signifie que $SOURCE a essayé de modifier la configuration de la stratégie de sécurité de SELinux. Toutes les applications nécessitant cet accès devraient déjà avoir une stratégie de sécurité définie. Si une application compromise essaie de modifier la stratégie de sécurité de SELinux, cet AVC (Access Vector Cache, message d'alerte de sécurité) sera affiché. Ceci est un problème sérieux. Votre système pourrait très bien être compromis.
it: SELinux ha prevenuto che $SOURCE modificasse $TARGET. Questo rifiuto indica che $SOURCE stava tentando di modificare la configurazione della politica di selinux. Tutte le applicazioni che necessitano di questo accesso hanno una politica già scritta. Se una applicazione compromessa tenta di modificare la politica di SELinux verrà generato questo messaggio AVC. Questa è una questione seria. Il sistema potrebbe essere seriamente compromesso.

source: you did not directly cause this AVC through testing.
es: no provocó directamente este AVC mediante una prueba.
fr: vous n'avez pas directement provoqué cet AVC en effectuant des tests.
it: non si vuole causare direttamente questo AVC attraverso il testing.

source: if you think that you might have been hacked
es: si piensa que ha sido víctima de un ataque
fr: si vous pensez que vous pourriez avoir été la cible d'un pirate
it: se si pensa ciò allora si potrebbe essere sotto attacco hacker

source: Your system may be seriously compromised! $SOURCE_PATH tried to modify SELinux enforcement.
es: ¡Su sistema puede estar seriamente comprometido! $SOURCE_PATH intentó modificar el estado actual de SELinux.
fr: Votre système peut être sérieusement compromis ! $SOURCE_PATH a essayé de modifier la mise en application de SELinux.
it: Il sistema potrebbe essere seriamente compromesso! $SOURCE_PATH ha cercato di modificare la modalità enforcement di SELinux.

source: SELinux has prevented $SOURCE from writing to a file under /selinux. Files under /selinux control the way SELinux is configured. All programs that need to write to files under /selinux should have already had policy written for them. If a compromised application tries to turn off SELinux this AVC will be generated. This is a serious issue. Your system may very well be compromised.
es: SELinux impidió a $SOURCE escribir en un archivo bajo /selinux. Los archivos en /selinux controlan la forma en que SELinux está configurado. Todos los programas que necesiten escribir en /selinux ya deberían tener alguna política escrita para las mismas. Si una aplicación comprometida intenta desactivar SElinux, este AVC será generado. Este es un problema serio. Su sistema puede estar comprometido.
fr: SELinux a empêché $SOURCE d'écrire dans un fichier sous /selinux. Les fichiers sous /selinux contrôlent la façon dont SELinux est configuré. Tous les programmes ayant besoin d'écrire dans des fichiers sous /selinux devraient déjà avoir une stratégie écrite pour eux. Si une application compromise essaie de désactiver SELinux, ce message AVC sera généré. C'est un problème sérieux. Votre système pourrait très bien être compromis.
it: SELinux ha prevenuto che $SOURCE modificasse un file sotto /selinux. I file sotto /selinux controllano il modo in cui è configurato SELinux. Tutte le applicazioni che necessitano di scrivere i file sotto /selinux dovrebbero avere una politica già scritta. Se una applicazione compromessa tenta di spegnere SELinux verrà generato questo messaggio AVC. Questa è una questione seria. Il sistema potrebbe essere seriamente compromesso.

source: you believe $SOURCE_PATH tried to disable SELinux.
es: cree que $SOURCE_PATH ha intentado deshabilitar SELinux.
fr: vous pensez que $SOURCE_PATH a tenté de désactiver SELinux.
it: si crede che $SOURCE_PATH ha tentato di disabilitare SELinux.

source: you may be under attack by a hacker, since confined applications should never need this access.
es: podría estar siendo víctima de un ataque, ya que las aplicaciones confinadas nunca deberían necesitar este acceso.
fr: vous pourriez être victime d'une attaque d'un pirate car les applications confinées ne devraient jamais nécessiter cet accès.
it: si potrebbe essere sotto attacco da un hacker, dal momento che le applicazioni confinate non dovrebbero mai richiedere questo accesso.

source: SELinux denied access requested by $SOURCE. $TARGET_PATH may be a mislabeled. sshd is allowed to read content in /root/.ssh directory if it is labeled correctly.
es: SELinux ha denegado el acceso solicitado por $SOURCE. $TARGET_PATH puede estar mal etiquetado. sshd tiene permitido leer los contenidos de la carpeta /root/.ssh, siempre que esté correctamente etiquetada.
fr: L'accès refusé par SELinux et demandé par $SOURCE. $TARGET_PATH peut être mal étiqueté. sshd est autorisé à lire le contenu du répertoire /root/.ssh s'il est correctement étiqueté.
it: SELinux ha negato l'accesso richiesto da $SOURCE. $TARGET_PATH potrebbe essere stato etichettato incorrettamente. sshd è in grado di leggere il contenuto nella directory /root/.ssh se etichettato in modo corretto.

source: Restore Context
es: Restaurar Contexto
fr: Restaure le contexte
it: Ripristinare il contesto

source: SELinux is preventing $SOURCE_PATH "$ACCESS" to $TARGET_PATH.
es: SELinux le está negando a $SOURCE_PATH el acceso "$ACCESS" a $TARGET_PATH.
fr: SELinux empêche $SOURCE_PATH d'« $ACCESS » à $TARGET_PATH.
it: SELinux impedisce $SOURCE_PATH "$ACCESS" a $TARGET_PATH.

source: SELinux denied $SOURCE access to $TARGET_PATH. If this is a swapfile it has to have a file context label of swapfile_t. If you did not intend to use $TARGET_PATH as a swapfile it probably indicates a bug, however it could also signal a intrusion attempt.
es: SELinux impidió a $SOURCE acceder a $TARGET_PATH. Si éste es un archivo swap, se debe cambiar a la etiqueta de contexto de archivo swapfile_t. Si no intenta usar $TARGET_PATH como un archivo swap, probablemente sea un error, sin embargo, también podría indicar un intento de ataque.
fr: SELinux a refusé à $SOURCE l'accès à $TARGET_PATH. S'il s'agit d'un fichier swap, il doit comporter un étiquetage de contexte de fichier tel que swapfile_t. Si vous n'avez pas l'intention d'utiliser $TARGET_PATH en tant que fichier swap, cela indique vraisemblablement la présence d'une anomalie ; cependant il peut également s'agir d'une tentative d'intrusion.
it: SELinux ha negato a $SOURCE di accedere a $TARGET_PATH. Se esso è uno swapfile allora deve avere una etichetta swapfile_t. Se non si desiderava utilizzare $TARGET_PATH come swapfile, tale comportamento potrebbe indicare un bug, oppure un tentativo d'intrusione.

source: You can alter the file context by executing chcon -t swapfile_t '$TARGET_PATH' You must also change the default file context files on the system in order to preserve them even on a full relabel. "semanage fcontext -a -t swapfile_t '$FIX_TARGET_PATH'"
es: Puede cambiar el contexto de archivo ejecutando chcon -t swapfile_t '$TARGET_PATH' También debe cambiar el archivo predeterminado de contexto de archivos en el sistema, para preservarlos incluso después de un reetiquetado completo. "semanage fcontext -a -t swapfile_t '$FIX_TARGET_PATH'"
fr: Vous pouvez modifier le contexte du fichier en exécutant chcon - swapfile_t '$TARGET_PATH' Vous devez aussi changer le dossier par défaut des fichiers de contexte de votre système, même lors d'un réétiquetage complet, de manière à les préserver. « semanage fcontext -a -t swapfile_t '$FIX_TARGET_PATH' »
it: È possibile alterare il contesto del file eseguendo chcon -t swapfile_t '$TARGET_PATH' È necessario inoltre modificare il contesto file predefinito dei file sul sistema per preservarli anche da una completa rietichettatura. "semanage fcontext -a -t swapfile_t '$FIX_TARGET_PATH'"

source: you do not believe your $SOURCE_PATH should be modifying the kernel, by loading kernel modules
es: no cree que $SOURCE_PATH debería estar modificando el kernel, cargando los módulos del kernel
fr: vous pensez que $SOURCE_PATH ne devrait pas modifier le noyau en chargeant des modules de noyau
it: non si crede che $SOURCE_PATH dovrebbe modificare il kernel, caricando i moduli del kernel

source: You might have been hacked.
es: Podría haber sido atacado.
fr: Vous pourriez être la cible d'un pirate.
it: Il sistema potrebbe essere stato penetrato.

source: Your system may be seriously compromised! $SOURCE_PATH tried to load a kernel module.
es: ¡Su sistema puede estar seriamente comprometido! $SOURCE_PATH intentó cargar un módulo del kernel.
fr: Votre système peut être sérieusement compromis ! $SOURCE_PATH a essayé de charger un module du noyau.
it: Il sistema potrebbe essere seriamente compromesso! $SOURCE_PATH ha cercato di caricare un modulo del kernel.

source: SELinux has prevented $SOURCE from loading a kernel module. All confined programs that need to load kernel modules should have already had policy written for them. If a compromised application tries to modify the kernel this AVC will be generated. This is a serious issue. Your system may very well be compromised.
es: SELinux impidió a $SOURCE cargar un módulo del kernel. Todos los programas confinados que necesiten cargar módulos del kernel deberían tener políticas definidas que les permitan hacerlo. Si una aplicación vulnerada intenta modificar el kernel, se generará este AVC. Este es un problema serio. Su equipo muy probablemente puede estar comprometido.
fr: SELinux empêche $SOURCE de charger un module du noyau. Tous les programmes confinés ayant besoin de charger un module du noyau devraient déjà avoir une stratégie écrite pour eux. Si une application compromise essaie de modifier le noyau, ce message AVC sera généré. C'est un problème sérieux. Votre système pourrait très bien être compromis.
it: SELinux ha prevenuto che $SOURCE caricasse un modulo del kernel. Tutte le applicazioni che necessitano di caricare un modulo del kernel dovrebbero avere una politica già scritta. Se una applicazione compromessa tenta di modificare il kernel verrà generato questo messaggio AVC. Questa è una questione seria. Il sistema potrebbe essere seriamente compromesso.

source: you do not believe that $SOURCE_PATH should be attempting to modify the kernel by loading a kernel module.
es: no cree que $SOURCE_PATH deba intentar modificar el kernel cargando un módulo del kernel.
fr: vous pensez que $SOURCE_PATH ne devrait pas tenter de modifier le noyau en chargeant un module de noyau.
it: non si crede che $SOURCE_PATH dovrebbe cercare di modificare il kernel caricando un modulo del kernel.

source: A process might be attempting to hack into your system.
es: Un proceso podría estar intentando atacar a su sistema.
fr: Un processus pourrait être en train de tenter de pirater votre système.
it: Un processo potrebbe cercare di penetrare dentro il sistema.

source: SELinux is preventing $SOURCE_PATH the "sys_resource" capability.
es: SELinux está impidiendo a $SOURCE_PATH la capacidad "sys_resource" .
fr: SELinux empêche $SOURCE_PATH d'accéder à s y« s_resource ».
it: SELinux nega a $SOURCE_PATH la funzione "sys_resource".

source: Confined domains should not require "sys_resource". This usually means that your system is running out some system resource like disk space, memory, quota etc. Please clear up the disk and this AVC message should go away. If this AVC continues after you clear up the disk space, please report this as a bug.
es: Los dominios confinados no deberían requerir “sys_resource”. Esto normalmente significa que su sistema se está quedando sin algún recurso del sistema como espacio de disco, memoria, cuota, etc. Haga una limpieza de disco y este mensaje AVC debería desaparecer. Si este AVC persiste después de la limpieza de disco, por favor informe de esto como un error.
fr: Les domaines confinés ne doivent pas nécessiter « sys_resource ». Ceci signifie habituellement que votre système est à court de ressources systèmes comme l'espace disque, la mémoire, les quota, etc.. Merci de faire de la place sur le disque et ce message AVC disparaîtra. Si ce message AVC continue après avoir fait de la place sur le disque, veuillez le rapporter en tant qu'anomalie.
it: I domini confinati non dovrebbero richiedere "sys_resource". Questo di solito significa che il proprio sistema ha terminato qualche risorsa come lo spazio su disco, la memoria, quota etc. Liberare il disco e questo messaggio AVC dovrebbe scomparire. Se questo AVC continua anche dopo aver liberato spazio sul disco, segnalare questo come un bug.

source: you do not want processes to require capabilities to use up all the system resources on your system;
es: no quiere que los procesos requieran la capacidad de agotar todos los recursos de su sistema;
fr: vous ne voulez pas que les processus requièrent des capacités à utiliser toutes les ressources du système sur votre système ;
it: non si vogliono processi che abbiano la capacità di utilizzare tutte le risorse del proprio sistema;
