Repository: Justasic/setroubleshoot
Catalog: plugins/po/*.po
Languages: es, fr, it

source: If you want to allow users to connect to PostgreSQL
es: Si quiere permitir a los usuarios conectarse con PostgreSQL
fr: Si vous souhaitez autoriser les utilisateurs à se connecter à PostgreSQL
it: Se si desidera consentire agli utenti di connettersi al database PostgreSQL

source: If you want to allow httpd to connect to sasl
es: Si quiere permitir a httpd conectarse a sasl
fr: Si vous souhaitez autoriser httpd à se connecter à sasl
it: Se si desidera permettere a httpd la connessione a sasl

source: If you want to unify HTTPD to communicate with the terminal. Needed for entering the passphrase for certificates at the terminal.
es: Si quiere unificar HTTPD para comunicarse con el terminal. Se necesita para introducir la frase de paso para los certificados en la terminal.
fr: Si vous souhaitez unifier HTTPD pour communiquer avec le terminal. Ceci est nécessaire pour saisir la phrase de passe des certificats sur le terminal.
it: Se si desidera unificare HTTPD per comunicare con il terminale. Necessario per l'inserimento di frasi d'accesso per certificati nel terminale.

source: If you want to allow apache scripts to write to public content, directories/files must be labeled public_rw_content_t.
es: Si quiere permitir a los guiones de apache escribir contenido público, las carpetas/archivos deben estar etiquetados con public_rw_content_t.
fr: Si vous souhaitez autoriser les scripts apache à écrire sur des contenus publics. Les fichiers ou répertoires doivent être étiquetés public_rw_content_t.
it: Se si desidera permettere agli script apache di scrivere contenuti pubblici. Directory/file devono essere etichettati public_rw_content_t.

source: If you want to allow rsync to modify public files used for public file transfer services. Files/Directories must be labeled public_content_rw_t.
es: Si quiere permitir que rsync modifique los archivos públicos utilizados por servicios de transferencia de archivos públicos. Los archivos/carpetas deben ser etiquetados como public_content_rw_t.
fr: Si vous souhaitez autoriser rsync à modifier les fichiers publics utilisés pour les services de transfert de fichiers publics. Les fichiers ou répertoires doivent être étiquetés public_content_rw_t.
it: Se si desidera consentire a rsync di modificare file pubblici usati per il servizio di trasferimento di file pubblici. I file/cartelle devono essere etichettati public_content_rw_t.

source: If you want to determine whether mplayer can make its stack executable.
es: Si quiere determinar si mplayer puede hacer su pila ejecutable.
fr: Si vous souhaitez déterminer si mplayer peut rendre sa pile exécutable.
it: Se si desidera determinare se mplayer può rendere il proprio stack eseguibile.

source: If you want to allow users to run TCP servers (bind to ports and accept connection from the same domain and outside users) disabling this forces FTP passive mode and may change other protocols.
es: Si quiere permitir a los usuarios ejecutar servidores TCP (asociados a puertos y aceptando conexiones desde el mismo dominio y de usuarios externos). Desactivar ésto hace que FTP se ejecute en modo pasivo y tal vez pueda afectar a otros protocolos.
fr: Si vous souhaitez autoriser les utilisateurs à exécuter des serveurs TCP (lier aux ports et accepter la connexion depuis le même domaine et des utilisateurs externes). Désactiver ceci force le mode FTP passif et peut modifier d'autres protocoles.
it: Se si desidera consentire agli utenti di eseguire server TCP (legati alle porte e accettando connessioni dallo stesso dominio e fuori dagli utenti) disabilitandola si forza la modalità FTP passiva e si potrebbero modificare altri protocolli.

source: If you want to allow xend to run qemu-dm. Not required if using paravirt and no vfb.
es: Si quiere permitir que xend ejecute qemu-dm. No se requiere si se utiliza paravirt y no vfb.
fr: Si vous souhaitez autoriser xend à exécuter qemu-dm. Ceci n'est pas requis si vous utilisez la paravirtualisation et pas de vfb.
it: Se si desidera consentire a xend di eseguire qemu-dm. Non richiesto se si utilizza la paravirtualizzazione e nessun vfb.

source: If you want to determine whether sftpd-can read and write files in user home directories.
es: Si quiere comprobar si sftpd puede leer y escribir archivos en las carpetas de usuario.
fr: Si vous souhaitez déterminer si sftpd peut accéder aux fichiers en lecture et en écriture dans les répertoires utilisateurs
it: Se si desidera determinare se sftpd può leggere e scrivere file nelle cartelle home degli utenti.

source: If you want to support fusefs home directories
es: Si quiere tener soporte para fusefs en las carpetas de usuario
fr: Si vous souhaitez prendre en charge les répertoires utilisateurs fusefs
it: Se si desidera il supporto a fusefs per le cartelle home

source: If you want to allow the Telepathy connection managers to connect to any network port.
es: Si quiere permitir a los gestores de conexión de Telepathy conectarse a cualquier puerto de red.
fr: Si vous souhaitez autoriser les gestionnaires de connexion Telepathy à se connecter à n'importe quel port réseau.
it: Se si desidera consentire ai gestori di connessioni Telepathy di connettersi ad una generica porta di rete.

source: If you want to allow confined virtual guests to manage cifs files
es: Si quiere permitir a invitados virtuales confinados sean capaces de administrar archivos cifs
fr: Si vous souhaitez autoriser les invités virtuels confinés à gérer les fichiers cifs
it: Se si desidera consentire ai guest virtuali confinati di gestire file cifs

source: If you want to allow the Irssi IRC Client to connect to any port, and to bind to any unreserved port.
es: Si quiere permitir al cliente de IRC Irssi conectarse a cualquier puerto, y enlazar con cualquier puerto no reservado.
fr: Si vous souhaitez autoriser le client IRC Irssi à se connecter à tous les ports et à se lier à tout port non-réservé.
it: Se si desidera consentire ai client IRC Irssi di connettersi a qualsiasi porta, e di collegarsi a qualsiasi porta non usata.

source: If you want to allow confined applications to use nscd shared memory.
es: Si quiere permitir a las aplicaciones confinadas utilizar memoria compartida nscd.
fr: Si vous souhaitez autoriser les applications confinées à utiliser la mémoire partagée de nscd.
it: Se si desidera consentire alle applicazioni confinate di usare la memoria condivisa nscd.

source: If you want to determine whether attempts by wine to mmap low regions should be silently blocked.
es: Si quiere comprobar si los intentos de wine para mmap regiones bajas deberían bloquearse silenciosamente.
fr: Si vous souhaitez déterminer si les tentatives de wine d'utiliser mmap sur les régions de mémoire basse doivent être ignorées en silence.
it: Se si desidera determinare se i tentativi di wine verso le aree basse di mmap dovrebbero essere bloccati senza chiedere.

source: If you want to allow racoon to read shadow
es: Si quiere permitir a racoon leer shadow
fr: Si vous souhaitez autoriser racoon à lire shadow
it: Se si desidera consentire a racoon la lettura shadow

source: If you want to allow Puppet master to use connect to MySQL and PostgreSQL database
es: Si quiere permitir al Puppet maestro que va a usar conectarse a bases de datos de MySQL y PostgreSQL
fr: Si vous souhaitez autoriser Puppet master à se connecter aux bases de données MySQL et PostgreSQL
it: Se si desidera consentire a Puppet master di usare la connessione ai database MySQL e PostgreSQL

source: If you want to allow HTTPD to connect to port 80 for graceful shutdown
es: Si quiere permitirle a HTTPD conectarse al puerto 80 para cerrarse correctamente
fr: Si vous souhaitez autoriser HTTPD à se connecter au port 80 pour un arrêt propre
it: Se si desidera permettere a HTTPD di collegarsi alla porta 80 per un arresto corretto

source: If you want to allow system to run with NIS
es: Si quiere permitir que el sistema se ejecute con NIS
fr: Si vous souhaitez autoriser le système à être exécuté avec NIS
it: Se si desidera consentire al sistema l'esecuzione con NIS

source: If you want to allow users to login using a yubikey server
es: Si quiere permitir a los usuarios acceder usando un servidor yubikey
fr: Si vous souhaitez autoriser les utilisateurs à se connecter en utilisant un serveur yubikey
it: Se si desidera permettere agli utenti il login utilizzando un server yubikey

source: If you want to allow a user to login as an unconfined domain
es: Si quiere permitir a un usuario iniciar sesión como un dominio no confinado
fr: Si vous souhaitez autoriser un utilisateur à se connecter en tant que domaine non-confiné
it: Se si desidera consentire agli utenti di effettuare il login come domini non confinati

source: If you want to disable kernel module loading.
es: Si quiere deshabilitar la carga de módulos del kernel.
fr: Si vous interdire le chargement de modules noyau.
it: Se si desidera disabiliare il caricamento dei moduli del kernel.

source: If you want to allow pacemaker memcheck-amd64- to use executable memory
es: Si quiere permitir al marcapasos memcheck-amd64- usar memoria ejecutable
fr: Si vous souhaitez autoriser pacemaker memcheck-amd64- à utiliser la mémoire exécutable
it: Se si desidera permettere a pacemaker memcheck-amd64- di utilizzare la memoria eseguibile

source: If you want to allow httpd to act as a FTP client connecting to the ftp port and ephemeral ports
es: Si quiere permitir a httpd actuar como un cliente FTP conectándose al puerto ftp y puertos efímeros.
fr: Si vous souhaitez autoriser httpd à agir en tant que client FTP se connectant au port ftp et aux ports éphémères
it: Se si desidera consentire a httpd di agire come un client FTP connettendosi alla porta ftp e alle porte ephemeral

source: If you want to determine whether ftpd can bind to all unreserved ports for passive mode.
es: Si quiere comprobar si ftpd enlazarse a todos los puertos no reservados para modo pasivo.
fr: Si vous souhaitez déterminer si ftpd peut lier tous les ports non-réservés pour le mode passif.
it: Se si desidera determinare se ftpd può associarsi a tutte le porte disponibili in modalità passiva.

source: If you want to allow samba to modify public files used for public file transfer services. Files/Directories must be labeled public_content_rw_t.
es: Si quiere permitir a samba modificar los archivos públicos utilizados por servicios de transferencia de archivos públicos. Los archivos/carpetas deben ser etiquetados como public_content_rw_t.
fr: Si vous souhaitez autoriser samba à modifier des fichiers publics utilisés pour les services de transfert de fichiers publics. Les fichiers ou répertoires doivent être étiquetés public_content_rw_t.
it: Se si desidera consentire a samba di modificare file pubblici usati per il servizio di trasferimento di file pubblici. I file/directory devono essere etichettati public_content_rw_t.

source: If you want to allow gssd to read temp directory. For access to kerberos tgt.
es: Si quiere permitir a gssd leer carpetas temporales. Para acceder a tgt kerberos.
fr: Si vous souhaitez autoriser gssd à lire le répertoire temporaire. Pour accès aux tgt kerberos.
it: Se si desidera consentire a gssd di leggere cartelle temp. Per accedere a tgt kerberos.

source: If you want to determine whether Cobbler can access nfs file systems.
es: Si quiere comprobar si Cobbler puede acceder a sistemas de archivos nfs.
fr: Si vous souhaitez déterminer si Cobbler peut accéder aux systèmes de fichiers nfs.
it: Se si desidera determinare se Cobbler può accedere ai file system nfs.

source: If you want to allow tor to act as a relay
es: Si quiere permitir a tor actuar como un retransmisor
fr: Si vous souhaitez autoriser tor à agir en tant que relais
it: Se si desidera permettere a tor di agire come un relay

source: If you want to allow unconfined executables to make their stack executable. This should never, ever be necessary. Probably indicates a badly coded executable, but could indicate an attack. This executable should be reported in bugzilla
es: Si quiere permitir a ejecutables no confinados hacer su pila ejecutable. Esto no debería ser necesario jamás. Probablemente indique un ejecutable mal programado, pero también podría indicar que está siendo víctima de un ataque. Este ejecutable debería ser reportado en bugzilla.
fr: Si vous souhaitez autoriser des exécutables non-confinés à rendre leur pile exécutable. Ceci ne devrait jamais être nécessaire et indique probablement un exécutable mal codé, mais il pourrait aussi s'agir d'une attaque. Cet exécutable devrait être rapporté sur Bugzilla
it: Se si desidera consentire agli eseguibili non confinati di rendere il proprio stack eseguibile. Ciò non dovrebbe essere mai necessario. Probabilmente indica un eseguibile scritto male, ma potrebbe indicare un attacco. Questo eseguibile va riportato in bugzilla

source: If you want to allow confined virtual guests to interact with the sanlock
es: Si quiere permitir que los invitados virtuales confinados interactúen con el sanlock
fr: Si vous souhaitez autoriser les invités virtuels confinés à interagir avec sanlock
it: Se si desidera consentire ai guest virtuali confinati di interagire con il sanlock

source: If you want to allow all daemons to use tcp wrappers.
es: Si quiere permitir a todos los demonios usar tcp wrappers.
fr: Si vous souhaitez autoriser tous les démons à utiliser les wrappers tcp.
it: Se si desidera consentire a tutti i demoni di usare i wrapper tcp.

source: If you want to permit to prosody to bind apache port. Need to be activated to use BOSH.
es: Si quiere permitir a prosody enlazarse al puerto de apache. Debe activarse para usar BOSH.
fr: Si vous souhaitez permettre à prosody de se lier au port apache. Doit être activé pour utiliser BOSH.
it: Se si desidera permettere a prosody di assocciarsi alla porta di apache. Deve essere attivo per utilizzare BOSH.

source: If you want to allow confined virtual guests to use executable memory and executable stack
es: Si quiere permitir a los huéspedes virtuales confinados usen memoria y pila ejecutables
fr: Si vous souhaitez autoriser les invités virtuels confinés à utiliser la mémoire exécutable et la pile exécutable
it: Se si desidera consentire ai guest virtuali confinati di usare memoria eseguibile e stack eseguibile

source: If you want to determine whether webadm can read generic user files.
es: Si desea determinar si webadm puede leer ficheros genéricos de usuario.
fr: Si vous souhaitez déterminer si webadm peut lire les fichiers utilisateurs génériques.
it: Se si desidera determinare se webadm può leggere i file dell'utente generico.

source: If you want to allow mozilla plugin to support GPS.
es: Si desea permitir que el complemento de mozilla soporte GPS.
fr: Si vous souhaitez autoriser les greffons mozilla à prendre en charge le GPS.
it: Se si desidera permettere al plugin mozilla il supporto GPS.

source: If you want to support X userspace object manager
es: Si desea tener soporte para el administrador de objetos en el espacio de usuario de X
fr: Si vous souhaitez prendre en charge le gestionnaire d'objets de l'espace utilisateur X
it: Se si desidera il supporto X all'object manager in spazio utente

source: If you want to determine whether attempts by vbetool to mmap low regions should be silently blocked.
es: Si desea determinar si los intentos de vbetool de mapear las regiones bajas serían bloqueados silencionsamente.
fr: Si vous souhaitez déterminer si les tentatives de vbetool d'utiliser mmap sur les régions de mémoire basse doivent être ignorées en silence.
it: Se si desidera determinare se i tentativi di vbetool verso le aree basse di mmap dovrebbero essere bloccate senza chiedere.

source: If you want to allow httpd to read user content
es: Si desea permitir que httpd lea contenidos de usuario
fr: Si vous souhaitez autoriser httpd à lire le contenu utilisateur
it: Se si desidera consentire a httpd di leggere contenuti utente

source: If you want to allow httpd to access nfs file systems
es: Si desea permitir que httpd tenga acceso a sistemas de archivos nfs
fr: Si vous souhaitez autoriser httpd à accéder aux systèmes de fichiers nfs
it: Se si desidera consentire a httpd di accedere ai file system nfs

source: If you want to allow unconfined users to transition to the chrome sandbox domains when running chrome-sandbox
es: Si desea permitir que usuarios no confinados pasen a dominios chrome de entorno de prueba cuando ejecuten chrome-sandbox
fr: Si vous souhaitez autoriser les utilisateurs non-confinés à transitionner aux domaines de bacs à sable chrome lors de l'exécution de chrome-sandbox
it: Se si desidera consentire agli utenti non confinati di transitare nei domini come sandbox quando si esegue chrome-sandbox

source: If you want to allow pppd to load kernel modules for certain modems
es: Si desea permitir que pppd cargue módulos del kernel para determinados modems
fr: Si vous souhaitez autoriser pppd à charger des modules de noyau pour certains modems
it: Se si desidera consentire a pppd di caricare moduli del kernel per alcuni modem

source: If you want to allow sge to access nfs file systems.
es: Si quiere permitir a sge acceder a sistemas de archivos nfs.
fr: Si vous souhaitez autoriser sge à accéder aux systèmes de fichiers nfs.
it: Se si desidera consentire a sge di accedere ai file system nfs.

source: If you want to allow confined virtual guests to read fuse files
es: Si desea permitir que huéspedes virtuales confinados sean capaces de leer archivos fuse
fr: Si vous souhaitez autoriser les invités virtuels confinés à lire les fichiers fuse
it: Se si desidera consentire ai guest virtuali confinati di leggere i file fuse

source: If you want to allow spamd to read/write user home directories.
es: Si desea permitir que spamd lea/modifique las carpetas de usuario.
fr: Si vous souhaitez autoriser spamd à accéder en lecture/écriture aux répertoires utilisateurs.
it: Se si desidera consentire a spamd di leggere/scrivere nelle cartelle home degli utenti.

source: If you want to determine whether DHCP daemon can use LDAP backends.
es: Si desea determinar si el demonio DHCP puede usar los finales LDAP.
fr: Si vous souhaitez déterminer si le démon DHCP peut utiliser des moteurs LDAP.
it: Se si desidera determinare se il demone DHCP può utilizzare le LDAP backends.

source: If you want to determine whether Git CGI can access cifs file systems.
es: Si quiere determinar si CGI de Git puede acceder a sistemas de archivo cifs.
fr: Si vous souhaitez déterminer si le CGI Git peut accéder aux systèmes de fichiers cifs.
it: Se si desidera determinare se Git CGI può accedere ai file system cifs.

source: If you want to allow any files/directories to be exported read/write via NFS.
es: Si desea permitir que cualquier archivo/carpeta sea exportado como de lectura/escritura mediante NFS.
fr: Si vous souhaitez autoriser tous les fichiers ou répertoires à être exportés en lecture/écriture via NFS.
it: Se si desidera consentire a qualsiasi file/cartella di essere esportata in lettura/scrittura tramite NFS.

source: If you want to allow mailman to access FUSE file systems
es: Si desea permitir que mailman acceda al sistema de archivos FUSE
fr: Si vous souhaitez autoriser mailman à accéder aux systèmes de fichiers FUSE
it: Se si desidera permettere a mailman di accedere ai file system FUSE

source: If you want to determine whether icecast can listen on and connect to any TCP port.
es: Si desea determinar si icecast puede escuchar y conectar a cualquier puerto TCP.
fr: Si vous souhaitez déterminer si icecast peut écouter ou se connecteur à tout port TCP.
it: Se si desidera determinare se icecast può ascoltare e connettersi a una qualsiasi porta TCP.

source: If you want to allow Apache to execute tmp content.
es: Si desea permitir que Apache ejecute contenido tmp.
fr: Si vous souhaitez autoriser Apache à exécuter le contenu tmp.
it: Se si desidera consentire ad Apache di eseguire contenuto tmp.

source: If you want to allow zebra daemon to write it configuration files
es: Si desea permitirle al demonio zebra la modificación de archivos de configuración
fr: Si vous souhaitez autoriser le démon zebra à écrire des fichiers de configuration
it: Se si desidera consentire al demone zebra di scrivere i file di configurazione

source: If you want to allow qemu to use cifs/Samba file systems
es: Si desea permitirle a qemu utilizar sistemas de arvhivos cifs/Samba
fr: Si vous souhaitez autoriser qemu à utiliser des systèmes de fichiers cifs/Samba
it: Se si desidera consentire a qemu di usare i filesystem cifs/Samba

source: If you want to allow ksmtuned to use cifs/Samba file systems
es: Si quiere permitir a ksmtuned usar sistemas de archivos cifs/Samba
fr: Si vous souhaitez autoriser ksmtuned à utiliser des systèmes de fichiers cifs/Samba
it: Se si desidera permettere a ksmtuned di utilizzare i file system cifs/Samba

source: If you want to allow xend to run blktapctrl/tapdisk. Not required if using dedicated logical volumes for disk images.
es: Si quiere permitir a xend ejecutar blktapctrl/tapdisk. No se requiere si utiliza volúmenes lógicos para las imágenes de disco.
fr: Si vous souhaitez autoriser xend à exécuter blktapctrl/tapdisk. Ceci n'est pas requis si des volumes logiques dédiés sont utilisés pour les images disque.
it: Se si desidera consentire a xend di eseguire blktapctrl/tapdisk. Non richiesto se si usano volumi logici dedicati per immagini disco.

source: If you want to determine whether fenced can connect to the TCP network.
es: Si desea determinar si fenced puede conectar a la red TCP
fr: Si vous souhaitez déterminer si fenced peut se connecter sur le réseau TCP.
it: Se si desidera determinare se fenced può connettersi alla rete TCP.

source: If you want to allow sanlock to manage nfs files
es: Si quiere permitir a sanlock administrar archivos nfs
fr: Si vous souhaitez autoriser sanlock à gérer les fichiers nfs
it: Se si desidera permettere a sanlock di gestire file nfs

source: If you want to allow all domains to have the kernel load modules
es: Si desea permitir que todos los dominios tengan los módulos de carga del kernel.
fr: Si vous souhaitez autoriser tous les domaines à posséder les modules chargeables du noyau
it: Se si desidera consentire a tutti i domini di avere i moduli caricati nel kernel

source: If you want to allow confined virtual guests to use usb devices
es: Si desea permitir que los huéspedes confinados virtuales puedan utilizar dispositivos usb
fr: Si vous souhaitez autoriser les invités virtuels confinés à utiliser des périphériques usb
it: Se si desidera consentire ai guest virtuali confinati di usare dispositivi usb

source: If you want to determine whether smartmon can support devices on 3ware controllers.
es: Si desea determinar si smartmon puede soportar dispositivos sobre controladoras 3ware.
fr: Si vous souhaitez déterminer si smartmon peut prendre en charge les périphériques sur des contrôleurs 3ware.
it: Se si desidera determinare se smartmon può supportare i dispositivi sui controller 3ware.

source: If you want to allow ABRT to modify public files used for public file transfer services.
es: Si desea permitir que ABRT modifique archivos públicos utilizados por servicios de archivos de datos públicos.
fr: Si vous souhaitez autoriser ABRT à modifier les fichiers publics utilisés pour les services de transfert de fichiers publics.
it: Se si desidera consentire ad ABRT di modificare file pubblici usati per servizi di trasferimento di file pubblici.
