Repository: Justasic/setroubleshoot
Catalog: plugins/po/*.po
Languages: es, fr, it

source: SELinux has denied the $SOURCE access to potentially mislabeled files $TARGET_PATH. This means that SELinux will not allow httpd to use these files. If httpd should be allowed this access to these files you should change the file context to one of the following types, %s. Many third party apps install html files in directories that SELinux policy cannot predict. These directories have to be labeled with a file context which httpd can access.
es: SELinux impidió a $SOURCE acceder a archivos potencialmente mal etiquetados $TARGET_PATH. Ésto significa que SELinux no permitirá a httpd utilizar estos archivos. Si httpd debería tener permitido acceder a estos archivos puede cambiar el contexto de archivo a uno de los siguientes tipos, %s. Muchas aplicaciones de terceros instalan archivos html en carpetas que la política de SELinux no puede predecir. Estas carpetas deben ser etiquetadas con el contexto de archivos que permita su acceso por httpd.
fr: SELinux a refusé au démon $SOURCE d'accéder à des fichiers potentiellement mal étiquetés $TARGET_PATH. Cela signifie que SELinux n'autorisera pas httpd à utiliser ces fichiers. Si httpd doit accéder à ces fichiers, vous devez changer le fichier de contexte pour l'un des types suivants, %s. De nombreuses applications tierces installent des fichiers html dans des répertoires que la stratégie de SELinux ne peut pas prédire. Ces répertoires doivent être étiquetés avec un contexte de fichier permettant à httpd d'y accéder.
it: SELinux ha negato l'accesso a $SOURCE ai file $TARGET_PATH etichettati in modo potenzialmente incorretto. Ciò significa che SELinux non permetterà a httpd di utilizzare questi file. Se httpd ha bisogno dell'accesso a questi file bisogna cambiare il contesto dei file nei seguenti tipi, %s. Numerose applicazioni di terzi installano file html in cartelle che le policy di SELinux non possono prevedere. Le suddette cartelle devono essere etichettate con un contesto file accessibile da parte di httpd.

source: You need to change the label on $FIX_TARGET_PATH
es: Necesita modificar la etiqueta en $FIX_TARGET_PATH
fr: L'étiquette sur $FIX_TARGET_PATH doit être modifiée.
it: E' necessario modificare l'etichetta su $FIX_TARGET_PATH

source: # semanage fcontext -a -t FILE_TYPE '$FIX_TARGET_PATH' where FILE_TYPE is one of the following: %s. Then execute: restorecon -v '$FIX_TARGET_PATH'
es: # semanage fcontext -a -t FILE_TYPE '$FIX_TARGET_PATH' donde FILE_TYPE es uno de los siguientes: %s. Luego ejecute: restorecon -v '$FIX_TARGET_PATH'
fr: # semanage fcontext -a -t FILE_TYPE '$FIX_TARGET_PATH' où FILE_TYPE est l'une des valeurs suivantes : %s. Puis exécutez : restorecon -v '$FIX_TARGET_PATH'
it: # semanage fcontext -a -t TIPO_FILE '$FIX_TARGET_PATH' dove TIPO_FILE è uno dei seguenti: %s. Quindi eseguire: restorecon -v '$FIX_TARGET_PATH'

source: SELinux is preventing $SOURCE_PATH "$ACCESS" access.
es: SELinux está impidiendo a $SOURCE_PATH el acceso "$ACCESS".
fr: SELinux empêche l'accès $SOURCE_PATH « $ACCESS ».
it: SELinux sta impedendo l'accesso $SOURCE_PATH "$ACCESS".

source: SELinux denied access requested by $SOURCE. It is not expected that this access is required by $SOURCE and this access may signal an intrusion attempt. It is also possible that the specific version or configuration of the application is causing it to require additional access.
es: SELinux impidió el acceso solicitado por $SOURCE. No se esperaba que este acceso fuera solicitado por $SOURCE, y podría indicar un intento de ataque. También es posible que la versión específica o la configuración de la aplicación esté provocando esta necesidad de acceso adicional.
fr: SELinux a refusé l'accès demandé par $SOURCE. Il n'est pas prévu que cet accès soit requis par $SOURCE et cet accès peut signaler une tentative d'intrusion. Il est également possible que cette version ou cette configuration spécifique de l'application provoque cette demande d'accès supplémentaire.
it: SELinux ha negato l'accesso richiesto da $SOURCE. Non è previsto che questo accesso venga richiesto da $SOURCE, e tale accesso può segnalare un tentativo di intrusione. È anche possibile che questo sia provocato dalla specifica versione o dalla configurazione dell'applicazione per richiedere un ulteriore accesso.

source: You can generate a local policy module to allow this access - see <a href="http://docs.fedoraproject.org/selinux-faq-fc5/#id2961385">FAQ</a> Please file a bug report.
es: Puede generar un módulo de política local para permitir este acceso. Vea <a href="http://docs.fedoraproject.org/selinux-faq-fc5/#id2961385">FAQ</a> Por favor, informe este error.
fr: Vous pouvez créer un module de stratégie locale pour autoriser cet accès - lisez la <a href="http://docs.fedoraproject.org/selinux-faq-fc5/#id2961385">FAQ</a> Merci de remplir un rapport d'anomalie.
it: E' possibile generare un modulo di politica locale per consentire questo accesso - consultare le <a href="http://docs.fedoraproject.org/selinux-faq-fc5/#id2961385">FAQ</a> Inviare un bug report.

source: you believe that $SOURCE_BASE_PATH should be allowed $ACCESS access on processes labeled $TARGET_TYPE by default.
es: cree que de manera predeterminada, $SOURCE_BASE_PATH debería permitir acceso $ACCESS sobre procesos etiquetados como $TARGET_TYPE.
fr: vous pensez que $SOURCE_BASE_PATH devrait être autorisé à accéder $ACCESS sur les processus étiquetés $TARGET_TYPE par défaut.
it: si crede che $SOURCE_BASE_PATH dovrebbe avere possibilità di accesso $ACCESS ai processi etichettati $TARGET_TYPE in modo predefinito.

source: you believe that $SOURCE_BASE_PATH should have the $ACCESS capability by default.
es: cree que $SOURCE_BASE_PATH debería tener la capacidad de $ACCESS de forma predeterminada.
fr: vous pensez que $SOURCE_BASE_PATH devrait avoir des capacités $ACCESS par défaut.
it: Si pensa che $SOURCE_BASE_PATH dovrebbe avere funzionalità $ACCESS in modo predefinito.

source: you believe that $SOURCE_BASE_PATH should be allowed $ACCESS access on the $TARGET_BASE_PATH $TARGET_CLASS by default.
es: cree que de manera predeterminada, $SOURCE_BASE_PATH debería permitir acceso $ACCESS sobre $TARGET_BASE_PATH $TARGET_CLASS.
fr: vous pensez que $SOURCE_BASE_PATH devrait être autorisé à accéder $ACCESS sur $TARGET_BASE_PATH $TARGET_CLASS par défaut.
it: si crede che $SOURCE_BASE_PATH dovrebbe avere possibilità di accesso $ACCESS sui $TARGET_BASE_PATH $TARGET_CLASS in modo predefinito.

source: You should report this as a bug. You can generate a local policy module to allow this access.
es: Debería reportar esto como un error. Puede generar un módulo de política local para permitir este acceso.
fr: Vous devriez rapporter ceci en tant qu'anomalie. Vous pouvez générer un module de stratégie local pour autoriser cet accès.
it: Si dovrebbe riportare il problema come bug. E' possibile generare un modulo di politica locale per consentire questo accesso.

source: Allow this access for now by executing: # grep $SOURCE /var/log/audit/audit.log | audit2allow -M mypol # semodule -i mypol.pp
es: Permita el acceso momentáneamente executando: # grep $SOURCE /var/log/audit/audit.log | audit2allow -M mypol # semodule -i mypol.pp
fr: Autoriser cet accès pour le moment en exécutant : # grep $SOURCE /var/log/audit/audit.log | audit2allow -M mypol # semodule -i mypol.pp
it: Consentire questo accesso per il momento eseguendo: # grep $SOURCE /var/log/audit/audit.log | audit2allow -M mypol # semodule -i mypol.pp

source: SELinux is preventing $SOURCE_PATH from connecting to port $PORT_NUMBER.
es: SELinux está impidiendo a $SOURCE_PATH conectarse al puerto $PORT_NUMBER.
fr: SELinux empêche le $SOURCE_PATH de se connecter au port réseau $PORT_NUMBER.
it: SELinux impedisce al $SOURCE_PATH di collegarsi alla porta $PORT_NUMBER.

source: SELinux has denied $SOURCE from connecting to a network port $PORT_NUMBER which does not have an SELinux type associated with it. If $SOURCE should be allowed to connect on $PORT_NUMBER, use the <i>semanage</i> command to assign $PORT_NUMBER to a port type that $SOURCE_TYPE can connect to (%s). If $SOURCE is not supposed to connect to $PORT_NUMBER, this could signal a intrusion attempt.
es: SELinux impidió a $SOURCE conectarse al puerto de red $PORT_NUMBER que no tiene un tipo SELinux asociado a él. Si $SOURCE debería poder conectarse al puerto $PORT_NUMBER, use el comando <i>semanage</i> para asignar $PORT_NUMBER a un tipo de puerto al que $SOURCE_TYPE se pueda conectar (%s). Si $SOURCE no debería poder conectarse al puerto $PORT_NUMBER, ésto podría indicar un intento de ataque.
fr: SELinux a refusé que $SOURCE se connecte à un port réseau $PORT_NUMBER qui ne possède pas de type SELinux lui étant associé. Si $SOURCE doit être autorisé à se connecter au port $PORT_NUMBER, veuillez utiliser la commande <i>semanage</i> pour assigner $PORT_NUMBER à un type de port auquel $SOURCE_TYPE peut se connecter(%s). Si $SOURCE n'est pas supposé se connecter au port $PORT_NUMBER, ceci pourrait indiquer une tentative d'intrusion.
it: SELinux ha impedito a $SOURCE di collegarsi alla porta di rete $PORT_NUMBER che non possiede un tipo SELinux associato. Se $SOURCE dovrebbe poter ascoltare sulla porta $PORT_NUMBER, usare il comando <i>semanage</i> per assegnare $PORT_NUMBER ad un tipo di porta alla quale $SOURCE_TYPE si può collegare (%s). Se si suppone che $SOURCE non dovrebbe collegarsi a $PORT_NUMBER, ciò potrebbe segnalare un tentativo d'intrusione.

source: If you want to allow $SOURCE to connect to $PORT_NUMBER, you can execute # semanage port -a -t PORT_TYPE -p %s $PORT_NUMBER where PORT_TYPE is one of the following: %s.
es: Si quiere permitir a $SOURCE conectarse al puerto $PORT_NUMBER, puede ejecutar # semanage port -a -t TIPO_DE_PUERTO -p %s $PORT_NUMBER</b> donde TIPO_DE_PUERTO es uno de los siguientes: %s.
fr: Si vous souhaitez autoriser $SOURCE à se connecter au port $PORT_NUMBER, vous pouvez exécuter # semanage port -a -t PORT_TYPE -p %s $PORT_NUMBER où PORT_TYPE est l'une des valeurs suivantes : %s.
it: Se si vuole consentire a $SOURCE di connettersi a $PORT_NUMBER, è possibile eseguire # semanage port -a -t PORT_TYPE -p %s $PORT_NUMBER dove PORT_TYPE è una delle seguenti: %s.

source: SELinux denied access requested by $SOURCE. It is not expected that this access is required by $SOURCE and this access may signal an intrusion attempt. It is also possible that the specific version or configuration of the application is causing it to require additional access. spice-xpi run applications within mozilla-plugins that require access to the desktop, that the mozilla_plugin lockdown will not allow, so either you need to turn off the mozilla_plugin lockdown or not use these packages.
es: SELinux impidió el acceso solicitado por $SOURCE. no se esperaba que esta acceso fuera requerido por $SOURCE y este acceso puede indicar un intento de ataque. Es posible que la versión o configuración específica de la aplicación lo este causando al requerir acceso adicional . spice-xpi ejecuta aplicaciones dentro de los plugins mozilla que requieren acceso al escritorio, que el bloqueo del plugin mozilla no permitirá, de modo que usted necesita o apagar el bloqueo de complemento de mozilla o no usar estos paquetes.
fr: SELinux a refusé l'accès demandé par $SOURCE. Il n'est pas prévu que cet accès soit requis par $SOURCE et cet accès peut signaler une tentative d'intrusion. Il est également possible que cette version ou cette configuration spécifique de l'application provoque cette demande d'accès supplémentaire. spice-xpi lance des applications dans mozilla-plugins qui requièrent l'accès au bureau, accès que le confinement du mozilla_plugin ne permet pas. Vous devez donc soit ne plus confiner mozilla_plugin, soit ne pas utiliser ces paquets.
it: SELinux ha rifiutato l'accesso richiesto da $SOURCE. Si ritiene che $SOURCE non dovrebbe richiedere questo accesso e che lo stesso potrebbe rappresentare un tentativo di intrusione. Inoltre è possibile che la configurazione o la versione specifica dell'applicazione stiano causando l'accesso aggiuntivo. spice-xpi esegue le applicazioni all'interno del mozilla-plugins che richiede l'accesso al desktop, che il lockdown mozilla_plugin non consente, quindi è necessario disattivare il lockdown mozilla_plugin oppure non usare questi pacchetti.

source: Either remove the mozplugger or spice-xpi package by executing 'yum remove mozplugger spice-xpi' Or turn off enforcement of SELinux over the Chrome plugins. setsebool -P unconfined_chrome_sandbox_transition 0
es: Bien borre el mozplugger o el paquete spice-xpi ejecutando 'yum remove mozplugger spice-xpi. O quite la aplicación de SELinux sobre los plugins Chrome. setsebool -P unconfined_chrome_sandbox_transition 0
fr: Soit vous retirez les paquet mozplugger ou spice-xpi en utilisant « yum remove mozplugger spice-xpi ». Ou arrêtez l'application de SELinux sur les greffons Chrome. setsebool -P unconfined_chrome_sandbox_transition 0
it: Rimuovere il pacchetto mozplluger o spice-xpi eseguendo 'yum remove mozplugger spice-xpi'⏎ Oppure disabilitare l'implementazione di SELinux sui plugin di Chrome. setsebool -P unconfined_chrome_sandbox_transition 0

source: you want to use the %s package
es: quiere usar el paquete %s
fr: vous voulez utiliser le paquet %s
it: si vuole usare il pacchetto %s

source: you must turn off SELinux controls on the Chrome plugins.
es: debe apagar los controles SELinuxsobre los plugins Chrome.
fr: vous devrez désactiver les contrôles SELinux sur les greffons Chrome.
it: disabilitare i controlli SELinux sui plugin di Chrome.

source: SELinux is preventing cvs ($SOURCE_PATH) "$ACCESS" access to $TARGET_PATH
es: SELinux está impidiendo a cvs ($SOURCE_PATH) el acceso "$ACCESS" a $TARGET_PATH.
fr: SELinux empêche cvs ($SOURCE_PATH) d'« $ACCESS » au périphérique $TARGET_PATH.
it: SELinux impedisce l'accesso cvs ($SOURCE_PATH) "$ACCESS" a $TARGET_PATH.

source: SELinux denied cvs access to $TARGET_PATH. If this is a CVS repository it needs to have a file context label of cvs_data_t. If you did not intend to use $TARGET_PATH as a CVS repository it could indicate either a bug or it could signal an intrusion attempt.
es: SELinux impidió a cvs el acceso a $TARGET_PATH. Si éste es un repositorio CVS, debería tener la etiqueta de contexto de archivo cvs_data_t. Si su intención no es usar $TARGET_PATH como un repositorio cvs, ésto podría indicar un error o un intento de ataque.
fr: SELinux a refusé l'accès cvs à $TARGET_PATH. S'il s'agit d'un dépôt CVS, il doit porter l'étiquetage cvs_data_t contextuel au fichier. Si vous n'avez pas l'intention d'utiliser $TARGET_PATH comme dépôt cvs cela pourrait indiquer une anomalie ou signaler une tentative d'intrusion.
it: SELinux ha negato a cvs l'accesso a $TARGET_PATH. Se si tratta di un repository CVS, sarà necessario avere una etichetta del contesto del file cvs_data_t. Se non si desiderava utilizzare $TARGET_PATH come repository CVS, ciò potrebbe indicare un bug oppure potrebbe segnalare un tentativo di intrusione.

source: You can alter the file context by executing chcon -R -t cvs_data_t '$TARGET_PATH' You must also change the default file context files on the system in order to preserve them even on a full relabel. "semanage fcontext -a -t cvs_data_t '$FIX_TARGET_PATH'"
es: Puede alterar el contexto de archivo ejecutando chcon -R -t cvs_data_t '$TARGET_PATH' También debe cambiar el archivo predeterminado de contexto de archivos en el sistema, para preservarlos incluso después de un reetiquetado completo. "semanage fcontext -a -t cvs_data_t '$FIX_TARGET_PATH'"
fr: Vous pouvez modifier le contexte du fichier en exécutant chcon -R -t cvs_data_t '$TARGET_PATH' Vous devez aussi changer le dossier par défaut des fichiers de contexte de votre système, même lors d'un réétiquetage complet, de manière à les préserver. « semanage fcontext -a -t cvs_data_t '$FIX_TARGET_PATH' »
it: È possibile alterare il contesto del file eseguendo chcon -R -t cvs_data_t '$TARGET_PATH' Inoltre bisogna cambiare il contesto file predefinito dei file sul sistema per preservarli anche in caso di una completa rietichettatura. "semanage fcontext -a -t cvs_data_t '$FIX_TARGET_PATH'"

source: $TARGET_BASE_PATH should be shared via the cvs daemon
es: $TARGET_BASE_PATH debería compartirse mediante el demonio cvs
fr: $TARGET_BASE_PATH devrait être partagé via le démon cvs
it: $TARGET_BASE_PATH dovrebbe essere condiviso tramite il demone cvs

source: You need to change the label on $TARGET_BASE_PATH'
es: Necesita modificar la etiqueta en $TARGET_BASE_PATH'
fr: Vous devez modifier l'étiquette sur $TARGET_BASE_PATH'
it: E' necessario modificare l'etichetta su $TARGET_BASE_PATH'

source: SELinux is preventing $SOURCE_PATH the "$ACCESS" capability.
es: SELinux está previniendo a $SOURCE_PATH la capacidad de "$ACCESS" .
fr: SELinux empêche à $SOURCE_PATH d'avoir la capacité « $ACCESS ».
it: SELinux sta impedendo a $SOURCE_PATH la funzionalità "$ACCESS".

source: dac_override and dac_read_search capabilities usually indicates that the root process does not have access to a file based on the permission flags. This usually mean you have some file with the wrong ownership/permissions on it.
es: las capacidadeds dac_override y dac_read_search por lo general indican que los procesos root no tienen aceso a un archivo basado en las marcas de permisos. Generalmente esto significa que posee algún archivo cuyo permiso o pertenencia es equivocado.
fr: dac_override et dac_read_search indiquent habituellement que le processus root n'a pas accès à un fichier basé sur les indicateurs de permission. Normalement, cela signifie que vous possédez un fichier avec de mauvaises propriétés/permissions.
it: le funzionalità dac_override e dac_read_search normalmente indicano che il processo root non possiede l'accesso ad un file basato sui flag di permessi. Normalmente ciò significa che ci sono alcuni file con il proprietario/permessi sbagliati.

source: you want to help identify if domain needs this access or you have a file with the wrong permissions on your system
es: quiere ayudar a comprobar si el dominio necesita este acceso o si tiene un archivo con permisos erróneos en el sistema
fr: vous souhaitez identifier si le domaine nécessite cet accès ou si vous possédez un fichier avec les mauvaises permissions sur votre système
it: si vuole aiutare ad identificare se al dominio serva questo accesso o se si possiede un file con i permessi sbagliati sul sistema

source: turn on full auditing to get path information about the offending file and generate the error again.
es: activa auditoría completa para obtener información de la ruta relacionada con el archivo conflictivo, y generar el error nuevamente.
fr: activez le contrôle complet pour obtenir les informations de chemin du fichier fautif et générer l'erreur à nouveau.
it: attivare l'auditing completo per ottenere le informazioni del percorso del file incriminato e generare nuovamente l'errore.

source: Turn on full auditing # auditctl -w /etc/shadow -p w Try to recreate AVC. Then execute # ausearch -m avc -ts recent If you see PATH record check ownership/permissions on file, and fix it, otherwise report as a bugzilla.
es: Active auditoría completa # auditctl -w /etc/shadow -p w Intente recrear el AVC. Luego ejecute # ausearch -m avc -ts recent Si observa un registro PATH verifique permisos y pertenencia del archivo, y solucionelo, de lo contrario, repórtelo en bugzilla.
fr: Activer le contrôle complet # auditctl -w /etc/shadow -p w Tentez de recréer AVC. Puis exécutez # ausearch -m avc -ts recent Si vous voyez un enregistrement PATH, vérifiez les propriétés/permissions du fichier, et corrigez-les, sinon veuillez effectuer un rapport bugzilla.
it: Abilitare l'auditing completo # auditctl -w /etc/shadow -p w Provare a rigenerare AVC. Quindi eseguire # ausearch -m avc -ts recent Se si vede il campo PATH controllare il proprietario/permessi del file, quindi aggiustarlo, altrimenti inviare il bug a bugzilla.

source: SELinux is preventing $SOURCE_PATH "$ACCESS" access to device $TARGET_PATH.
es: SELinux está negando a $SOURCE_PATH el acceso "$ACCESS" al dispositivo $TARGET_PATH.
fr: SELinux empêche $SOURCE_PATH d'« $ACCESS » au périphérique $TARGET_PATH.
it: SELinux impedisce l'accesso $SOURCE_PATH "$ACCESS" al dispositivo $TARGET_PATH.
