Repository: Justasic/setroubleshoot
Catalog: plugins/po/*.po
Languages: es, fr, it

source: SELinux prevented the ftp daemon from $ACCESS files stored on a CIFS filesystem. CIFS (Comment Internet File System) is a network filesystem similar to SMB (<a href="http://www.microsoft.com/mind/1196/cifs.asp">http://www.microsoft.com/mind/1196/cifs.asp</a>) The ftp daemon attempted to read one or more files or directories from a mounted filesystem of this type. As CIFS filesystems do not support fine-grained SELinux labeling, all files and directories in the filesystem will have the same security context. If you have not configured the ftp daemon to read files from a CIFS filesystem this access attempt could signal an intrusion attempt.
es: SELinux impidió al demonio ftp el acceso $ACCESS sobre los archivos almacenados en un sistema de archivos CIFS. CIFS (Sistema de Archivos de Comentarios de Internet) es un sistema de archivos de red similar a SMB (<a href="http://www.microsoft.com/mind/1196/cifs.asp">http://www.microsoft.com/mind/1196/cifs.asp</a>) El demonio ftp intentó leer uno o más archivos o carpetas de un sistema de archivos montado de este tipo. Como los sistemas de archivos CIFS no ofrecen soporte adecuado para el etiquetado SELinux, todos los archivos y carpetas en el sistema de archivos tendrán el mismo contexto de seguridad. Si no configuró al demonio ftp para leer archivos de un sistema de archivos CIFS, este acceso podría indicar un intento de ataque.
fr: SELinux a empêché le démon ftp d'$ACCESS aux fichiers stockés sur un système de fichiers CIFS. CIFS (Comment Internet File System) est un système de fichiers réseau similaire à SMB (<a href="http://www.microsoft.com/mind/1196/cifs.asp">http://www.microsoft.com/mind/1196/cifs.asp</a>) Le démon ftp a empêché la lecture d'un ou plusieurs fichiers ou répertoires provenant d'un tel système de fichiers monté. Étant donné que les systèmes de fichiers CIFS ne supportent pas l'étiquetage fin SELinux, tous les fichiers et répertoires dans le système de fichiers auront le même contexte de sécurité. Si vous n'avez pas configuré le démon ftp afin de lire les fichiers provenant d'un système de fichiers CIFS cette demande d'accès pourrait signaler une tentative d'intrusion.
it: SELinux ha evitato al demone ftp l'$ACCESS ai file immagazzinati su un filesystem CIFS. CIFS (Comment Internet File System) è un filesystem di rete simile a SMB (<a href="http://www.microsoft.com/mind/1196/cifs.asp">http://www.microsoft.com/mind/1196/cifs.asp</a>) Il demone ftp ha tentato di leggere uno o più file o directory da un filesystem montato di questo tipo. Poiché il sistema CIFS non supporta l'etichettatura fine-grained di SELinux, tutti i file e le cartelle nel filesystem avranno lo stesso contesto di sicurezza. Se non si è configurato il demone per leggere i file da un filesystem CIFS questo tentativo di accesso può segnalare un tentativo d'intrusione.

source: Changing the "$BOOLEAN" boolean to true will allow this access: "setsebool -P $BOOLEAN=1."
es: Cambiando el valor booleano "$BOOLEAN" a verdadero permitirá este acceso: "setsebool -P $BOOLEAN=1."
fr: Changer le booléen « $BOOLEAN » sur vrai autorisera cet accès : « setsebool -P $BOOLEAN=1. »
it: Cambiando il booleano "$BOOLEAN" a true verrà permesso tale accesso: "setsebool -P $BOOLEAN=1."

source: Changing the "$BOOLEAN" and "$WRITE_BOOLEAN" booleans to true will allow this access: "setsebool -P $BOOLEAN=1 $WRITE_BOOLEAN=1". warning: setting the "$WRITE_BOOLEAN" boolean to true will allow the ftp daemon to write to all public content (files and directories with type public_content_t) in addition to writing to files and directories on CIFS filesystems.
es: Cambiando los booleanos "$BOOLEAN" and "$WRITE_BOOLEAN" a 1 permitirá este acceso: "setsebool -P $BOOLEAN=1 $WRITE_BOOLEAN=1". Advertencia: poner el valor de "$WRITE_BOOLEAN" a 1 permitirá al demonio ftp escribir a todo el contenido público (archivos y carpetas con el tipo public_content_t) además de escribir a archivos y carpetas en sistemas de archivos CIFS.
fr: Le changement des booléens « $BOOLEAN » et « $WRITE_BOOLEAN » sur vrai autorisera cet accès : « setsebool -P $BOOLEAN=1 $WRITE_BOOLEAN=1 ». avertissement : mettre le booléen « $WRITE_BOOLEAN » sur vrai autorisera le démon ftp à écrire dans tous les contenus publics (fichiers et répertoires avec le type public_content_t) en plus d'écrire dans les fichiers et répertoires du système de fichiers CIFS.
it: Cambiando le booleane "$BOOLEAN" e "$WRITE_BOOLEAN" in true si permetterà tale accesso: "setsebool -P $BOOLEAN=1 $WRITE_BOOLEAN=1". attenzione: impostare la booleana "$WRITE_BOOLEAN" su true permetterà al demone ftp di scrivere tutto il contenuto pubblico (file e cartelle con tipo public_content_t) oltre a scrivere file e cartelle sui filesystems CIFS.

source: you want to allow ftpd to write to cifs file systems
es: quiere permitir a ftpd escribir sobre sistemas de archivos cifs
fr: vous souhaitez autoriser ftpd à écrire sur les systèmes de fichiers CIFS
it: si vuole consentire a ftpd di scrivere sui file system cifs

source: you must tell SELinux about this
es: debe informar de esto a SELinux
fr: vous devez le faire savoir à SELinux
it: è necessario informare SELinux sulla questione

source: SELinux prevented the ftp daemon from $ACCESS files stored on a NFS filesystem.
es: SELinux negó al demonio ftp $ACCESS a archivos almacenados en un sistema de archivos NFS.
fr: SELinux a empêché le démon ftp de $ACCESS aux fichiers stockés sur un système de fichiers NFS.
it: SELinux ha impedito al demone ftp daemon d $ACCESS ai file immagazzinati su di un filesystem NFS.

source: SELinux prevented the ftp daemon from $ACCESS files stored on a NFS filesystem. NFS (Network Filesystem) is a network filesystem commonly used on Unix / Linux systems. The ftp daemon attempted to read one or more files or directories from a mounted filesystem of this type. As NFS filesystems do not support fine-grained SELinux labeling, all files and directories in the filesystem will have the same security context. If you have not configured the ftp daemon to read files from a NFS filesystem this access attempt could signal an intrusion attempt.
es: SELinux impidió al demonio ftp el acceso $ACCESS sobre archivos almacenados en un sistema de archivos NFS. NFS (Sistema de Archivo de Red) es un sistema de archivos de red comúnmente usado en sistemas Unix/Linux El demonio ftp intentó leer uno o mas archivos o carpetas desde un sistema de archivo montado de este tipo. Como los sistemas de archivos NFS no dan soporte a un etiquetado de archivo más fino, todos los archivos y carpetas en el sistema de archivos tendrán el mismo contexto de seguridad. Si no ha configurado al demonio ftp para leer archivos en un sistema de archivos NFS, este acceso podría indicar un intento de ataque.
fr: SELinux a empêché le démon ftp d'$ACCESS aux fichiers stockés sur un système de fichiers NFS. NFS (Network Filesystem) est un système de fichiers réseau habituellement utilisé par des systèmes Unix / Linux. Le démon ftp a empêché la lecture d'un ou plusieurs fichiers ou répertoires provenant d'un tel système de fichiers monté. Étant donné que les systèmes de fichiers NFS ne supportent pas l'étiquetage fin SELinux, tous les fichiers et répertoires dans le système de fichiers auront le même contexte de sécurité. Si vous n'avez pas configuré le démon ftp afin de lire les fichiers provenant d'un système de fichiers NFS cette demande d'accès pourrait signaler une tentative d'intrusion.
it: SELinux ha evitato al demone ftp di $ACCESS a file registrati su un filesystem NFS. L'NFS (Network Filesystem) è un filesystem di rete comunemente utilizzato sui sistemi Unix / Linux. Il demone ftp ha tentato di leggere uno o più file o cartelle da un filesystem montato di questo tipo. Poiché il filesystems NFS non supporta l'etichettatura fine-grained di SELinux, tutti i file e le cartelle nel filesystem avranno lo stesso contesto di sicurezza. Se non si è configurato il demone ftp per leggere files da un filesystem NFS questo accesso potrebbe segnalare un tentativo di intrusione.

source: Changing the "allow_ftpd_use_nfs" boolean to true will allow this access: "setsebool -P allow_ftpd_use_nfs=1."
es: Cambiando el booleano "allow_ftpd_use_nfs" a verdadero permitirá este acceso: "setsebool -P allow_ftpd_use_nfs=1."
fr: Changer le booléen « allow_ftpd_use_nfs » sur vrai permettra cet accès : « setsebool -P allow_ftpd_use_nfs=1. »
it: Cambiando il booleano "allow_ftpd_use_nfs" in true verrà permesso questo accesso: "setsebool -P allow_ftpd_use_nfs=1."

source: Changing the "allow_ftpd_use_nfs" and "$WRITE_BOOLEAN" booleans to true will allow this access: "setsebool -P allow_ftpd_use_nfs=1 $WRITE_BOOLEAN=1". warning: setting the "$WRITE_BOOLEAN" boolean to true will allow the ftp daemon to write to all public content (files and directories with type public_content_t) in addition to writing to files and directories on NFS filesystems.
es: Cambiando los booleanos "allow_ftpd_use_nfs" and "$WRITE_BOOLEAN" a 1 se permitirá este acceso: "setsebool -P allow_ftpd_use_nfs=1 $WRITE_BOOLEAN=1". Advertencia: poner el booleano $WRITE_BOOLEAN a 1 permitirá al demonio ftp escribir a todo el contenido público (archivos y carpetas con el tipo public_content_t) además de escribir archivos y carpetas en sistemas de archivos NFS.
fr: Le changement des booléens « allow_ftpd_use_nfs » et « $WRITE_BOOLEAN » sur vrai autorisera cet accès : « setsebool -P allow_ftpd_use_nfs=1 $WRITE_BOOLEAN=1 ». avertissement : mettre le booléen « $WRITE_BOOLEAN » sur vrai autorisera le démon ftp à écrire dans tous les contenus publics (fichiers et répertoires avec le type public_content_t) en plus d'écrire dans les fichiers et répertoires du système de fichiers NFS.
it: Cambiando il booleano "allow_ftpd_use_nfs" e "$WRITE_BOOLEAN" in true si permetterà questo accesso: "setsebool -P allow_ftpd_use_nfs=1 $WRITE_BOOLEAN=1". attenzione: impostando il booleano "$WRITE_BOOLEAN" su true si permetterà al demone ftp di scrivere tutti i contenuti pubblici (file e cartelle con il tipo public_content_t) oltre a scrivere file e cartelle sui filesystems NFS.

source: you want to allow ftpd to write to nfs file systems
es: quiere permitir a ftpd escribir sobre sistemas de archivos nfs
fr: vous souhaitez autoriser ftpd à écrire sur les systèmes de fichiers NFS
it: si vuole consentire a ftpd di scrivere sui file system nfs

source: SELinux is preventing $SOURCE_PATH "$ACCESS" access to $TARGET_PATH.
es: SELinux está impidiendo a $SOURCE_PATH el acceso "$ACCESS" a $TARGET_PATH.
fr: SELinux empêche $SOURCE_PATH d'« $ACCESS » au périphérique $TARGET_PATH.
it: SELinux impedisce a $SOURCE_PATH l'accesso "$ACCESS" su $TARGET_PATH.

source: You tried to place a type on a %s that is not a file type. This is not allowed, you must assigne a file type. You can list all file types using the seinfo command. seinfo -afile_type -x
es: Intento poner un tipo en un %s que no es un tipo de archivo. Esto no se permite, le debe asignar un tipo de archivo. Puede listar todos los tipos de archivo usando el comando seinfo. seinfo -afile_type -x
fr: Vous avez tenté de mettre un type sur un %s qui n'est pas un type de fichier. Ceci est interdit, vous devez assigner un type de fichier. Vous pouvez obtenir la liste des types de fichiers en utilisant la commande seinfo. seinfo -afile_type -x
it: Si sta provando ad usare un tipo su %s che non è un tipo file. Questa operazione non è permessa, assegnare un tipo di file valido. Elencare tutti i tipi di file usando il comando seinfo. seinfo -afile_type -x

source: you want to change the label of $TARGET_PATH to %s, you are not allowed to since it is not a valid file type.
es: a los que quiera cambiar la etiqueta de $TARGET_PATH a %s, lo que no está permitido porque no es un tipo de archivo válido.
fr: vous souhaitez modifier l'étiquette de $TARGET_PATH en %s, ce qui est interdit car pas un type de fichier valide.
it: si desidera modificare l'etichetta di $TARGET_PATH in %s; non è possibile eseguire questa operazione perché non è un tipo di file valido.

source: you must pick a valid file label.
es: debe elegir una etiqueta de archivo válida.
fr: vous devez choisir une étiquette de fichier valide.
it: selezionare una etichetta del file valida.

source: SELinux is preventing the $SOURCE_PATH from executing potentially mislabeled files $TARGET_PATH.
es: SELinux está impidiendo a $SOURCE ejecutar archivos potencialmente mal etiquetados $TARGET_PATH.
fr: SELinux empêche $SOURCE_PATH d'utiliser des fichiers potentiellement mal étiquetés ($TARGET_PATH).
it: SELinux impedisce a $SOURCE_PATH l'utilizzo di file ($TARGET_PATH) potenzialmente etichettati in modo incorretto.

source: SELinux has denied the $SOURCE_PATH from executing potentially mislabeled files $TARGET_PATH. Automounter can be setup to execute configuration files. If $TARGET_PATH is an automount executable configuration file it needs to have a file label of bin_t. If automounter is trying to execute something that it is not supposed to, this could indicate an intrusion attempt.
es: SELinux impidió a $SOURCE_PATH ejecutar archivos potencialmente mal etiquetados $TARGET_PATH. El automontador se puede configurar para ejecutar archivos de configuración, si $TARGET_PATH es un archivo de configuración ejecutable de automount, necesitará tener la etiqueta bin_t. Si el automontador está intentando ejecutar algo que no debería, ésto podría indicar un intento de ataque.
fr: SELinux a empêché $SOURCE_PATH d'exécuter les fichiers potentiellement mal étiquetés $TARGET_PATH. Automounter peut être configuré pour exécuter des fichiers de configuration. Si $TARGET_PATH est un fichier exécutable de configuration pour le montage automatique, il a besoin d'être étiqueté avec bin_t. Si automounter essaie d'exécuter quelque chose qu'il n'est pas censé exécuter, cela peut indiquer une intrusion par attaque.
it: SELinux ha impedito a $SOURCE_PATH di eseguire i file $TARGET_PATH potenzialmente etichettati in modo non corretto. Automounter può essere impostato per eseguire i file di configurazione. Se $TARGET_PATH risulta essere un file di configurazione eseguibile di automount, esso avrà bisogno di una etichetta bin_t. Se automounter cerca di eseguire un'azione non prevista, tale tentativo potrebbe indicare un tentativo d'intrusione.

source: If you want to change the file context of $TARGET_PATH so that the automounter can execute it you can execute "chcon -t bin_t $TARGET_PATH". If you want this to survive a relabel, you need to permanently change the file context: execute "semanage fcontext -a -t bin_t '$FIX_TARGET_PATH'".
es: Si quiere modificar el contexto de archivo de $TARGET_PATH para que el automontador pueda ejecutarlo, puede ejecutar "chcon -t bin_t $TARGET_PATH". Si quiere que esto continúe luego de re etiquetado, necesitará modificar permanentemente el contexto de archivo: ejecute "semanage fcontext -a -t bin_t '$FIX_TARGET_PATH'".
fr: Si vous souhaitez modifier le contexte du fichier de $TARGET_PATH de manière à ce qu'automounter puisse l'exécuter, vous pouvez exécuter « chcon -t bin_t $TARGET_PATH ». Si vous souhaitez qu'il survive à un ré-étiquetage, vous devez modifier le contexte du fichier de manière permanente : veuillez exécuter « semanage fcontext -a -t bin_t '$FIX_TARGET_PATH' ».
it: Se si vuole modificare il file di contesto di $TARGET_PATH in modo che l'automounter possa eseguirlo è possibile eseguire "chcon -t bin_t $TARGET_PATH". Se si desidera che il comando sopravviva ad una rietichettatura, è necessario modificare permanentemente il file di contesto: eseguire "semanage fcontext -a -t bin_t '$FIX_TARGET_PATH'".

source: SELinux is preventing $SOURCE_PATH from binding to port $PORT_NUMBER.
es: SELinux está impidiendo a $SOURCE_PATH enlazarse al puerto $PORT_NUMBER.
fr: SELinux empêche $SOURCE_PATH de se connecter au port PORT_NUMBER.
it: SELinux impedisce al $SOURCE_PATH di associarsi alla porta $PORT_NUMBER.

source: SELinux has denied the $SOURCE from binding to a network port $PORT_NUMBER which does not have an SELinux type associated with it. If $SOURCE should be allowed to listen on $PORT_NUMBER, use the <i>semanage</i> command to assign $PORT_NUMBER to a port type that $SOURCE_TYPE can bind to (%s). If $SOURCE is not supposed to bind to $PORT_NUMBER, this could signal an intrusion attempt.
es: SELinux impidió a $SOURCE enlazarse al puerto de red $PORT_NUMBER que no tiene un tipo SELinux asociado a él. Si a $SOURCE debería permitírsele escuchar en $PORT_NUMBER, utilice el comando <i>semanage</i> para asignar $PORT_NUMBER a un tipo de puerto al que $SOURCE_TYPE pueda enlazarse con (%s). Si $SOURCE no debería poder enlazarse al puerto $PORT_NUMBER, ésto podría indicar un intento de ataque.
fr: SELinux a refusé à $SOURCE de se lier à un port réseau $PORT_NUMBER qui ne possède pas de type SELinux lui étant associé. Si $SOURCE doit être autorisé à écouter le port $PORT_NUMBER, veuillez utiliser la commande <i>semanage</i> pour assigner le port $PORT_NUMBER à un type de port auquel $SOURCE_TYPE peut se lier (%s). Si $SOURCE n'est pas supposé se lier au port $PORT_NUMBER, cela pourrait indiquer une tentative d'intrusion.
it: SELinux ha impedito a $SOURCE di collegarsi alla porta di rete $PORT_NUMBER che non possiede un tipo SELinux associato. Se $SOURCE dovrebbe poter ascoltare sulla porta $PORT_NUMBER, usare il comando <i>semanage</i> per assegnare $PORT_NUMBER ad un tipo di porta alla quale $SOURCE_TYPE si può collegare (%s). Se non si pensa che $SOURCE debba legarsi alla porta $PORT_NUMBER, ciò potrebbe segnalare un tentativo di intrusione.

source: If you want to allow $SOURCE to bind to port $PORT_NUMBER, you can execute # semanage port -a -t PORT_TYPE -p %s $PORT_NUMBER where PORT_TYPE is one of the following: %s. If this system is running as an NIS Client, turning on the allow_ypbind boolean may fix the problem. setsebool -P allow_ypbind=1.
es: Si quiere permitir que $SOURCE se asocie con el puerto $PORT_NUMBER, puede ejecutar # semanage port -a -t TIPO_DE_PUERTO -p %s $PORT_NUMBER donde TIPO_DE_PUERTO es uno de los siguientes: %s. Si este sistema se está ejecutando como un cliente NIS, activar el booleano allow_ypbind puede corregir este problema. setsebool -P allow_ypbind=1.
fr: Si vous souhaitez autoriser à $SOURCE de se lier au port $PORT_NUMBER, vous pouvez exécuter # semanage port -a -t PORT_TYPE -p %s $PORT_NUMBER où PORT_TYPE est l'une des valeurs suivantes : %s. Si ce système est exécuté en tant que client NIS, activer le booléen allow_ypbind pourrait corriger le problème. setsebool -P allow_ypbind=1.
it: Se si desidera consentire a $SOURCE di collegarsi alla porta $PORT_NUMBER, è possibile eseguire # semanage port -a -t PORT_TYPE -p %s $PORT_NUMBER dove PORT_TYPE è una delle seguenti: %s. Se il sistema è avviato come client NIS, abilitare il valore booleano allow_ypbind potrebbe risolvere il problema. setsebool -P allow_ypbind=1.

source: # semanage port -a -t PORT_TYPE -p %s $PORT_NUMBER where PORT_TYPE is one of the following: %s.
es: # semanage port -a -t TIPO_DE_PUERTO -p %s $PORT_NUMBER</b> donde TIPO_DE_PUERTO es uno de los siguientes: %s.
fr: # semanage port -a -t PORT_TYPE -p %s $PORT_NUMBER où PORT_TYPE est l'une des valeurs suivantes : %s.
it: # semanage port -a -t PORT_TYPE -p %s $PORT_NUMBER dove PORT_TYPE è una delle seguenti: %s.

source: SELinux is preventing $SOURCE_PATH "$ACCESS" access on $TARGET_PATH.
es: SELinux está impidiendo a $SOURCE_PATH el acceso "$ACCESS" sobre $TARGET_PATH.
fr: SELinux empêche $SOURCE_PATH d'« $ACCESS » au périphérique $TARGET_PATH.
it: SELinux impedisce al $SOURCE_PATH "$ACCESS" di accedere al dispositivo $TARGET_PATH.

source: SELinux denied access requested by $SOURCE. The current boolean settings do not allow this access. If you have not setup $SOURCE to require this access this may signal an intrusion attempt. If you do intend this access you need to change the booleans on this system to allow the access.
es: SELinux impidió el acceso solicitado por $SOURCE. El booleano actual no está permitiendo este acceso. Si no configuró a $SOURCE para que este acceso fuera necesario, puede ser indicio de un intento de ataque. Si realmente desea permitir este acceso, tendrá que modificar los booleanos del sistema para permitirlo.
fr: SELinux a refusé l'accès demandé par $SOURCE. La valeur actuelle du booléen n'autorise pas cet accès. Si vous n'avez pas configuré $SOURCE pour demander cet accès, il se peut qu'il s'agisse d'une tentative d'intrusion. Si vous aviez prévu cet accès, vous devez changer le booléen sur ce système de manière à\ l'autoriser.
it: SELinux ha negato l'accesso richiesto da $SOURCE. Le attuali impostazioni del booleano non consentono questo accesso. Se non è stato impostato $SOURCE per richiedere questo accesso ciò potrebbe segnalare un tentativo di intrusione. Se si intende permettere l'accesso è necessario cambiare i booleani del sistema per consentire l'accesso.

source: Confined processes can be configured to run requiring different access, SELinux provides booleans to allow you to turn on/off access as needed.
es: Los procesos confinados se pueden configurar para ejecutarse con diferentes requerimientos de acceso, SELinux ofrece una serie de booleanos para permitir activar/desactivar estos accesos según sea necesario.
fr: Des processus confinés peuvent être configurés pour fonctionner en requérant différents accès, SELinux met à disposition des booléens qui vous permettent d'activer/désactiver les accès requis.
it: I processi confinati possono essere configurati per essere eseguiti richiedendo accessi differenti, SELinux fornisce booleane per permettere di attivare o disattivare l'accesso secondo le necessità.

source: you want to %s
es: quiere %s
fr: vous souhaitez %s
it: si desidera %s

source: You must tell SELinux about this by enabling the '%s' boolean.
es: Debe informar a SELinux de ésto activando el booleano '%s'.
fr: Vous devez en informer SELinux en activant le booléen « %s ».
it: È necessario informare SELinux abilitando il booleano '%s' .

source: You can read '%s' man page for more details.
es: Puede leer la página de manual '%s' para más detalles.
fr: Vous pouvez lire la page de manuel « %s » pour plus de détails.
it: Per maggiori informazioni consultare le pagina man di '%s'.
