Repository: Justasic/setroubleshoot
Catalog: plugins/po/*.po
Languages: es, fr, it

source: SELinux policy is preventing an httpd script from writing to a public directory.
es: La política de SELinux está impidiendo a un guión de httpd escribir en una carpeta pública.
fr: La règle SELinux empêche un script httpd d'écrire sur un répertoire public.
it: La policy di SELinux sta evitando che uno script httpd scriva in una cartella pubblica.

source: SELinux policy is preventing an httpd script from writing to a public directory. If httpd is not setup to write to public directories, this could signal an intrusion attempt.
es: La política de SELinux está impidiendo a un guión httpd escribir en una carpeta pública. Si no se configuró httpd para escribir en carpetas públicas, esto podría indicar un posible ataque.
fr: La règle SELinux empêche un script httpd d'écrire dans un répertoire public. Si httpd n'est pas configuré pour écrire dans des répertoires publics, cela pourrait signaler une tentative d'intrusion.
it: La policy di SELinux sta evitando che uno script httpd scriva in una cartella pubblica. Se httpd non è impostato per scrivere nelle cartelle pubbliche, ciò potrebbe segnalare un tentativo di intrusione.

source: If httpd scripts should be allowed to write to public directories you need to turn on the $BOOLEAN boolean and change the file context of the public directory to public_content_rw_t. Read the httpd_selinux man page for further information: "setsebool -P $BOOLEAN=1; chcon -t public_content_rw_t <path>" You must also change the default file context labeling files on the system in order to preserve public directory labeling even on a full relabel. "semanage fcontext -a -t public_content_rw_t <path>"
es: Si los guiones httpd deberían tener acceso de escritura sobre las carpetas públicas, es necesario activar el booleano $BOOLEAN y cambiar el contexto de archivos de la carpeta pública a public_content_rw_t. Consulte la página de manual httpd_selinux para obtener más información: "setsebool -P $BOOLEAN=1; chcon -t public_content_rw_t <path>" También debe cambiar las etiquetas de contexto de archivo predeterminadas en el sistema con el fin de preservar el etiquetamiento de la carpeta pública incluso en un reetiquetamiento completo. "semanage fcontext -a -t public_content_rw_t <path>"
fr: Si les scripts httpd sont autorisés à écrire sur des répertoires publics, vous devez activer le booléen $BOOLEAN et modifier le contexte du fichier du répertoire public sur public_content_rw_t. Veuillez lire la page man httpd_selinux afin d'obtenir des informations supplémentaires : « setsebool -P $BOOLEAN=1; chcon -t public_content_rw_t <path> » Vous devez aussi modifier les fichiers par défaut sur le système qui étiquettent le contexte des fichiers afin de préserver l'étiquetage des répertoires publics, même lors d'un nouvel étiquetage complet. « semanage fcontext -a -t public_content_rw_t <path> »
it: Se gli script httpd devono avere il permesso di scrivere nelle cartelle pubbliche è necessario abilitare il booleano $BOOLEAN e modificare il contesto file della cartella publica in public_content_rw_t. Leggere le magine di man httpd_selinux per maggiori informazioni: "setsebool -P $BOOLEAN=1; chcon -t public_content_rw_t <percorso>" Inoltre è necessario modificare l'etichettatura di contesto file predefinita dei file sul sistema per evitare l'etichettatura delle cartelle pubbliche in caso di completa rietichettatura. "semanage fcontext -a -t public_content_rw_t <percorso>"

source: you want to allow $SOURCE_PATH to be able to write to shared public content
es: quiere permitir que $SOURCE_PATH pueda escribir sobre los contenidos públicos compartidos
fr: vous souhaitez autoriser $SOURCE_PATH à écrire sur un contenu public partagé
it: si vuole consentire a $SOURCE_PATH di scrivere nel contenuto pubblico condiviso

source: you need to change the label on $TARGET_PATH to public_content_rw_t, and potentially turn on the allow_httpd_sys_script_anon_write boolean.
es: necesita modificar la etiqueta de $TARGET_PATH a public_content_rw_t, y tal vez necesite activar el booleano allow_httpd_sys_script_anon_write.
fr: vous devez modifier l'étiquette de $TARGET_PATH en public_content_rw_t, et aussi probablement activer le booléen allow_httpd_sys_script_anon_write.
it: è necessario modificare l'etichetta su $TARGET_PATH in public_content_rw_t, e potenzialmente attivare il booleano allow_httpd_sys_script_anon_write .

source: SELinux is preventing $SOURCE_PATH from changing the access protection of memory on the heap.
es: SELinux está impidiendo a $SOURCE_PATH cambiar la protección de acceso de la memoria heap.
fr: SELinux empêche $SOURCE_PATH de changer l'accès de protection de mémoire sur la pile.
it: SELinux impedisce al $SOURCE_PATH di cambiare la protezione d'accesso della memoria sull'heap.

source: The $SOURCE application attempted to change the access protection of memory on the heap (e.g., allocated using malloc). This is a potential security problem. Applications should not be doing this. Applications are sometimes coded incorrectly and request this permission. The <a href="http://people.redhat.com/drepper/selinux-mem.html">SELinux Memory Protection Tests</a> web page explains how to remove this requirement. If $SOURCE does not work and you need it to work, you can configure SELinux temporarily to allow this access until the application is fixed. Please file a bug report against this package.
es: La aplicación $SOURCE intentó cambiar la protección de acceso de memoria en la memoria heap (por ejemplo, la obtenida usando malloc). Este es un problema potencial de seguridad. Las aplicaciones nunca deberían hacer esto. A veces, las aplicaciones se programan de manera incorrecta y requieren este permiso. La página web <a href="http://people.redhat.com/drepper/selinux-mem.html">Pruebas de protección de memoria en SELinux</a> explica cómo eliminar este requerimiento. Si $SOURCE no funciona y necesita que funcione, puede configurar SELinux para que permita temporalmente este acceso hasta que la aplicación sea corregida. Por favor, elabore un informe del error a nombre de para este paquete.
fr: L'application $SOURCE a essayé de changer l'accès de protection-mémoire sur la pile (par exemple allocation utilisant malloc). C'est un problème potentiel de sécurité. Les applications ne devraient pas faire cela. Elles sont parfois incorrectement programmées et demandent cette permission. La page web <a href="http://people.redhat.com/drepper/selinux-mem.html">Essais de protection mémoire de SELinux</a> explique comment retirer ces exigences. Si $SOURCE ne fonctionne pas et que vous avez besoin qu'il fonctionne, vous pouvez configurer temporairement SELinux pour autoriser cet accès jusqu'à ce que l'application soit corrigée. Merci de remplir un rapport d'anomalie sur ce paquet.
it: L'applicazione $SOURCE ha tentato di cambiare la protezione di accesso della memoria sull'heap (es., allocata usando malloc). Questo è un potenziale problema di sicurezza. Le applicazioni non dovrebbero farlo. Le applicazioni talvolta sono codificate in modo non corretto e richiedono questo permesso. La pagina web <a href="http://people.redhat.com/drepper/selinux-mem.html">SELinux Memory Protection Tests</a> spiega come rimuovere questo requisito. Se $SOURCE non funziona ma risulta necessario usarlo, è possibile configurare SELinux per abilitare temporaneamente questo accesso fino a che l'applicazione non sarà corretta. Si invita ad inviare un bug report relativo a questo pacchetto.

source: If you want $SOURCE to continue, you must turn on the $BOOLEAN boolean. Note: This boolean will affect all applications on the system.
es: Si quiere que $SOURCE continúe, debe cambiar el valor de $BOOLEAN. Nota: este booleano afectará a todas las aplicaciones en el sistema.
fr: Si vous souhaitez que $SOURCE continue, vous devez activer le booléen $BOOLEAN. Remarque : Ce booléen affectera toutes les applications sur le système.
it: Se si vuole che $SOURCE continui, bisogna impostare ad on il booleano $BOOLEAN. Nota: Questo booleano avrà effetto su tutte le applicazioni del sistema.

source: you do not think $SOURCE_PATH should need to map heap memory that is both writable and executable.
es: no cree que $SOURCE_PATH debería necesitar mapear memoria del heap que sea a la vez escribible y ejecutable.
fr: vous pensez que $SOURCE_PATH ne devrait pas faire correspondre la mémoire du tas, qui est à la fois exécutable et accessible en écriture.
it: non si pensa che $SOURCE_PATH possa mappare la memoria heap che è sia scrivibile che eseguibile.

source: you need to report a bug. This is a potentially dangerous access.
es: necesita informar de un error. Éste es un acceso potencialmente peligroso.
fr: vous devez établir un rapport d'anomalie. Cet accès est potentiellement dangereux.
it: è necessario riportare un bug. Questo è un accesso potenzialmente pericoloso.

source: Contact your security administrator and report this issue.
es: Póngase en contacto con su administrador de seguridad e informe de este problema.
fr: Veuillez contacter l'administrateur de sécurité et rapporter ce problème.
it: Contattare il proprio amministratore di sicurezza e riportare il problema.

source: SELinux is preventing $SOURCE_PATH from loading $TARGET_PATH which requires text relocation.
es: SELinux está impidiendo a $SOURCE_PATH cargar $TARGET_PATH, lo cual requiere una reubicación de texto.
fr: SELinux empêche $SOURCE_PATH de charger $TARGET_PATH qui exige une réinstallation du texte.
it: SELinux ha impedito al $SOURCE_PATH di caricare $TARGET_PATH il quale necessita di un text relocation.

source: The $SOURCE application attempted to load $TARGET_PATH which requires text relocation. This is a potential security problem. Most libraries do not need this permission. Libraries are sometimes coded incorrectly and request this permission. The <a href="http://people.redhat.com/drepper/selinux-mem.html">SELinux Memory Protection Tests</a> web page explains how to remove this requirement. You can configure SELinux temporarily to allow $TARGET_PATH to use relocation as a workaround, until the library is fixed. Please file a bug report.
es: La aplicación $SOURCE intentó cargar $TARGET_PATH que requiere reubicación de texto. Ésto es un problema potencial de seguridad. La mayoría de las bibliotecas no necesitan este permiso. A veces, las bibliotecas están programadas incorrectamente y requieren este permiso. La página web de <a href="http://people.redhat.com/drepper/selinux-mem.html">Pruebas de protección de memoria en SELinux</a> explica como eliminar este requerimiento. Puede configurar SELinux para que permita temporalmente a $TARGET_PATH usar la reubicación mientras se corrige la biblioteca. Por favor, elabore un informe de error.
fr: L'application $SOURCE a essayé de charger $TARGET_PATH qui exige une réinstallation du texte. C'est un problème potentiel de sécurité . La plupart des bibliothèques n'ont pas besoin de cette permission. Les bibliothèques sont parfois programmées incorrectement et demandent cette permission. La page web <a href="http://people.redhat.com/drepper/selinux-mem.html">Essais de protection mémoire de SELinux</a> explique comment retirer ces exigences. Vous pouvez configurer temporairement SELinux pour permettre à $TARGET_PATH d'utiliser le ré-adressage et contourner cette protection, jusqu'à ce que la bibliothèque soit corrigée. Merci de remplir un <a href="http://bugzilla.redhat.com/bugzilla/enter_bug.cgi">rapport d'anomalie</a> pour ce paquet.
it: L'applicazione $SOURCE ha tentato di caricare $TARGET_PATH che necessita di un text relocation. Questo è un potenziale problema di sicurezza. Molte librerie non hanno bisogno di questo permesso. Le librerie sono talvolta codificate in modo non corretto e richiedono questo permesso. La pagina web <a href="http://people.redhat.com/drepper/selinux-mem.html">SELinux Memory Protection Tests</a> spiega come rimuovere questo requisito. E' possibile configurare SELinux per permettere temporaneamente a $TARGET_PATH di usare relocation come soluzione temporanea, fino a che la libreria non sia corretta. Si prega di inviare un bug report su questo pacchetto.

source: The $SOURCE application attempted to load $TARGET_PATH which requires text relocation. This is a potential security problem. Most libraries should not need this permission. The <a href="http://people.redhat.com/drepper/selinux-mem.html"> SELinux Memory Protection Tests</a> web page explains this check. This tool examined the library and it looks like it was built correctly. So setroubleshoot can not determine if this application is compromized or not. This could be a serious issue. Your system may very well be compromised. Contact your security administrator and report this issue.
es: La aplicación $SOURCE intentó cargar $TARGET_PATH que requiere la reubicación de texto. Ésto es un problema potencial de seguridad. La mayoría de las bibliotecas no necesitan este permiso. La página web de <a href="http://people.redhat.com/drepper/selinux-mem.html">Pruebas de protección de memoria en SELinux</a> explica en qué consiste esta comprobación. Esta herramienta examinó la biblioteca y parece que fue construida correctamente. Por eso, setroubleshoot no puede determinar si esta aplicación ha sido comprometida o no. Esto podría ser algo serio. Su sistema puede haber sido comprometido. Contacte con su administrador de seguridad e informe de este problema.
fr: L'application $SOURCE a essayé de charger $TARGET_PATH qui exige une réinstallation du texte. C'est un problème potentiel de sécurité . La plupart des bibliothèques n'ont pas besoin de cette permission. Les bibliothèques sont parfois programmées incorrectement et demandent cette permission. La page web <a href="http://people.redhat.com/drepper/selinux-mem.html">Essais de protection mémoire de SELinux</a> explique le processus de vérification. Cet outil a examiné la bibliothèque et il apparait qu'elle a été correctement construite. Pour cette raison, setroubleshoot ne peut pas être certain que cette application est compromise. Cela pourrait être un problème sérieux. Votre système pourrait être compromis. Contactez votre administrateur et informez-le de ce problème.
it: L'applicazione $SOURCE ha tentato di caricare $TARGET_PATH che necessita text relocation. Questo è un potenziale problema di sicurezza. Molte librerie non hanno bisogno di questo permesso. La pagina web <a href="http://people.redhat.com/drepper/selinux-mem.html">SELinux Memory Protection Tests</a> spiega come rimuovere questa richiesta. Questo strumento ha esaminato la libreria e sembra che sia stata compilata correttamente. Quindi setroubleshoot non è in grado di determinare se questa applicazione sia compromessa oppure no. Questo potrebbe essere un problema serio. Il sistema potrebbe essere seriamente compromesso. Contattare l'amministratore di sistema e riportare questo problema.

source: If you trust $TARGET_PATH to run correctly, you can change the file context to textrel_shlib_t. "chcon -t textrel_shlib_t '$TARGET_PATH'" You must also change the default file context files on the system in order to preserve them even on a full relabel. "semanage fcontext -a -t textrel_shlib_t '$FIX_TARGET_PATH'"
es: Si confía en que $TARGET_PATH se está ejecutando correctamente, puede cambiar el contexto de archivo a textrel_shlib_t. "chcon -t textrel_shlib_t '$TARGET_PATH'" También debe cambiar el contexto de archivo predeterminado de los archivos del sistema, para preservarlos incluso después de un reetiquetado completo. "semanage fcontext -a -t textrel_shlib_t '$FIX_TARGET_PATH'"
fr: Si vous autorisez $TARGET_PATH à fonctionner correctement, vous pouvez changer le contexte du fichier à textrel_shlib_t. « chcon -t textrel_shlib_t $TARGET_PATH » Vous devez aussi changer le dossier par défaut des fichiers de contexte de votre système, même lors d'un nouvel étiquetage complet, de manière à les préserver. « semanage fcontext -a -t textrel_shlib_t '$FIX_TARGET_PATH' »
it: Se si ritiene che $TARGET_PATH sia correttamente in esecuzione, è possibile cambiare il contesto del file in textrel_shlib_t. "chcon -t textrel_shlib_t '$TARGET_PATH'" È necessario inoltre cambiare il contesto file predefinito dei file sul sistema per preservarli anche da una completa rietichettatura. "semanage fcontext -a -t textrel_shlib_t '$FIX_TARGET_PATH'"

source: SELinux is preventing $SOURCE_PATH from making the program stack executable.
es: SELinux está impidendo a $SOURCE_PATH hacer ejecutable la pila del programa.
fr: SELinux empêche $SOURCE_PATH de rendre exécutable la pile du programme.
it: SELinux impedisce al $SOURCE_PATH di rendere lo stack del programma eseguibile.

source: The $SOURCE application attempted to make its stack executable. This is a potential security problem. This should never ever be necessary. Stack memory is not executable on most OSes these days and this will not change. Executable stack memory is one of the biggest security problems. An execstack error might in fact be most likely raised by malicious code. Applications are sometimes coded incorrectly and request this permission. The <a href="http://people.redhat.com/drepper/selinux-mem.html">SELinux Memory Protection Tests</a> web page explains how to remove this requirement. If $SOURCE does not work and you need it to work, you can configure SELinux temporarily to allow this access until the application is fixed. Please file a bug report.
es: La aplicación $SOURCE intentó hacer su pila ejecutable. Éste es un problema potencial de seguridad. Ésto nunca debería ser necesario. La memoria de la pila no es ejecutable en la mayoría de los sistemas operativos actuales y esto no va a cambiar. Una memoria de pila ejecutable es uno de los mayores problemas de seguridad que existen. Un error de ejecución de pila puede ser resultado en realidad de algún código malicioso. Las aplicaciones a veces son programadas incorrectamente y requieren este permiso. La página web de <a href="http://people.redhat.com/drepper/selinux-mem.html">Pruebas de protección de memoria en SELinux</a> explica cómo eliminar este requerimiento. Si $SOURCE no funciona y necesita que lo haga, puede configurar SELinux para que permita temporalmente este acceso hasta que se corrija la aplicación. Por favor, elabore un informe de errores.
fr: L'application $SOURCE a essayé de rendre sa propre pile exécutable. C'est un problème potentiel de sécurité. Cette action ne devrait jamais être nécessaire. De nos jours, une pile-mémoire n'est pas exécutable sur les OS et cela ne changera pas. Une pile-mémoire exécutable est l'un des problèmes de sécurité les plus sévères . Une erreur execstack pourrait être causée par un code malveillant. Les applications sont parfois incorrectement programmées et demandent cette permission. La page web <a href="http://people.redhat.com/drepper/selinux-mem.html">Essais de protection mémoire de SELinux</a> explique comment retirer ces exigences. Si $SOURCE ne fonctionne pas et que vous avez besoin qu'il fonctionne, vous pouvez configurer temporairement SELinux pour autoriser cet accès jusqu'à ce que l'application soit corrigée. Merci de remplir un rapport d'anomalie.
it: L'applicazione $SOURCE ha tentato di rendere il suo stack eseguibile. Questo è un potenziale problema di sicurezza. Ciò non dovrebbe mai essere necessario. La stack memory non è eseguibile sulla maggior parte degli OS odierni e tale tendenza non cambierà. La stack memory eseguibile è uno fra i più grandi problemi di sicurezza. Un errore execstack potrebbe in effetti essere causato da codice malizioso. Le applicazioni sono talvolta codificate in modo non corretto e richiedono questo permesso. La pagina web <a href="http://people.redhat.com/drepper/selinux-mem.html">SELinux Memory Protection Tests</a> spiega come rimuovere questo requisito. Se $SOURCE non funziona ma è necessario per lavorare, è possibile configurare SELinux per permettere temporaneamente questo accesso fino a che l'applicazione non sarà corretta. Inviare un bug report relativo a questo pacchetto.

source: Sometimes a library is accidentally marked with the execstack flag, if you find a library with this flag you can clear it with the execstack -c LIBRARY_PATH. Then retry your application. If the app continues to not work, you can turn the flag back on with execstack -s LIBRARY_PATH.
es: A veces, una biblioteca es marcada accidentalmente con la etiqueta execstack, si encuentra una biblioteca con esta etiqueta, puede desactivarla con execstack -c LIBRARY_PATH. Después, vuelva a intentar ejecutar la aplicación. Si aún así, la aplicación sigue sin funcionar, puede volver a activar la etiqueta con execstack -s LIBRARY_PATH.
fr: Parfois une bibliothèque est accidentellement marquée avec l'indicateur execstack. Si vous trouvez une bibliothèque avec cet indicateur, vous pouvez la nettoyer avec execstack -c LIBRARY_PATH. Ensuite réessayez votre application. Si l'application continue de ne pas fonctionner, vous pouvez restaurer l'indicateur avec execstac -s LIBRARY_PATH.
it: Talvolta una libreria è accidentalmente contrassegnata con il flag execstack, in presenza di una libreria con il suddetto flag usare execstack -c LIBRARY_PATH per la sua rimozione. Quindi riavviare l'applicazione. Se l'applicazione continua a non funzionare è possibile ripristinare il flag con execstack -s LIBRARY_PATH.

source: you do not think $SOURCE_PATH should need to map stack memory that is both writable and executable.
es: no cree que $SOURCE_PATH necesite mapear la memoria de pila que sea tanto escribible como ejecutable.
fr: vous pensez que $SOURCE_PATH ne devrait pas faire correspondre l'allocation de mémoire de la pile, qui est à la fois exécutable et accessible en écriture.
it: non si pensa che $SOURCE_PATH possa mappare lo stack di memoria che è sia scrivibile che eseguibile.

source: you need to report a bug. This is a potentially dangerous access.
es: necesita informar de un error. Este es un acceso potencialmente peligroso.
fr: vous devez établir un rapport d'anomalie. Cet accès est potentiellement dangereux.
it: è necessario riportare un bug. Questo è un accesso potenzialmente pericoloso.

source: you believe that %s should not require execstack
es: cree que %s no debería necesitar la ejecución de pila
fr: si vous croyez que %s ne devrait pas avoir besoin de execstack
it: si pensa che %s non dovrebbe richiedere execstack

source: you should clear the execstack flag and see if $SOURCE_PATH works correctly. Report this as a bug on %s. You can clear the exestack flag by executing:
es: debería eliminar la etiqueta execstack y verificar que $SOURCE_PATH funcione correctamente. Informe de esto como un error en %s. Puede eliminar la etiqueta execstack ejecutando:
fr: vous devriez supprimer l'indicateur execstack et voir si $SOURCE_PATH fonctionne correctement. Veuillez rapporter ceci en tant qu'anomalie sur %s. Vous pouvez supprimer l'indicateur exestack en exécutant :
it: si dovrebbe rimuovere il flag l'execstack e verificare se $SOURCE_PATH funziona correttamente. Riportare il bug su %s. E' possibile rimuovere il flag execstack eseguendo:

source: SELinux prevented the ftp daemon from $ACCESS files stored on a CIFS filesystem.
es: SELinux impidió al demonio ftp el acceso $ACCESS sobre los archivos almacenados en un sistema de archivo CIFS.
fr: SELinux a empêché le démon ftp de $ACCESS les fichiers stockés sur un système de fichiers CIFS.
it: SELinux ha impedito al demone ftp l'$ACCESS ai file immagazzinati su di un filesystem CIFS.
