Repository: Justasic/setroubleshoot
Catalog: plugins/po/*.po
Languages: es, fr, it

source: If you want to allow cluster administrative domains to connect to the network using TCP.
es: Si desea permitir a los dominios administrativos de cluster conectar a la red usando TCP.
fr: Si vous souhaitez autoriser les domaines administratifs de cluster à se connecter au réseau en utilisant TCP.
it: Se si desidera permettere ai domini amministrativi del cluster la connessione alla rete utilizzando TCP.

source: If you want to allow http daemon to send mail
es: Si quiere permitir al demonio http envíar correos
fr: Si vous souhaitez autoriser le démon http à envoyer des courriels
it: Se si desidera consentire al demone httpd di inviare mail

source: If you want to allow samba to export ntfs/fusefs volumes.
es: Si quiere permitir a samba exportar volúmenes ntfs/usefs.
fr: Si vous souhaitez autoriser samba à exporter des volumes ntfs/fusefs.
it: Se si desidera consentire a samba di esportare volumi ntfs/fusefs.

source: If you want to allow staff user to create and transition to svirt domains.
es: Si quiere permitir a los usuarios del equipo crear y transicionar a dominios svirt.
fr: Si vous souhaitez autoriser un utilisateur staff à créer puis transitionner vers des domaines svirt.
it: Se si desidera permettere all'utente staff di creare e transitare sui domini svirt.

source: If you want to allow mozilla plugin domain to connect to the network using TCP.
es: Si quiere permitir al dominio mozilla plugin conectarse a la red usando TCP.
fr: Si vous souhaitez autoriser le domaine des greffons mozilla à se connecter au réseau à l'aide de TCP.
it: Se si desidera permettere al dominio del plugin di mozilla di collegarsi alla rete usando TCP.

source: If you want to allow httpd to use built in scripting (usually php)
es: Si quiere permitir a httpd utilizar guiones incorporados (normalmente php)
fr: Si vous souhaitez autoriser httpd à utiliser le script intégré (habituellement php)
it: Se si desidera consentire a httpd di usare lo scripting built-in (normalmente php)

source: If you want to allow confined users the ability to execute the ping and traceroute commands.
es: Si quiere permitir a los usuarios confinados la capacidad de ejecutar los comandos ping y traceroute.
fr: Si vous souhaitez autoriser les utilisateurs confinés à utiliser les commandes ping et traceroute.
it: Se si desidera permettere agli utenti confinati la possibilità di eseguire i comandi ping e traceroute.

source: If you want to determine whether exim can create, read, write, and delete generic user content files.
es: Si quiere comprobar si exim puede crear, leer, escribir y borrar archivos de usuario de contenido genérico.
fr: Si vous souhaitez déterminer si exim peut créer, lire, écrire et supprimer des fichiers utilisateurs génériques.
it: Se si desidera determinare se exim può creare, leggere, scrivere, ed eliminare il contenuto dei file dell'utente generico.

source: If you want to allow cluster administrative domains to manage all files on a system.
es: Si quiere permitir a los dominios administrativos de cluster manejar todos los ficheros de un sistema.
fr: Si vous souhaitez autoriser les domaines administratifs de cluster à gérer tous les fichiers sur un système.
it: Se si desidera permettere ai domini amministrativi del cluster di gestire tutti i file in un sistema.

source: If you want to determine whether cdrecord can read various content. nfs, samba, removable devices, user temp and untrusted content files
es: Si desea determinar si cdrecord puede leer diversos contenidos, nfs, samba, dispositivos removibles, temporales de usuario y contenido de ficheros no confiables.
fr: Si vous souhaitez déterminer si cdrecord à lire divers contenus, tels que nfs, samba, des périphériques amovibles, des fichiers temporaires d'utilisateur et des fichiers de contenus non-approuvés.
it: Se si desidera determinare se cdrecord può leggere vari contenuti. nfs, samba, dispositivi removibili, file temp dell'utente e file con contenuto non di fiducia.

source: If you want to determine whether Cobbler can modify public files used for public file transfer services.
es: Si desea determinar si Cobbler puede modificar los ficheros públicos para los servicios de transferencia pública de ficheros.
fr: Si vous souhaitez déterminer si Cobbler peut modifier des fichiers publics utilisés pour des services de transferts de fichiers publics.
it: Se si vuole determinare se Cobbler può modificare i file pubblici utilizzati per servizi di transferimento file pubblici.

source: If you want to allow samba to export NFS volumes.
es: Si quiere permitir a samba exportar volúmenes NFS.
fr: Si vous souhaitez autoriser samba à exporter les volumes NFS.
it: Se si desidera consentire a samba di esportare volumi NFS.

source: If you want to control the ability to mmap a low area of the address space, as configured by /proc/sys/kernel/mmap_min_addr.
es: Si quiere controlar la capacidad de realizar mmap sobre una área inferior del espacio de direcciones, tal y como se encuentra configurado en /proc/sys/kernel/mmap_min_addr.
fr: Si vous souhaitez contrôler la capacité d'allouer de l'espace dans la zone mémoire basse de l'espace d'adressage via mmap, comme configuré par /proc/sys/kernel/mmap_min_addr.
it: Se si desidera controllare la funzionalità di mmap di un area bassa dello spazio degli indirizzi, come configurato da /proc/sys/kernel/mmap_min_addr.

source: If you want to determine whether dbadm can read generic user files.
es: Si quiere determinar si dbadm puede leer arhivos de usuario genéricos.
fr: Si vous souhaitez déterminer si dbadm peut lire les fichiers utilisateurs génériques.
it: Se si desidera determinare se dbadm può leggere i file dell'utente generico.

source: If you want to determine whether ftpd can use NFS used for public file transfer services.
es: Si quiere determinar si ftpd puede usar NFS usado para servicios de transferencia pública de archivos.
fr: Si vous souhaitez déterminer si ftp peut utiliser NFS pour des services de transferts de fichiers publics.
it: Se si desidera determinare se ftpd può utilizzare NFS utilizzato per servizi di transferimento di file pubblici.

source: If you want to allow antivirus programs to read non security files on a system
es: Si quiere permitir a los programas antivirus leer ficheros no de seguridad en un sistema
fr: Si vous souhaitez autoriser les antivirus à lire tous les fichiers non relatifs à la sécurité sur un système.
it: Se si desidera permettere ai programmi antivirus di leggere i file di non sicurezza in un sistema.

source: If you want to determine whether calling user domains can execute Polipo daemon in the polipo_session_t domain.
es: Si quiere determinar si los dominios de usuarios llamantes puedan ejecutar el demonio Polipo en el domino polipo_session_t.
fr: Si vous souhaitez déterminer si les domaines utilisateurs appelants peuvent exécuter le démon Polipo dans le domaine polipo_session_t.
it: Se si desidera determinare se i domini utente chiamanti possono eseguire il demone Polipo nel dominio polipo_session_t.

source: If you want to allow confined applications to run with kerberos.
es: Si quiere permitir a aplicaciones confinadas ejecutarse con kerberos.
fr: Si vous souhaitez autoriser les applications confinées à s'exécuter avec kerberos.
it: Se si desidera consentire alle applicazioni confinate l'esecuzione con kerberos.

source: If you want to allow http daemon to check spam
es: Si quiere permitir al demonio http comprobar el correo basura
fr: Si vous souhaitez autoriser le démon http à vérifier le spam
it: Se si desidera consentire al demone httpd di controllare lo spam

source: If you want to allow xguest users to mount removable media
es: Si quiere permitir que usuarios xguest monten dispositivos extraíbles
fr: Si vous souhaitez autoriser les utilisateurs xguest à monter des supports amovibles
it: Se si desidera consentire agli utenti xguest di montare supporti rimovibili

source: If you want to determine whether sftpd-can login to local users and read and write all files on the system, governed by DAC.
es: Si quiere comprobar si sftpd puede acceder a los usuarios locales y leer y escribir todos los archivos sobre el sistema, gobernado por DAC.
fr: Si vous souhaitez déterminer si sftpd peut se connecter aux utilisateurs locaux et lire ou écrire tous les fichiers du système, gouverné par le contrôle d'accès discrétionnaire.
it: Se si desidera determinare se sftpd può effettuare il login su utenti locali e leggere e scrivere tutti i file nel sistema, governato da DAC.

source: If you want to determine whether Bind can bind tcp socket to http ports.
es: Si quiere determinar si Bind puede enlazar sockets tcp a puertos http.
fr: Si vous souhaitez déterminer si Bind peut lier les sockets tcp aux ports http.
it: Se si desidera determinare se Bind può associare il socket tcp alle porte http.

source: If you want to allow syslogd the ability to read/write terminals
es: Si quiere permitir a syslogd la capacidad de leer/escribir en terminales
fr: Si vous souhaitez autoriser syslogd à accéder aux terminaux en lecture/écriture
it: Se si desidera consentire a syslogd la possibilità di leggere/scrivere terminali

source: If you want to allow dhcpc client applications to execute iptables commands
es: Si quiere permitir a las aplicaciones del cliente de dhcpc ejecutar comandos de iptables
fr: Si vous souhaitez autoriser les applications clientes dhcpc à exécuter les commandes iptables
it: Se si desidera consentire alle applicazioni client dhcpc di eseguire comandi iptables

source: If you want to allow syslogd daemon to send mail
es: Si quiere permitir al demonio syslogd envíar correo-e
fr: Si vous souhaitez autoriser le démon syslogd à envoyer des courriels
it: Se si desidera consentire al demone syslogd di inviare mail

source: If you want to determine whether Polipo can access nfs file systems.
es: Si quiere comprobar si Polipo puede acceder a sistemas de archivos nfs.
fr: Si vous souhaitez déterminer si Polipo peut accéder aux systèmes de fichiers nfs.
it: Se si desidera determinare se Polipo può accedere ai filesystem nfs.

source: If you want to allow samba to run unconfined scripts
es: Si quiere permitir a samba ejecutar guiones no confinados
fr: Si vous souhaitez autoriser samba à exécuter des scripts non-confinés
it: Se si desidera consentire a samba l'esecuzione di script non confinati

source: If you want to allow nsplugin code to execmem/execstack
es: Si quiere permitir que código nsplugin realice execmem/execstack
fr: Si vous souhaitez autoriser le code nsplugin sur execmem/execstack
it: Se si desidera consentire al codice nsplugin di execmem/execstack

source: If you want to enable reading of urandom for all domains.
es: Si quiere habilitar la lectura de urandom para todos los dominios.
fr: Si vous souhaitez activer la lecture de urandom pour tous les domaines.
it: Se si desidera consentire la lettura di urandom da tutti i domini.

source: If you want to allow xguest to use blue tooth devices
es: Si quiere permitirle a xguest usar dispositivos blue tooth
fr: Si vous souhaitez autoriser les utilisateurs xguest à utiliser des périphériques bluetooth
it: Se si desidera permettere agli utenti xguest di usare i dispositivi bluetooth

source: If you want to determine whether mpd can use cifs file systems.
es: Si quiere comprobar si mpd puede usar sistemas de archivos cifs.
fr: Si vous souhaitez déterminer si mpd peut utiliser les systèmes de fichiers cifs.
it: Se si desidera determinare se mpd può utilizzare i file system cifs.

source: If you want to determine whether ftpd can connect to all unreserved ports.
es: Si quiere comprobar si ftpd puede conectarse a todos los puertos no reservados.
fr: Si vous souhaitez déterminer si ftpd peut se connecter sur tout port non-réservé.
it: Se si desidera determinare se ftpd può connettersi a tutte le porte disponibili.

source: If you want to determine whether Gitosis can send mail.
es: Si quiere comprobar si Gitosis puede enviar correo-e.
fr: Si vous souhaitez déterminer si Gitosis peut envoyer des courriels.
it: Se si vuole determinare se Gitosis può inviare email.

source: If you want to allow httpd to connect to memcache server
es: Si quiere permitir a httpd conectarse al servidor de memcache
fr: Si vous souhaitez autoriser httpd à se connecter au serveur memcache
it: Se si desidera consentire a httpd di connettersi al server memcache

source: If you want to allow HTTPD scripts and modules to connect to cobbler over the network.
es: Si quiere permitir a los guiones y módulos HTTPD conectarse con cobbler a través de la red.
fr: Si vous souhaitez autoriser des scripts et modules HTTPD à se connecter à cobbler à travers le réseau.
it: Se si desidera consentire agli script e ai moduli HTTPD di connettersi a cobbler tramite rete.

source: If you want to allow Apache to modify public files used for public file transfer services. Directories/Files must be labeled public_content_rw_t.
es: Si quiere permitir a Apache moficirae archivos públicos utilizados por servicios de transferencia de archivos públicos. Las carpetas/archivos deber ser etiquetados como public_content_rw_t.
fr: Si vous souhaitez autoriser Apache à modifier les fichiers publics utilisés pour les services de transfert de fichiers publics. Les fichiers ou répertoires doivent être étiquetés public_content_rw_t.
it: Se si desidera consentire a Apache di modificare file pubblici usati per il servizio di trasferimento di file pubblici. I file/cartelle devono essere etichettati public_content_rw_t.

source: If you want to allow HTTPD scripts and modules to server cobbler files.
es: Si quiere permitir que guiones y módulos HTTPD accedan al servidor de archivos cobbler.
fr: Si vous souhaitez autoriser les scripts et modules HTTPD à servir les fichiers de cobbler.
it: Se si desidera permettere gli script e i moduli HTTPD ai file di server cobbler.

source: If you want to allow all daemons the ability to read/write terminals
es: Si quiere permitir a todos los demonios la capacidad de leer/escribir en terminales
fr: Si vous souhaitez autoriser tous les démons à accéder aux terminaux en lecture/écriture
it: Se si desidera concedere a tutti i demoni l'abilità di leggere/scrivere terminali

source: If you want to determine whether Condor can connect to the network using TCP.
es: Si quiere comprobar si Condor puede conectarse a la red usando TCP.
fr: Si vous souhaitez déterminer si Condor peut se connecter au réseau en utilisant TCP.
it: Se si desidera determinare se Condor può connettersi alla rete utilizzando TCP.

source: If you want to allow users to resolve user passwd entries directly from ldap rather then using a sssd server
es: Si quiere permitir a los usuarios resolver entradas passwd de usuario directamente desde ldap en vez de usar un servidor sssd
fr: Si vous souhaitez autoriser les utilisateurs à résoudre les entrées passwd utilisateur directement depuis LDAP plutôt que d'utiliser un serveur sssd
it: Se si desidera permettere agli utenti di risolvere le voci user passwd direttamente da ldap senza usare un server sssd

source: If you want to determine whether ftpd can modify public files used for public file transfer services. Directories/Files must be labeled public_content_rw_t.
es: Si quiere comprobar si ftpd puede modificar archivos públicos usados por los servicios de transferencia pública de ficheros. Las carpetas/archivos deben estar etiquetados como public_content_rw_t.
fr: Si vous souhaitez déterminer si ftpd peut modifier les fichiers publics utilisés pour les services de transfert de fichiers publics. Les fichiers ou répertoires doivent être étiquetés public_content_rw_t.
it: Se si desidera determinare se ftpd può modificare i file pubblici utilizzati per i servizi di trasferimento dei file pubblici. Cartelle/File devono essere etichettati public_content_rw_t.

source: If you want to allow sanlock to manage cifs files
es: Si quiere permitirle a sanlock administrar archivos cifs
fr: Si vous souhaitez autoriser sanlock à gérer les fichiers cifs
it: Se si desidera permettere a sanlock di gestire i file cifs

source: If you want to determine whether awstats can purge httpd log files.
es: Si quiere comprobar si awstats puede purgar los ficheros de registro httpd.
fr: Si vous souhaitez déterminer si awstats peut purger les fichiers journaux de httpd.
it: Se si desidera determinare se awstats può eliminare i file log di httpd.

source: If you want to determine whether portage can use nfs filesystems.
es: Si desea determinar si portage puede usar sistemas de archivos nfs.
fr: Si vous souhaitez déterminer si portage peut utiliser les systèmes de fichiers nfs.
it: Se si desidera determinare se portage può utilizzare i filesystem nfs.

source: If you want to allow unprivledged user to create and transition to svirt domains.
es: Si quiere permitir a un usuario sin privilegios crear y transicionar a dominios svirt.
fr: Si vous souhaitez autoriser un utilisateur non privilégié à créer puis transitionner vers des domaines svirt.
it: Se si desidera permettere agli utenti non privilegiati di creare e transitare sui domini svirt.

source: If you want to determine whether to support lpd server.
es: Si desea determinar si soportar servidor lpd.
fr: Si vous souhaitez déterminer si l'on doit prendre en charge le serveur lpd.
it: Se si desidera determinare se supportare il server lpd.

source: If you want to determine whether webadm can manage generic user files.
es: Si desea determinar si webadm puede manejrar ficheros genéricos de usuario.
fr: Si vous souhaitez déterminer si webadm peut gérer les fichiers utilisateurs génériques.
it: Se si desidera determinare se webadm può gestire i file dell'utente generico.

source: If you want to determine whether can clamd use JIT compiler.
es: Si desea determinar si cpuede clamd usar el compilador JIT.
fr: Si vous souhaitez déterminer si clamd peut utiliser le compilateur JIT.
it: Se si desidera determinare se clamd può utilizzare il compilatore JIT.

source: If you want to allow qemu to use nfs file systems
es: Si desea permitir a qemu que utilice sistemas de arvhiso nfs.
fr: Si vous souhaitez autoriser qemu à utiliser les systèmes de fichiers nfs
it: Se si desidera consentire a qemu di usare i file system nfs

source: If you want to determine whether Git session daemon can bind TCP sockets to all unreserved ports.
es: Si quiere determinar si el demonio de sesión Git puede escuchar en sockets TCP en todos los puertos no reservados.
fr: Si vous souhaitez déterminer si le démon de session Git peut lier les sockets TCP à tous les ports non-réservés.
it: Se si desidera determinare se il demone di sessione Git può associarsi ai socket TCP di tutte le porte non usate.

source: If you want to allow HTTPD to run SSI executables in the same domain as system CGI scripts.
es: Si desea permitir que HTTPD ejecute ejecutables SSI en el mismo dominio que los scripts CGI.
fr: Si vous souhaitez autoriser HTTPD à exécuter les exécutables SSI dans le même domaine ques les scripts CGI système.
it: Se si desidera consentire a HTTPD di eseguire degli eseguibili SSI nello stesso dominio degli script di sistema CGI.

source: If you want to allow mozilla plugin to support spice protocols.
es: Si desea permitir que el complemento de mozilla soporte el protocolo spice.
fr: Si vous souhaitez autoriser les greffons mozilla à prendre en charge les protocoles spice.
it: Se si desidera permettere al plugin mozilla di supportare i protoccoli spice.

source: If you want to allow httpd to access openstack ports
es: Si quiere permitir a httpd el acceso a puertos openstack
fr: Si vous souhaitez autoriser httpd à accéder aux ports openstack
it: Se si desidera permettere a httpd un accesso alle porte openstack

source: If you want to allow httpd to act as a FTP server by listening on the ftp port.
es: Si desea permitir que httpd actúe como servidor FTP escuchando sobre el puerto ftp.
fr: Si vous souhaitez autoriser httpd à agir en tant que serveur FTP en écoutant sur le port ftp.
it: Se si desidera consentire a httpd di agire come un server FTP ascoltando sulla porta ftp.

source: If you want to allow all daemons to write corefiles to /
es: Si desea permitir que todos los demonios puedan modificar o agregar archivos principales en /
fr: Si vous souhaitez autoriser tous les démons à écrire les fichiers core sur /
it: Se si desidera concedere a tutti i demoni di scrivere corefile in /

source: If you want to enable extra rules in the cron domain to support fcron.
es: Si desea habilitar reglas adicionales en el dominio cron para soportar fcron.
fr: Si vous souhaitez activer des règles supplémentaires du domaine cron pour prendre en charge fcron.
it: Se si desidera abilitare regole extra nel dominio cron per il supporto a fcron.

source: If you want to determine whether sftpd can read and write files in user ssh home directories.
es: Si quiere comprobar si sftpd puede leer y escribir archivos en las carpetas de usuario de ssh.
fr: Si vous souhaitez déterminer si sftpd peut accéder en lecture et en écriture dans les répertoires utilisateurs ssh.
it: Se si vuole terminare se sftpd può leggere e scrivere file nelle home ssh dell'utente.

source: If you want to allow http daemon to connect to zabbix
es: Si desea permitir que el demonio http se conecte con zabbix
fr: Si vous souhaitez autoriser le démon http à se connecter à zabbix
it: Se si desidera consentire al demone httpd di connettersi a zabbix

source: If you want to allow transmit client label to foreign database
es: Si quiere permitir la transmisión de la etiqueta del cliente a una base de datos externa
fr: Si vous souhaitez autoriser à transmettre l'étiquette du client à une base de données externe
it: Se si desidera permettere la trasmissione dell'etichetta del client a database esterno

source: If you want to determine whether collectd can connect to the network using TCP.
es: Si desea determknar si collectd puede conectar a la red usando TCP.
fr: Si vous souhaitez déterminer si collectd peut se connecter au réseau en utilisant TCP.
it: Se si desidera determinare se collect può connettersi alla rete utilizzando TCP.

source: If you want to determine whether Cobbler can access cifs file systems.
es: Si desea determinar si Cobbler puede acceder a sistemas de archivos cifs.
fr: Si vous souhaitez déterminer si Cobbler peut accéder aux systèmes de fichiers cifs.
it: Se si desidera determinare se Cobbler può accedere ai filesystem cifs.

source: If you want to determine whether mcelog supports server mode.
es: Si desea determinar si mcelog soporta modo servidor.
fr: Si vous souhaitez déterminer si mcelog prend en charge le mode serveur.
it: Se si desidera determinare se mcelog supporta la modalità server.

source: If you want to allow httpd daemon to change its resource limits
es: Si queire permitirle al demonio httpd cambiar sus límites de recursos
fr: Si vous souhaitez autoriser le démon httpd à modifier ses limites de ressources
it: Se si desidera consentire al demone httpd di modificare i limiti delle risorse

source: If you want to determine whether squid can connect to all TCP ports.
es: Si desea determinar si squid puede conectar a todos los puertos TCP.
fr: Si vous souhaitez déterminer si squid peut se connecter sur tous les ports TCP.
it: Se si desidera determinare se squid può connettersi a tutte le porte TCP.

source: If you want to allow all domains to use other domains file descriptors
es: Si desea permitir que todos los dominios utilicen otros descriptores de archivo de dominio
fr: Si vous souhaitez autoriser tous les domaines à utiliser les descripteurs de fichiers des autres domaines
it: Se si desidera consentire a tutti i domini di usare i file di descrizione di altri domini
