Repository: Justasic/setroubleshoot
Catalog: plugins/po/*.po
Languages: es, fr, it

source: If you want to determine whether mcelog supports client mode.
es: Si desea determinar si mcelog soporta el modo cliente.
fr: Si vous souhaitez déterminer si mcelog prend en charge le mode client.
it: Se si desidera determinare se mcelog supporta la modalità client.

source: If you want to allow any files/directories to be exported read/only via NFS.
es: Si desea permitir que cualquier archivo/carpeta sea exportado como de sólo lectura mediante NFS.
fr: Si vous souhaitez autoriser que tout fichier/répertoire puisse être exporté en lecture/écriture via NFS.
it: Se si desidera consentire a qualsiasi file/cartella di essere esportata in sola lettura tramite NFS.

source: If you want to allow system cron jobs to relabel filesystem for restoring file contexts.
es: Si desea permitir que tareas programadas del sistema reetiqueten el sistema de archivos para restaurar los contextos de archivo.
fr: Si vous souhaitez autoriser les tâches système cron à ré-étiqueter le système de fichiers afin de restaurer les contextes de fichiers.
it: Se si desidera consentire ai job cron di sistema di rietichettare il filesystem per il ripristino di file di contesto.

source: If you want to determine whether sftpd can modify public files used for public file transfer services. Directories/Files must be labeled public_content_rw_t.
es: Si desea determinar si sftpd puede modificar ficheros públicos usados por los servicios de transferencia pública de archivos. Los archivos/carpetas deben estar etiquetados como public_content_rw_t.
fr: Si vous souhaitez déterminer si sftpd peut modifier les fichiers publics utilisés pour les services de transfert de fichiers publics. Les fichiers ou répertoires doivent être étiquetés public_content_rw_t.
it: Se si desidera determinare se ftpsd può moficare i file pubblici utilizzati per i servizi di transferimento dei file pubblici. Cartelle/File devono essere etichettati public_content_rw_t.
