Repository: Justasic/setroubleshoot
Catalog: plugins/po/*.po
Languages: es, fr, it

source: If you want to determine whether ftpd can connect to databases over the TCP network.
es: Si quiere comprobar si ftpd puede conectarse a bases de datos sobre la red TCP.
fr: Si vous souhaitez déterminer si ftpd peut se connecter à des bases de données sur le réseau TCP.
it: Se si desidera determinare se ftpd può connettersi ai database attraverso la rete TCP.

source: If you want to determine whether Git system daemon can search home directories.
es: Si quiere determinar si el demonio del sistema Git puede buscar en las carpetas de usuario.
fr: Si vous souhaitez déterminer si le démon système Git à effectuer des recherches dans les répertoires utilisateurs.
it: Se si desidera determinare se il demone del sistema Git può eseguire una ricerca delle directory home.

source: If you want to support SAMBA home directories
es: Si quiere tener soporte para carpetas de usuario sobre SAMBA
fr: Si vous souhaitez prendre en charge les répertoires utilisateurs SAMBA
it: Se si desidera il supporto SAMBA per le cartelle home

source: If you want to allow mock to read files in home directories.
es: Si quiere permitir a mock leer archivos de las carpetas de usuario.
fr: Si vous souhaitez autoriser mock à lire les fichiers dans les répertoires utilisateurs.
it: Se si desidera consentire a mock di leggere file nelle cartelle home.

source: If you want to allow user to r/w files on filesystems that do not have extended attributes (FAT, CDROM, FLOPPY)
es: Si quiere permitir a los usuarios leer/modificar archivos en sistemas que no posean atributos extendidos (FAT, CDROM, FLOPPY)
fr: Si vous souhaitez autoriser l'utilisateur à accéder en lecture/écriture aux systèmes de fichiers ne possédant pas d'attributs étendus (FAT, CDROM, FLOPPY)
it: Se si desidera consentire agli utenti di r/w sui file dei filesystem che non possiedono attributi estesi (FAT, CDROM, FLOPPY)

source: If you want to allow Apache to run in stickshift mode, not transition to passenger
es: quiere permitir a Apache ejecutarse en modo stickshift, sin transicionar a pasajero
fr: si vous voulez autoriser Apache à fonctionner en mode évolutif, ne pas transitionner vers passager
it: Se si desidera permettere ad Apache di eseguirsi in modalità stickshift, non transizione a passenger.

source: If you want to allow samba to create new home directories (e.g. via PAM)
es: Si quiere permitir a samba crear nuevas carpetas de usuario (p. ej, mediante PAM)
fr: Si vous souhaitez autoriser samba à créer de nouveaux répertoires utilisateurs (par ex. via PAM)
it: Se si desidera consentire a samba di creare nuove cartelle home (es. tramite PAM)

source: If you want to allow virtual processes to run as userdomains
fr: Si vous souhaitez autoriser les processus virtuels à s'exécuter en tant qu'utilisateurs du domaine
it: Se si desidera permettere ai processi virtuali di eseguirsi come userdomains

source: If you want to determine whether calling user domains can execute Git daemon in the git_session_t domain.
es: Si quiere determinar si los dominios del usuario que hace la llamada pueden ejecutar el demonio Git en el dominio git_session_t.
fr: Si vous souhaitez déterminer si les domaines utilisateurs appelants peuvent exécuter le démon Git dans le domaine git_session_t.
it: Se si desidera determinare se i domini utente chiamanti possono eseguire il demone Git nel dominio git_session_t.

source: If you want to determine whether zabbix can connect to all TCP ports
es: Si quiere comprobar si zabbix puede conectarse a todos los puertos TCP.
fr: Si vous souhaitez déterminer si zabbix peut se connecter sur tous les ports TCP.
it: Se si desidera determinare se zabbix può connettersi a tutte le porte TCP

source: If you want to determine whether fenced can use ssh.
es: Si quiere comprobar si fenced puede usar ssh.
fr: Si vous souhaitez déterminer si fenced peut utiliser ssh.
it: Se si desidera determinare se fenced può utilizzare ssh.

source: If you want to allow ZoneMinder to run su/sudo.
es: Si quiere permitir a ZoneMinder ejecutar su/sudo
fr: Si vous souhaitez autoriser ZoneMinder à exécuter su/sudo.
it: Se si desidera permettere a ZoneMinder di eseguire su/sudo.

source: If you want to allow httpd to read home directories
es: Si quiere permitir a httpd leer las carpetas de usuario
fr: Si vous souhaitez autoriser httpd à lire les répertoires utilisateurs
it: Se si desidera consentire a httpd di leggere le cartelle home

source: If you want to allow gpg web domain to modify public files used for public file transfer services.
es: Si quiere permitir a los dominios web gpg modificar los archivos públicos utilizados por servicios de transferencia de archivos públicos.
fr: Si vous souhaitez autoriser le domaine web gpg à modifier les fichiers publics utilisés pour les services de transfert de fichiers publics.
it: Se si desidera consentire ai domini web gpg di modificare file pubblici usati per i servizi di trasferimento di file pubblici.

source: If you want to allow rsync to export any files/directories read only.
es: Si quiere permitir a rsync exportar cualquier archivos/carpetas de solo lectura.
fr: Si vous souhaitez autoriser rsync à exporter tout fichier/répertoire accessible en lecture seule.
it: Se si desidera consentire a rsync di esportare qualsiasi file/cartella di sola lettura.

source: If you want to allow regular users direct dri device access
es: Si quiere permitir a los usuarios regulares el acceso directo a dispositivos dri
fr: Si vous souhaitez autoriser l'accès direct des utilisateurs normaux au périphérique dri
it: Se si desidera consentire agli utenti regolari l'accesso diretto ai dispositivi dri

source: If you want to allow nfs servers to modify public files used for public file transfer services. Files/Directories must be labeled public_content_rw_t.
es: Si quiere permitir a los servidores nfs modificar los archivos públicos utilizados por los servicios de transferencia de archivos públicos. Los archivos/carpetas deben estar etiquetados como public_content_rw_t.
fr: Si vous souhaitez autoriser les serveurs nfs à modifier les fichiers publics utilisés pour les services de transfert de fichiers publics. Les fichiers ou répertoires doivent être étiquetés public_content_rw_t.
it: Se si desidera consentire ai server nfs di modificare file pubblici usati per il servizio di trasferimento di file pubblici. I file/cartelle devono essere etichettati public_content_rw_t.

source: If you want to allow mysqld to connect to all ports
es: Si quiere permitir a mysqld conectarse a todos los puertos
fr: Si vous souhaitez autoriser mysqld à se connecter à tous les ports
it: Se si desidera consentire a mysqld di connettersi al tutte le porte

source: If you want to determine whether Polipo session daemon can bind tcp sockets to all unreserved ports.
es: Si quiere comprobar si el demonio de sesión de Pólipo puede enlazarse a sockets tcp en todos los puertos no reservados.
fr: Si vous souhaitez déterminer si le démon de session Polipo peut lier les sockets tcp à tous les ports non-réservés.
it: Se si desidera determinare se il demone di sessione Polipo può legarsi ai socket TCP di tutte le porte non usate.

source: If you want to allow qemu to use serial/parallel communication ports
es: Si quiere permitir a qemu utilizar puertos seriales/paralelos de comunicación
fr: Si vous souhaitez autoriser qemu à utiliser les ports de communication série/parallèles
it: Se si desidera consentire a qemu di usare porte di comunicazione seriali/parallele

source: If you want to allow Apache to communicate with avahi service via dbus
es: Si quiere permitir a Apache comunicarse con el servicio avahi por medio de dbus
fr: Si vous souhaitez autoriser Apache à communiquer avec le service avahi via dbus
it: Se si desidera consentire ad Apache di comunicare con il servizio avahi tramite dbus

source: If you want to allow ftpd to use ntfs/fusefs volumes.
es: Si quiere permitir a ftpd usar volumenes ntfs/fusefs.
fr: Si vous souhaitez autoriser ftpd à utiliser des volumes ntfs/fusefs.
it: Se si desidera permettere a ftpd di utilizzare i volumi ntfs/fusefs.

source: If you want to allow sanlock to read/write fuse files
es: Si quiere permitir a sanlock leer/escribir archivos fuse
fr: Si vous souhaitez autoriser sanlock à accéder en lecture/écriture aux fichiers fuse
it: Se si desidera permettere a sanlock di leggere/scrivere i file fuse

source: If you want to allow rsync server to manage all files/directories on the system.
es: Si quiere permitir al servidor rsync administrar todos los ficheros/carpetas del sistema.
fr: Si vous souhaitez autoriser rsync à gérer tous les fichiers ou répertoires sur le système.
it: Se si desidera permettere al server rsync di gestire tutti i file/cartelle nel sistema.

source: If you want to allow user to use ssh chroot environment.
fr: Si vous souhaitez autoriser les utilisateurs à utiliser les environnements chroot de ssh.
it: Se si desidera permettere all'utente di utilizzare l'ambiente chroot ssh.

source: If you want to determine whether Cobbler can connect to the network using TCP.
es: Si quiere comprobar si Cobbler puede conectarse a la red usando TCP.
fr: Si vous souhaitez déterminer si Cobbler peut se connecter au réseau en utilisant TCP.
it: Se si desidera determinare se Cobbler può connettersi alla rete utilizzando TCP.

source: If you want to deny user domains applications to map a memory region as both executable and writable, this is dangerous and the executable should be reported in bugzilla
es: Si quiere impedir a las aplicaciones de dominio de usuario mapear una región de memoria como escribible y ejecutable, ésto es peligroso y debería informarse acerca del ejecutable en bugzilla
fr: Si vous souhaitez interdire aux applications des domaines d'utilisateurs de faire correspondre une région de la mémoire comme étant à la fois accessible en écriture et exécutable, ceci est dangereux et l'exécutable devrait être rapporté sur Bugzilla
it: Se si desidera impedire alle applicazioni dei domini utente di mappare una regione di memoria sia come eseguibile che scrivibile, l'operazione è pericolosa e l'eseguibile dovrebbe essere riportato in bugzilla

source: If you want to determine whether squid can run as a transparent proxy.
es: Si quiere comprobar si squid puede ejecutarse como un proxy transparente.
fr: Si vous souhaitez déterminer si squid peut fonctionner comme un mandataire transparent.
it: Se si desidera consentire a squid l'esecuzione come un proxy trasparente.

source: If you want to allow users to connect to the local mysql server
es: Si quiere permitir a los usuarios se conectarse al servidor local mysql
fr: Si vous souhaitez autoriser les utilisateurs à se connecter au serveur local mysql
it: Se si desidera consentire agli utenti di connettersi al server mysql locale

source: If you want to determine whether ftpd can login to local users and can read and write all files on the system, governed by DAC.
es: Si quiere comprobar si ftpd puede iniciar sesión a los usuarios locales y puede leer y escribir todos los archivos del sistema, gobernado por DAC.
fr: Si vous souhaitez déterminer si sftpd peut se connecter aux utilisateurs locaux et lire ou écrire tous les fichiers du système, gouverné par le contrôle d'accès discrétionnaire.
it: Se si desidera determinare se ftpd può effettuare il login su utenti locali e leggere e scrivere tutti i file nel sistema, governato da DAC.

source: If you want to allows XServer to execute writable memory
es: Si quiere permitir al servidor X ejecutar memoria escribible
fr: Si vous souhaitez autoriser XServer à exécuter la mémoire accessible en écriture
it: Se si desidera consentire ai server X di eseguire memoria scrivibile

source: If you want to allow glusterfsd to share any file/directory read/write.
es: Si quiere permitir a glusterfsd compartir cualquier archivo/carpeta con permisos de lectura/escritura.
fr: Si vous souhaitez autoriser glusterfsd à partager n'importe quel fichier/répertoire accessible en lecture/écriture.
it: Se si desidera permettere a glusterfsd di condividere un qualsiasi file/cartella in lettura/scrittura.

source: If you want to boolean to determine whether the system permits loading policy, setting enforcing mode, and changing boolean values. Set this to true and you have to reboot to set it back.
es: Si quiere indicar si el sistema permitirá cargar la política, poniéndose en modo obediente y el cambio de valores booleanos. Si lo pone en verdadero, para volver atrás deberá reiniciar la computadora.
fr: Si vous souhaitez permettre le choix via un booléen de déterminer si les domaines confinés peuvent charger une stratégie, d'activer le mode « application », et de modifier les valeurs booléennes. Après activation, vous devrez redémarrer pour le remodifier.
it: Se si desidera che il booleano determini quando il sistema permette di caricare la politica, impostando la modalità enforcing, e modificando i valori booleani. Impostando il valore a true sarà necessario riavviare per tornare indietro.

source: If you want to allow confined virtual guests to interact with rawip sockets
es: Si quiere permitir a los invitados virtuales confinados interactuar con sockets rawip
fr: Si vous souhaitez autoriser les invités virtuels confinés à interagir avec des sockets IP brutes
it: Se si desidera permettere ai guest virtuali confinati di interagire con i socket rawip

source: If you want to determine whether dbadm can manage generic user files.
es: Si quiere comprobar si dbadm puede administrar archivos de usuario genéricos.
fr: Si vous souhaitez déterminer si dbadm peut gérer les fichiers utilisateurs génériques.
it: Se si desidera determinare se dbadm può gestire i file dell'utente generico.

source: If you want to allow ABRT to run in abrt_handle_event_t domain to handle ABRT event scripts
es: Si quiere permitir a ABRT ejecutarse en el dominio abrt_handle_event_t para manejar guiones de evento ABRT
fr: Si vous souhaitez autoriser ABRT à être exécuté dans le domaine abrt_handle_event_t pour gérer les scripts d'événements ABRT
it: Se si desidera consentire a ABRT l'esecuzione in un dominio abrt_handle_event_t per gestire script di eventi ABRT

source: If you want to allow all domains to execute in fips_mode
es: Si quiere permitir a todos los dominios ejecutarse en fips_mode
fr: Si vous souhaitez autoriser tous les domaines à s'exécuter dans le mode fips_mode
it: Se si desidera permettere che tutti i domini si eseguano in fips_mode

source: If you want to allow sge to connect to the network using any TCP port
es: Si quiere permitir a sge conectarse a la red usando cualquier puerto TCP
fr: Si vous souhaitez autoriser sge à se connecter au réseau en utilisant tout port TCP.
it: Se si desidera permettere a sge di collegarsi alla rete usando qualsiasi porta TCP

source: If you want to determine whether Git system daemon can access nfs file systems.
es: Si quiere determinar si el demonio del sistema Git puede acceder sistemas de archivo nfs.
fr: Si vous souhaitez déterminer si le démon système Git peut accéder aux systèmes de fichiers nfs.
it: Se si desidera determinare se il demone del sistema Git può accedere ai file system nfs.

source: If you want to unify HTTPD handling of all content files.
es: Si quiere unificar el manejo de HTTPD de todos los archivos de contenido.
fr: Si vous souhaitez unifier la gestion HTTPD de tous les fichiers de contenu.
it: Se si desidera unificare la gestione di HTTPD di tutti i file di contenuto.

source: If you want to allow nsplugin code to connect to unreserved ports
es: Si quiere permitir que código nsplugin pueda conectarse con puertos no reservados
fr: Si vous souhaitez autoriser le code nsplugin à se connecter aux ports non-réservés
it: Se si desidera consentire al codice nsplugin di connettersi alle porte non utilizzate

source: If you want to determine whether amavis can use JIT compiler.
es: Si quiere comprobar si amavis puede usar un compilador JIT.
fr: Si vous souhaitez déterminer si amavis peut utiliser le compilateur JIT.
it: Se si desidera determinare se amavis può utilizzare JIT compiler.

source: If you want to determine whether java can make its stack executable.
es: Si quiere comprobar si java puede hacer su pila ejecutable.
fr: Si vous souhaitez déterminer si java peut rendre sa pile exécutable.
it: Se si desidera determinare se java può rendere il proprio stack eseguibile.

source: If you want to determine whether irc clients can listen on and connect to any unreserved TCP ports.
es: Si quiere comprobar si los clientes irc pueden escuchar y conectarse a cualquier puerto TCP no reservado.
fr: Si vous souhaitez déterminer si les clients IRC peuvent écouter ou se connecteur à tout port non-réservé.
it: Se si desiderea determinare se i client irc possono ascoltare e connettersi ad una qualsiasi porta TCP disponibile.

source: If you want to allow database admins to execute DML statement
es: Si quiere permitir a los administradores de bases de datos ejecutar órdenes DML
fr: Si vous souhaitez autoriser les administrateurs de bases de données à exécuter des instructions DML
it: Se si desidera consentire agli amministratori di database di eseguire degli statement DML

source: If you want to allow openvpn to run unconfined scripts
es: Si quiere permitir a openvpn ejecutar scrips no confinados
fr: Si vous souhaitez autoriser openvpn à exécuter des scripts non-confinés
it: Se si desidera permettere a openvpn di eseguire gli script non confinati

source: If you want to allow Apache to use mod_auth_pam
es: Si quiere permitir a Apache usar mod_auth_pam
fr: Si vous souhaitez autoriser Apache à utiliser mod_auth_pam
it: Se si desidera consentire ad Apache di usare mod_auth_pam

source: If you want to allow confined virtual guests to interact with the xserver
es: Si quiere permitir a los invitados virtuales confinados interactúar con el xserver
fr: Si vous souhaitez autoriser les invités virtuels confinés à interagir avec le serveur X
it: Se si desidera consentire ai guest virtuali confinati di interagire con xserver

source: If you want to allow HTTPD scripts and modules to connect to the network using TCP.
es: Si quiere permitirle a los scripts y módulos de HTTPD conectarse a la red usando TCP.
fr: Si vous souhaitez autoriser les scripts et modules HTTPD à se connecter au réseau à l'aide de TCP.
it: Se si desidera permettere agli script e ai moduli HTTPD di connettersi alla rete usando TCP.

source: If you want to allow qemu to use usb devices
es: Si quiere permitir a qemu usar los dispositivos usb
fr: Si vous souhaitez autoriser qemu à utiliser des périphériques USB
it: Se si desidera consentire a qemu di usare i dispositivi usb

source: If you want to determine whether exim can connect to databases.
es: Si quiere comprobar si exim puede conectarse a las bases de datos.
fr: Si vous souhaitez déterminer si exim peut se connecter à des bases de données.
it: Se si desidera determinare se exim può connettersi ai database.

source: If you want to determine whether Git CGI can access nfs file systems.
es: Si quiere determinar si el CGI de Git puede acceder a sistemas de archivos nfs.
fr: Si vous souhaitez déterminer si le CGI Git peut accéder aux systèmes de fichiers nfs.
it: Se si desidera determinare se Git CGI può accedere ai file system nfs.

source: If you want to determine whether varnishd can use the full TCP network.
es: Si quiere comprobar si varnishd puede usar toda la red TCP.
fr: Si vous souhaitez déterminer si varnishd peut utiliser le réseau TCP complet.
it: Se si desidera determinare se varnishd può utilizzare l'intera rete TCP.

source: If you want to allow tftp to read and write files in the user home directories
es: Si quiere permitir a tftp leer y escribir en las carpetas de usuario
fr: Si vous souhaitez autoriser tftp à accéder aux fichiers en lecture et en écriture dans les répertoires utilisateurs
it: Se si desidera permettere a tftp di leggere e scrivere file nelle cartelle home degli utenti

source: If you want to support ecryptfs home directories
es: Si quiere dar soporte a carpetas de usuario sobre ecryptfs
fr: Si vous souhaitez prendre en charge les répertoires utilisateurs ecryptfs
it: Se si desidera il supporto delle home directory ecryptfs

source: If you want to allow samba to act as a portmapper
es: Si quiere permitirle a samba actuar como un portmapper
fr: Si vous souhaitez autoriser samba à agir en tant que portmapper
it: Se si desidera permettere a samba di agire come un portmapper

source: If you want to allow httpd scripts and modules execmem/execstack
es: Si quiere permitir a los guiones y módulos httpd execmem/execstack
fr: Si vous souhaitez autoriser les scripts et modules httpd execmem/execstack
it: Se si desidera consentire agli script e ai moduli httpd di execmem/execstack

source: If you want to allow httpd to access FUSE file systems
es: Si quiere permitir a httpd el acceso a sistemas de archivo FUSE
fr: Si vous souhaitez autoriser httpd à accéder aux systèmes de fichiers FUSE
it: Se si desidera permettere a httpd di accedere ai file system FUSE

source: If you want to allow httpd to connect to the ldap port
es: Si quiere permitir a httpd conectarse al puerto ldap
fr: Si vous souhaitez autoriser httpd à se connecter au port ldap
it: Se si desidera consentire a httpd di connettersi alla porta ldap

source: If you want to enable polyinstantiated directory support.
es: Si quiere activar el soporte para carpetas poli-instanciadas.
fr: Si vous souhaitez activer la prise en charge de répertoires multi-instances.
it: Se si desidera abilitare il supporto alle cartelle polyinstantiated.

source: If you want to allow cluster administrative cluster domains memcheck-amd64- to use executable memory
es: Si quiere permitir a los dominios administrativos de clúster memcheck-amd64- usar memoria ejecutable.
fr: Si vous souhaitez autoriser les domaines administratifs de cluster memcheck-amd64- à utiliser la mémoire exécutable
it: Se si desidera permettere ai domini amministrativi del cluster memcheck-amd64- di utilizzare la memoria eseguibile

source: If you want to allow logging in and using the system from /dev/console.
es: Si quiere permitir iniciar sesión y utilizar el sistema desde /dev/console.
fr: Si vous souhaitez autoriser la connexion et l'utilisation du système depuis /dev/console.
it: Se si desidera consentire l'accesso e l'utilizzo del sistema da /dev/console.

source: If you want to allow Apache to use mod_auth_ntlm_winbind
es: Si quiere permitir a Apache utilizar mod_auth_ntlm_winbind
fr: Si vous souhaitez autoriser Apache à utiliser mod_auth_ntlm_winbind
it: Se si desidera consentire a Apache di usare mod_auth_ntlm_winbind

source: If you want to allow the graphical login program to execute bootloader
es: Si quiere permitir al programa gráfico de inicio de sesión ejecutar el gestor de arranque
fr: Si vous souhaitez autoriser le programme de connexion graphique à exécuter le chargeur d'amorçage
it: Se si desidera consentire al programma di accesso grafico di eseguire bootloader

source: If you want to allow samba to share users home directories.
es: Si quiere permitir a samba compartir las carpetas de usuario.
fr: Si vous souhaitez autoriser samba à partager les répertoires utilisateurs.
it: Se si desidera consentire a samba di condividere le cartelle home.

source: If you want to allow qemu to connect fully to the network
es: Si quiere permitir a qemu conectarse completamente a la red
fr: Si vous souhaitez autoriser qemu à se connecter entièrement au réseau
it: Se si desidera consentire a qemu di connettersi completamente alla rete
