Repository: Justasic/setroubleshoot
Catalog: plugins/po/*.po
Languages: es, fr, it

source: Your system may be seriously compromised! $SOURCE_PATH tried to modify kernel configuration.
es: ¡Su sistema puede estar seriamente comprometido! $SOURCE_PATH intentó modificar la configuración del kernel.
fr: Votre système peut être sérieusement compromis ! $SOURCE_PATH a essayé de modifier la configuration de votre noyau.
it: Il sistema potrebbe essere seriamente compromesso! $SOURCE_PATH ha cercato di modificare la configurazione del kernel.

source: SELinux has prevented $SOURCE from modifying $TARGET. This denial indicates $SOURCE was trying to modify the way the kernel runs or to actually insert code into the kernel. All applications that need this access should have already had policy written for them. If a compromised application tries to modify the kernel this AVC will be generated. This is a serious issue. Your system may very well be compromised.
es: SELinux impidió a $SOURCE modificar $TARGET. Esta denegación indica que $SOURCE estaba intentando modificar la forma en que se ejecuta el kernel, o que en realidad estaba intentando insertar código en él Todas las aplicaciones que necesiten este acceso deberían tener alguna política definida para ello. Si una aplicación comprometida trata de modificar el kernel, se genera este AVC. Este es un problema serio. Su sistema puede estar comprometido.
fr: SELinux a empêché $SOURCE de modifier $TARGET. Ce déni signifie que $SOURCE a essayé de modifier la façon dont le noyau fonctionne ou a essayé d'insérer du code dans le noyau. Toutes les applications nécessitant cet accès devraient déjà avoir une stratégie de sécurité définie. Si une application compromise essaie de modifier le noyau, cet AVC (Access Vector Cache, message d'alerte de sécurité) sera affiché. Ceci un est problème sérieux. Votre système pourrait très bien être compromis.
it: SELinux ha prevenuto la modifica di $TARGET da parte di $SOURCE. Questo divieto indica che $SOURCE stava tentando di modificare il modo in cui si esegue il kernel o di inserire attualmente del codice nel kernel. Tutte le applicazioni che hanno bisogno di questo accesso dovrebbero avere già una politica per questo. Se una applicazione compromessa tenta di modificare il kernel verrà generato questo AVC. Questa è una questione seria. Il sistema potrebbe essere molto compromesso

source: you do not think $SOURCE_BASE_PATH should try $ACCESS access on $TARGET_BASE_PATH.
es: no cree que $SOURCE_BASE_PATH deba intentar acceso $ACCESS sobre $TARGET_BASE_PATH.
fr: vous pensez que $SOURCE_BASE_PATH ne devrait pas tenter l'accès $ACCESS sur $TARGET_BASE_PATH.
it: non si crede che $SOURCE_BASE_PATH dovrebbe provare ad accedere $ACCESS su $TARGET_BASE_PATH.

source: you may be under attack by a hacker, since confined applications should not need this access.
es: podría estar siendo víctima de un ataque, ya que las aplicaciones confinadas no deberían necesitar este tipo de acceso.
fr: vous pourriez être la cible d'une attaque d'un hacker car les applications confinées ne devraient pas nécessiter cet accès.
it: si potrebbe essere sotto attacco da un hacker, dal momento che le applicazioni confinate non dovrebbero richiedere questo accesso.

source: SELinux is preventing $SOURCE_PATH access to a leaked $TARGET_PATH file descriptor.
es: SELinux está impidiendo a $SOURCE_PATH acceder a un descriptor de archivo de $TARGET_PATH filtrado.
fr: SELinux empêche $SOURCE_PATH d'accéder au descripteur de fichier compromis $TARGET_PATH.
it: SELinux impedisce l'accesso $SOURCE_PATH ad un file descrittore difettoso $TARGET_PATH.

source: SELinux denied access requested by the $SOURCE command. It looks like this is either a leaked descriptor or $SOURCE output was redirected to a file it is not allowed to access. Leaks usually can be ignored since SELinux is just closing the leak and reporting the error. The application does not use the descriptor, so it will run properly. If this is a redirection, you will not get output in the $TARGET_PATH. You should generate a bugzilla on selinux-policy, and it will get routed to the appropriate package. You can safely ignore this avc.
es: SELinux impidió el acceso solicitado por el comando $SOURCE. Parece que éste es un descriptor de archivo filtrado o la salida de $SOURCE fue redirigida a un archivo sobre el cual no tiene acceso. Los filtros usualmente son ignorados dado que SELinux simplemente los cierra e informa del error. La aplicación no usa el descriptor, por lo que funcionará apropiadamente. Si esta es una redirección, no obtendrá la salida en $TARGET_PATH. Debe generar un informe en bugzilla sobre selinux-policy, y será enviado al paquete apropiado. Puede ignorar sin problemas este avc.
fr: SELinux a refusé l'accès requis par la commande $SOURCE. Il se pourrait que ce soit un descripteur « fuité» ou bien que la sortie de $SOURCE soit redirigée vers un fichier interdit d'accès. Les fuites peuvent généralement être ignorées puisque SELinux referme ces fuites et rapporte l'erreur. L'application n'utilise pas le descripteur, il fonctionnera donc correctement. Si c'est une redirection, vous n'aurez pas de sortie dans $TARGET_PATH. Vous devriez signaler un bug à bugzilla sur selinux-policy et il sera redirigé vers le paquet approprié. Vous pouvez en toute sécurité ignorer ce message.
it: SELinux ha rifiutato l'accesso richiesto dal comando $SOURCE. Sembra che sia un descrittore difettoso oppure l'uscita di $SOURCE è stata reindirizzata ad un file a cui non è consentito accedere. I difetti normalmente possono essere ignorati fintanto che SELinux chiude il difetto e riporta l'errore. L'applicazione non usa il descrittore, quindi può essere eseguita correttamente. Se questo è un reindirizzamento, non verrà ricevuto output nel $TARGET_PATH. E' necessario generare un bugzilla su selinux-policy, che verrà instradato verso il pacchetto appropriato. E' possibile ignorare in sicurezza questo avc.

source: You can generate a local policy module to allow this access - see <a href="http://docs.fedoraproject.org/selinux-faq-fc5/#id2961385">FAQ</a>
es: Puede generar un módulo de política local para permitir este acceso. Vea <a href="http://docs.fedoraproject.org/selinux-faq-fc5/#id2961385">FAQ</a>
fr: Vous pouvez générer un module de stratégie de sécurité local afin d'autoriser cet accès - voir <a href=« http://docs.fedoraproject.org/selinux-faq-fc5/#id2961385« >FAQ</a>
it: E' possibile generare un modulo di politica locale per consentire questo accesso - consultare le <a href="http://docs.fedoraproject.org/selinux-faq-fc5/#id2961385">FAQ</a>

source: you want to ignore $SOURCE_BASE_PATH trying to $ACCESS access the $TARGET_BASE_PATH $TARGET_CLASS, because you believe it should not need this access.
es: quiere ignorar $SOURCE_BASE_PATH intentando que $ACCESS acceda al $TARGET_BASE_PATH $TARGET_CLASS, debido a que considera que no debería necesitar este acceso.
fr: vous souhaitez ignorer que $SOURCE_BASE_PATH tente d'obtenir l'accès $ACCESS à $TARGET_BASE_PATH $TARGET_CLASS car vous pensez qu'il ne devrait pas nécessiter cet accès.
it: si desidera ignorare che $SOURCE_BASE_PATH tenti l'accesso $ACCESS su $TARGET_BASE_PATH $TARGET_CLASS, siccome si crede che non dovrebbe richiedere tale accesso.

source: You should report this as a bug. You can generate a local policy module to dontaudit this access.
es: Debería reportar esto como un error. Puede generar un módulo de política local para no auditar este acceso.
fr: Vous devriez rapporter ceci en tant qu'anomalie. Vous pouvez générer un module de stratégie local pour dontaudit cet accès.
it: Si dovrebbe riportare il problema come bug. E' possibile generare un modulo di politica locale per consentire questo accesso.

source: Your system may be seriously compromised! $SOURCE_PATH attempted to mmap low kernel memory.
es: ¡Su sistema puede estar seriamente comprometido! $SOURCE_PATH intentó nmap la memoria baja del kernel.
fr: Votre système peut être sérieusement compromis ! $SOURCE_PATH a essayé d'allouer via mmap de la mémoire basse du noyau.
it: Il sistema potrebbe essere seriamente compromesso! $SOURCE_PATH ha cercato di mappare la memoria bassa del kernel.

source: SELinux has denied the $SOURCE the ability to mmap low area of the kernel address space. The ability to mmap a low area of the address space, as configured by /proc/sys/kernel/mmap_min_addr. Preventing such mappings helps protect against exploiting null deref bugs in the kernel. All applications that need this access should have already had policy written for them. If a compromised application tries modify the kernel this AVC would be generated. This is a serious issue. Your system may very well be compromised.
es: SELinux impidió a $SOURCE mapear un área inferior del espacio de direcciones del kernel. La posibilidad de realizar esta acción está configurada en /proc/sys/kernel/mmap_min_addr. Prevenir estas asignaciones ayuda a protegerse contra errores de derreferencia de punteros nulos en el kernel. Todas las aplicaciones que necesiten este acceso, deberían tener alguna política definida para ello. Si una aplicación comprometida intenta modificar el kernel, se generará este AVC. Éste es un problema serio. Su sistema puede estar comprometido.
fr: SELinux a refusé à $SOURCE la capacité d'allouer de l'espace dans la zone mémoire basse du noyau via mmap. La capacité d'allouer cet espace mémoire est configuré par /proc/sys/kernel/mmap_min_addr. Empêcher cette allocation mémoire aide à se protéger contre l'exploitation des bugs du noyau de type 'null deref'. Toutes les applications ayant besoin de cet accès devraient déjà avoir une stratégie de sécurité écrite. Si une application compromise essaie de modifier le noyau, ce message pourrait être généré. Ceci est un problème sérieux. Votre système pourrait très bien être compromis.
it: SELinux ha negato a $SOURCE la possibilità di eseguire mmap sull'area bassa degli spazi di indirizzo del kernel. L'abilità di eseguire mmap su una area bassa dello spazio degli indirizzi, come configurato da /proc/sys/kernel/mmap_min_addr. Prevenendo questa mappatura si aiuta la protezione contro l'esplorazione dei bug di null deref nel kernel. Tutte le applicazioni che hanno bisogno di questo accesso dovrebbero avere già una politica scritta. Se una applicazione compromessa tenta di modificare il kernel verrà generato questo AVC. Questa è una questione seria. Il sistema potrebbe essere seriamente compromesso.

source: you do not think $SOURCE_PATH should need to mmap low memory in the kernel.
es: no cree que $SOURCE_PATH debería necesitar realizar un mmap sobre la baja memoria en el kernel.
fr: vous pensez que $SOURCE_PATH ne devrait pas effectuer de projection en mémoire (« mmap ») de la mémoire basse dans le noyau.
it: non si pensa che $SOURCE_PATH debba richiedere mmap di memoria bassa nel kernel.

source: you may be under attack by a hacker, this is a very dangerous access.
es: podría estar siendo víctima de un ataque, este es un acceso muy peligroso.
fr: vous pourriez être victime d'une attaque d'un pirate, cet accès est très dangereux.
it: si potrebbe essere sotto attacco hacker, questo è un accesso molto pericoloso.

source: SELinux prevented $SOURCE from mounting on the file or directory "$TARGET_PATH" (type "$TARGET_TYPE").
es: SELinux impidió a $SOURCE montar sobre el archivo o carpeta "$TARGET_PATH" (tipo "$TARGET_TYPE").
fr: SELinux a empêché $SOURCE de monter le fichier ou répertoire « $TARGET_PATH » (type « $TARGET_TYPE »).
it: SELinux ha evitato che $SOURCE montasse il file o cartella "$TARGET_PATH" (tipo "$TARGET_TYPE").

source: SELinux prevented $SOURCE from mounting a filesystem on the file or directory "$TARGET_PATH" of type "$TARGET_TYPE". By default SELinux limits the mounting of filesystems to only some files or directories (those with types that have the mountpoint attribute). The type "$TARGET_TYPE" does not have this attribute. You can change the label of the file or directory.
es: SELinux impidió a $SOURCE montar un sistema de archivos sobre el archivo o carpeta "$TARGET_PATH" del tipo "$TARGET_TYPE". Por defecto, SELinux limita el montaje de sistemas de archivo sólo a algunos archivos o carpetas (aquellos con tipos con el atributo de punto de montaje). El tipo "$TARGET_TYPE" no tiene este atributo. Puede cambiar la etiqueta del archivo o carpeta.
fr: SELinux a empêché $SOURCE de monter un système de fichiers sur le fichier ou répertoire « $TARGET_PATH » de type « $TARGET_TYPE ». Par défaut SELinux limite le montage de systèmes de fichiers à seulement quelques fichiers ou répertoires (ceux avec les types qui possèdent l'attribut point de montage). Le type « $TARGET_TYPE » n'a pas cet attribut. Vous pouvez changer l'étiquetage du fichier ou du répertoire.
it: SELinux ha impedito a $SOURCE di montare un filesystem sul file o cartella "$TARGET_PATH" di tipo "$TARGET_TYPE". In modo predefinito SELinux limita il montaggio dei filesystem solo ad alcuni file o cartelle (quelli che contengono gli attributi di mountpoint). Il tipo "$TARGET_TYPE" non possiede questo tipo di attributi. È possibile modificare l'etichetta del file o della cartella.

source: Changing the file_context to mnt_t will allow mount to mount the file system: "chcon -t mnt_t '$TARGET_PATH'." You must also change the default file context files on the system in order to preserve them even on a full relabel. "semanage fcontext -a -t mnt_t '$FIX_TARGET_PATH'"
es: Modificar el contexto a mnt_t permitirá el montaje del sistema de archivo: "chcon -t mnt_t '$TARGET_PATH'." También debe cambiar el archivo predeterminado de contexto de archivos en el sistema, para preservarlos aún cuando realice un reetiquetado completo. "semanage fcontext -a -t mnt_t '$FIX_TARGET_PATH'"
fr: Changer le contexte du fichier à mnt_t autorisera mount à monter le système de fichier : « chcon -t mnt_t '$TARGET_PATH'. » Vous devez aussi changer le dossier par défaut des fichiers de contexte de votre système, même lors d'un réétiquetage complet, de manière à les préserver. « semanage fcontext -a -t mnt_t '$FIX_TARGET_PATH' »
it: Cambiando file_context in mnt_t sarà possibile montare il filesystem: "chcon -t mnt_t '$TARGET_PATH'." Inoltre, è necessario modificare il file contesto predefinito dei file sul sistema per preservarli anche da una completa rietichettatura. "semanage fcontext -a -t mnt_t '$FIX_TARGET_PATH'"

source: you want to allow $SOURCE_BASE_PATH to mount on $TARGET_BASE_PATH.
es: quiere permitir que $SOURCE_BASE_PATH sea montado en $TARGET_BASE_PATH.
fr: vous souhaitez autoriser à $SOURCE_BASE_PATH d'être monté sur $TARGET_BASE_PATH.
it: si desidera consentire a $SOURCE_BASE_PATH di montare su $TARGET_BASE_PATH.

source: you must change the labeling on $TARGET_PATH.
es: debe modificar el etiquetado sobre $TARGET_PATH.
fr: vous devez modifier l'étiquette de $TARGET_PATH.
it: è necessario modificare l'etichettatura su $TARGET_PATH.

source: SELinux denied access requested by $SOURCE. It is not expected that this access is required by $SOURCE and this access may signal an intrusion attempt. It is also possible that the specific version or configuration of the application is causing it to require additional access. mozplugger and spice-xpi run applications within mozilla-plugins that require access to the desktop, that the mozilla_plugin lockdown will not allow, so either you need to turn off the mozilla_plugin lockdown or not use these packages.
es: SELinux impidió el acceso solicitado por $SOURCE. No se esperaba que esta acceso fuera solicitado por $SOURCE y ésto podría indica un intento de ataque. Es posible que la versión o la configuración específica de la aplicación esté causando este requerimiento de acceso adicional. mozplugger y spice-xpi ejecutan aplicaciones dentro de mozilla-plugins que requieren acceso al escritorio, que el bloqueo de mozilla_plugin no permitirá, así que tendrá que desactivar el bloqueo de mozilla_plugin o no utilizar estos paquetes.
fr: SELinux a refusé l'accès demandé par $SOURCE. Il n'est pas prévu que cet accès soit requis par $SOURCE et cet accès peut signaler une tentative d'intrusion. Il est également possible que cette version ou cette configuration spécifique de l'application provoque cette demande d'accès supplémentaire. mozplugger et spice-xpi lancent des applications depuis mozilla-plugins qui requièrent l'accès au bureau, ce que le confinement de mozilla_plugin ne permet pas. Vous devez donc soit ne plus confiner mozilla_plugin, soit ne pas utiliser ces paquets.
it: SELinux ha rifiutato l'accesso richiesto da $SOURCE. Non è previsto che questo accesso venga richiesto da $SOURCE e questo accesso potrebbe segnalare un tentativo d'intrusione. E' inoltre possibile che la versione specifica o la configurazione dell'applicazione stia causando ciò per richiedere un accesso ulteriore. mozplugger e spice-xpi eseguono applicazioni dentro i mozilla-plugins che richiedono l'accesso al desktop, che il blocco di mozilla_plugin non permette, così è necessario o disattivare il blocco di mozilla_plugin o non usare questi pacchetti.

source: Either remove the mozplugger or spice-xpi package by executing 'yum remove mozplugger spice-xpi' Or turn off enforcement of SELinux over the Firefox plugins. setsebool -P unconfined_mozilla_plugin_transition 0
es: Bien borre el mozplugger o el paquete spice-xpi ejecutando 'yum remove mozplugger spice-xpi. O quite la aplicación de SELinux sobre los plugins Firefox. setsebool -P unconfined_chrome_sandbox_transition 0
fr: Soit vous retirez les paquets mozplugger et spice-xpi en utilisant « yum remove mozplugger spice-xpi ». Soit arrêtez l'application de SELinux sur les greffons Firefox. setsebool -P unconfined_mozilla_plugin_transition 0
it: Rimuovere il mozplugger o il pacchetto spice-xpi eseguendo 'yum remove mozplugger spice-xpi' o disabilitare l'enforcement di SELinux sui plugin di Firefox. setsebool -P unconfined_mozilla_plugin_transition 0

source: you must turn off SELinux controls on the Firefox plugins.
es: debe deshabilitar los controles de SELinux en los complementos de Firefox.
fr: vous devez désactiver les contrôles SELinux sur les extensions Firefox.
it: disabilitare i controlli SELinux sui plugin di Firefox.

source: SELinux denied access requested by $SOURCE. It is not expected that this access is required by $SOURCE and this access may signal an intrusion attempt. It is also possible that the specific version or configuration of the application is causing it to require additional access.
es: SELinux impidió el acceso solicitado por $SOURCE. No se esperaba que este acceso fuera requerido por $SOURCE y ésto podría indicar un intento de ataque. También es posible que la versión específica o la configuración de la aplicación esté causando este requerimiento de acceso adicional.
fr: SELinux a refusé l'accès demandé par $SOURCE. Il n'est pas prévu que cet accès soit requis par $SOURCE et cet accès peut signaler une tentative d'intrusion. Il est également possible que cette version ou cette configuration spécifique de l'application provoque cette demande d'accès supplémentaire.
it: SELinux ha negato l'accesso richiesto da $SOURCE. Non è previsto che questo accesso venga richiesto da $SOURCE e tale operazione può segnalare un tentativo di intrusione. È anche possibile che questo sia provocato dalla specifica versione o dalla configurazione dell'applicazione per richiedere un ulteriore accesso.

source: Either remove the mozplluger package by executing 'yum remove mozplugger' Or turn off enforcement of SELinux over the Firefox plugins. setsebool -P unconfined_mozilla_plugin_transition 0
es: Elimine el paquete mozplugger ejecutando 'yum remove mozplugger' O deshabilite la obediencia de SELinux sobre los complementos de Firefox. setsebool -P unconfined_mozilla_plugin_transition 0
fr: Soit vous retirez le paquet mozplugger en utilisant « yum remove mozplugger ». Ou arrêtez l'application de SELinux sur les greffons Firefox. setsebool -P unconfined_mozilla_plugin_transition 0
it: Rimuovere il pacchetto mozplluger eseguendo 'yum remove mozplugger' Oppure disabilitare l'implementazione di SELinux sui plugin di Firefox. setsebool -P unconfined_mozilla_plugin_transition 0

source: you want to to continue using SELinux Firefox plugin containment rather then using mozplugger package
es: quiere continuar usando la contención de SELinux para complementos de Firefox en vez de usar el paquete mozplugger
fr: vous pouvez souhaiter continuer à utiliser le confinement de greffons Firefox de SELinux plutôt que d'utiliser le paquet mozplugger
it: continuare ad usare un plugin containment Firefox SELinux al posto del pacchetto mozplugger

source: you must remove the mozplugger package.
es: debe eliminar el paquete mozplugger.
fr: vous devez supprimer le paquet mozplugger.
it: rimuovere il pacchettp mozplugger.

source: SELinux denied access requested by $SOURCE. $TARGET_PATH may be a mislabeled. openvpn is allowed to read content in home directory if it is labeled correctly.
es: SELinux impidió el acceso solicitado por $SOURCE. $TARGET_PATH puede estar mal etiquetado. openvpn tiene permitido leer contenidos de la carpeta home, siempre que esté correctamente etiquetada.
fr: SELinux a refusé l'accès requis par $SOURCE. $TARGET_PATH peut être mal étiqueté. openvpn est autorisé à lire le contenu du répertoire utilisateur si celui-ci est correctement étiqueté.
it: SELinux ha rifiutato l'accesso richiesto da $SOURCE. $TARGET_PATH potrebbe avere una etichettatura sbagliata. openvpn è autorizzato a leggere il contenuto nella cartella home se etichettata correttamente.

source: You can restore the default system context to this file by executing the restorecon command. restorecon restore using restorecon -R /root/.ssh.
es: Puede restaurar el contexto predeterminado del sistema para este archivo ejecutando el comando restorecon. restorecon restaura utilizando restorecon -R /root/.ssh.
fr: Vous pouvez restaurer le contexte par défaut du système sur ce fichier en exécutant la commande restorecon. restorecon restaure en utilisant restorecon -R /root/.ssh.
it: È possibile ripristinare il contesto del sistema predefinito su questo file eseguendo il comando restorecon. ripristino utilizzando restorecon -R /root/.ssh.

source: you want to mv $TARGET_BASE_PATH to standard location so that $SOURCE_BASE_PATH can have $ACCESS access
es: quiere mover $TARGET_BASE_PATH a una ubicación estándar, de modo que $SOURCE_BASE_PATH pueda tener acceso $ACCESS
fr: vous souhaitez déplacer $TARGET_BASE_PATH sur un emplacement standard de manière à ce que $SOURCE_BASE_PATH puisse obtenir l'accès $ACCESS
it: si desidera spostare $TARGET_BASE_PATH nella posizione standard in modo che $SOURCE_BASE_PATH possa avere accesso $ACCESS

source: you want to modify the label on $TARGET_BASE_PATH so that $SOURCE_BASE_PATH can have $ACCESS access on it
es: quiere modificar la etiqueta en $TARGET_BASE_PATH de modo que $SOURCE_BASE_PATH pueda tener acceso $ACCESS sobre él
fr: vous souhaitez modifier l'étiquette de $TARGET_BASE_PATH afin que $SOURCE_BASE_PATH puisse y obtenir l'accès $ACCESS
it: si desidera modificare l'etichetta di $TARGET_BASE_PATH in modo che $SOURCE_BASE_PATH possa avere accesso $ACCESS su di esso

source: you must move the cert file to the ~/.cert directory
es: debe mover el archivo cert a la carpeta ~/.cert
fr: vous devez déplacer le fichier cert sur le répertoire ~/.cert
it: si deve spostare il file cert nella cartella ~/.cert

source: you must fix the labels.
es: debe arreglar las etiquetas.
fr: vous devez corriger les étiquettes.
it: bisogna sistemare le etichette.
