Repository: Justasic/setroubleshoot
Catalog: plugins/po/*.po
Languages: es, fr, it

source: If you want to allow xguest users to configure Network Manager and connect to apache ports
es: Si quiere permitir a los usuarios xguest configurar Network Manager y conectarse a los puertos de apache.
fr: Si vous souhaitez autoriser les utilisateurs xguest à configurer Network Manager et à se connecter aux ports apache
it: Se si desidera consentire agli utenti xguest di configurare il Network Manager e di connettersi alle porte apache

source: If you want to allow postgresql to use ssh and rsync for point-in-time recovery
es: Si quiere permitir a postgresql usar ssh y rsync para la recuperación de punto en el tiempo
fr: Si vous souhaitez autoriser postgresql à utiliser ssh et rsync pour la récupération à pointage dans le temps
it: Se si desidera permettere a postgresql di utilizzare ssh e rsync per il ripristino point-in-time

source: If you want to allow users to login using a radius server
es: Si quiere permitir a los usuarios registrarse utilizando un servidor radius
fr: Si vous souhaitez autoriser les utilisateurs à se connecter en utilisant un serveur radius
it: Se si desidera consentire agli utenti di effettuare l'accesso usando un server radius

source: If you want to allow the graphical login program to create files in HOME dirs as xdm_home_t.
es: Si quiere permitir al programa gráfico de inicio de sesión crear archivos en carpetas HOME como xdm_home_t.
fr: Si vous souhaitez autoriser le programme de connexion graphique à créer des fichiers dans les répertoires des utilisateurs en tant que xdm_home_t.
it: Se si desidera permettere al programma di login grafico di creare file nelle cartelle HOME come xdm_home_t.

source: If you want to allow tftp to modify public files used for public file transfer services.
es: Si quiere permitir a tftp que modifique archivos públicos utilizados para servicios de transferencia de archivos públicos.
fr: Si vous souhaitez autoriser tftp à modifier les fichiers publics utilisés pour les services de transfert de fichiers publics.
it: Se si desidera consentire a tftp di modificare file pubblici usati per servizi di trasferimento i file pubblici.

source: If you want to allow ZoneMinder to modify public files used for public file transfer services.
es: Si quiere que ZoneMinder modifique archivos públicos utilizados para tranferir servicios de archivos públicos.
fr: Si vous souhaitez autoriser ZoneMinder à modifier les fichiers publics utilisés pour les services de transfert de fichiers publics.
it: Se si desidera consentire a ZoneMinder di modificare file pubblici usati per servizi di trasferimento di file pubblici.

source: If you want to allow unconfined executables to make their heap memory executable. Doing this is a really bad idea. Probably indicates a badly coded executable, but could indicate an attack. This executable should be reported in bugzilla
es: Si quiere permitir que ejecutables no confinados conviertan a su porción de memoria ejecutable. Hacer esto realmente es una mala idea. Probablemente indique un ejecutable mal codificado, pero también podría indicar que está siendo víctima de un ataque. Este ejecutable debería ser reportado en bugzilla
fr: Si vous souhaitez autoriser les exécutables non-confinés à rendre leur mémoire de tas exécutable. Ceci est une mauvaise idée et indique un exécutable mal codé, mais peut aussi indiquer une attaque. Cet exécutable devrait être rapporté sur Bugzilla.
it: Se si desidera consentire agli eseguibili non confinati di rendere la propria memoria heap eseguibile. Questa operazione è davvero una cattiva idea. Probabilmente indica un eseguibile scritto male, ma potrebbe indicare un attacco. L'eseguibile andrebbe riportato su bugzilla

source: If you want to allow user spamassassin clients to use the network.
es: Si quiere permitir a los clientes de usuario de spamassassin utilizar la red.
fr: Si vous souhaitez autoriser les clients spamassassin à utiliser le réseau.
it: Se si desidera consentire ai client spamassassin di usare la rete.

source: If you want to allow glusterfsd to modify public files used for public file transfer services. Files/Directories must be labeled public_content_rw_t.
es: Si quiere permitir a glusterfsd modificar los archivos públicos utilizados por los servicios de transferencia pública de archivos. Los archivos/carpetas debe estar etiquetados con public_content_rw_t.
fr: Si vous souhaitez autoriser glusterd à modifier les fichiers publics utilisés pour les services de transfert de fichiers publics. Les fichiers ou répertoires doivent être étiquetés public_content_rw_t.
it: Se si desidera consetire a glusterfsd di modificare i file pubblici utilizzati per il servizio di trasferimento di file pubblici. File/Cartelle devono essere etichettati public_content_rw_t.

source: If you want to deny any process from ptracing or debugging any other processes.
es: Si quiere impedir que cualquier proceso pueda rastrear o depurar cualquier otro proceso.
fr: Si vous souhaitez interdire à tout processus l'action ptrace et le débogage de tout autre processus.
it: Se si desidera impedire a tutti i processi di fare ptrace o debugging di altri processi.

source: If you want to allow all unconfined executables to use libraries requiring text relocation that are not labeled textrel_shlib_t
es: Si quiere permitir que todos los servicios ejecutables no confinados utilicen bibliotecas que requieran la reubicación de texto y que no estén etiquetados como textrel_shlib_t
fr: Si vous souhaitez autoriser tous les exécutables non-confinés à utiliser des bibliothèques requérant une relocalisation de segment texte qui ne sont pas étiquetées textrel_shlib_t
it: Se si desidera consentire a tutti gli eseguibili non confinati di usare librerie che richiedono la text relocation che non possiedono etichetta textrel_shlib_t

source: If you want to allow httpd to act as a relay
es: Si quiere permitir que httpd pueda actuar como un retransmisor
fr: Si vous souhaitez autoriser à httpd d'agir en tant que relais
it: Se si desidera consentire a httpd di agire come un relay

source: If you want to determine whether openvpn can read generic user home content files.
es: Si quiere comprobar si openvpn puede leer los archivos genéricos de las carpetas de usuario.
fr: Si vous souhaitez déterminer si openvpn peut accéder à des fichiers en lecture et en écriture dans les contenus génériques des répertoires utilisateurs.
it: Se si desidera determinare se openvpn può leggere il contenuto dei file nella home dell'utente generico.

source: If you want to allow usage of the gpg-agent --write-env-file option. This also allows gpg-agent to manage user files.
es: Si quiere permitir la utilización de la opción --write-env-file del agente gpg. Esto también permite al agente administrar archivos de usuario.
fr: Si vous souhaitez autoriser l'utilisation de l'option gpg-agent --write-env-file. Ceci permet aussi à gpg-agent de gérer les fichiers utilisateur.
it: Se si desidera consentire l'utilizzo dell'opzione gpg-agent --write-env-file . Ciò consente inoltre a gpg-agent di gestire i file utente.

source: If you want to allow the Telepathy connection managers to connect to any generic TCP port.
es: Si quiere permitir que los administradores de conexión de Telepathy se conecten a cualquier puerto TCP genérico.
fr: Si vous souhaitez autoriser les gestionnaires de connexion Telepathy à se connecter à tout port TCP générique.
it: Se si desidera consentire ai gestori di connessioni Telepathy di connettersi ad una generica porta TCP.

source: If you want to allow http daemon to connect to mythtv
es: Si quiere permitir al demonio http conectar a mythtv
fr: Si vous souhaitez autoriser le démon http à se connecter à mythtv
it: Se si desidera permettere al demone http la connessione a mythtv

source: If you want to allow unconfined users to transition to the Mozilla plugin domain when running xulrunner plugin-container.
es: Si quiere permitir que los usuarios no confinados se trasladen al dominio de los complementos de Mozilla cuando ejecuten el contenedor de complementos xulrunner.
fr: Si vous souhaitez autoriser des utilisateurs non-confinés à transitionner vers le domaine des plugins Mozilla lors de l'exécution de xulrunner plugin-container.
it: Se si desidera consentire agli utenti non confinati di transitare per il dominio dei Mozilla plugin quando si esegue xulrunner plugin-container.

source: If you want to allow sasl to read shadow
es: Si quiere permitir que sasl lea el shadow
fr: Si vous souhaitez autoriser sasl à lire shadow
it: Se si desidera consentire a sasl la lettura shadow

source: If you want to allow HTTPD scripts and modules to connect to databases over the network.
es: Si quiere permitir que guiones y módulos HTTPD se conecten a bases de datos en la red.
fr: Si vous souhaitez autoriser les scripts et modules HTTPD à se connecter aux bases de données sur le réseau.
it: Se si desidera consentire agli script e ai moduli HTTPD di connettersi ai database tramite rete.

source: If you want to allow ssh with chroot env to read and write files in the user home directories
es: Si quiere permitir a ssh en un entorno chroot leer y escribir sobre archivos en las carpetas de usuario.
fr: Si vous souhaitez autoriser ssh avec l'environnement chroot à accéder aux fichiers en lecture et écriture dans les répertoires utilisateurs
it: Se si desidera consentire a ssh con la variabile chroot di leggere e scrivere file nelle cartelle home degli utenti

source: If you want to allow the mount commands to mount any directory or file.
es: Si quiere permitir comandos de montaje en cualquier carpeta o archivo.
fr: Si vous souhaitez autoriser les commandes mount à monter tout fichier ou répertoire.
it: Se si desidera permettere ai comandi mount di montare una qualsiasi cartella o file.

source: If you want to allow polipo to connect to all ports > 1023
es: Si quiere permitir a polipo conectar a todos los puertos > 1023
fr: Si vous souhaitez autoriser polipo à se connecter à tous les ports > 1023
it: Se si desidera consentire a polipo di connettersi a tutte le porte > 1023

source: If you want to allow httpd to run gpg
es: Si quiere permitir que httpd ejecute gpg
fr: Si vous souhaitez autoriser httpd à exécuter gpg
it: Se si desidera permettere a http di eseguire gpg

source: If you want to allow samba to share any file/directory read/write.
es: Si quiere permitir a samba compartir cualquier archivo/carpeta para lectura/escritura.
fr: Si vous souhaitez autoriser samba à partager n'importe quel fichier/répertoire accessible en lecture/écriture.
it: Se si desidera consentire a samba di condividere un qualsiasi file/cartella in lettura/scrittura.

source: If you want to allow samba to act as the domain controller, add users, groups and change passwords.
es: Si quiere permitir que samba actúe como un controlador del dominio, añadir usuarios, grupos y modificar contraseñas.
fr: Si vous souhaitez autoriser samba à agir en tant que contrôleur de domaine, à ajouter des utilisateurs et des groupes, et à modifier les mots de passe.
it: Se si desidera consentire a samba di agire come il controllore di dominio, aggiungere utenti, gruppi e modificare password.

source: If you want to allow ksmtuned to use nfs file systems
es: Si quiere permitir a ksmtuned usar sistemas de archivos nfs
fr: Si vous souhaitez autoriser ksmtuned à utiliser les systèmes de fichiers nfs
it: Se si desidera permettere a ksmtuned di utilizzare il file system nfs

source: If you want to allow httpd cgi support
es: Si quiere permitir el soporte cgi de httpd
fr: Si vous souhaitez autoriser la prise en charge de cgi pour httpd
it: Se si desidera permettere a httpd il supporto cgi

source: If you want to determine whether polipo can access cifs file systems.
es: Si quiere comprobar si polipo puede acceder a sistemas de archivos cifs.
fr: Si vous souhaitez déterminer si polipo peut accéder aux systèmes de fichiers cifs.
it: Se si desidera determinare se polipo può accedere ai file system cifs.

source: If you want to allow Apache to query NS records
es: Si quiere permitir a Apache consultar registros NS
fr: Si vous souhaitez autoriser Apache à interroger les enregistrements NS
it: Se si desidera permettere ad Apache di interrogare i record NS

source: If you want to determine whether ftpd can use CIFS used for public file transfer services.
es: Si quiere comprobar si ftpd puede usar el CIFS usado por los servicios públicos de transferencia de archivos.
fr: Si vous souhaitez déterminer si ftp peut utiliser CIFS pour des services de transferts de fichiers publics.
it: Se si desidera determinare se ftpd può utilizzare CIFS usato per il servizio di trasferimento di file pubblici.

source: If you want to determine whether mcelog can use all the user ttys.
es: Si quiere comprobar si mcelog puede usar los ttys de todos los usuarios.
fr: Si vous souhaitez déterminer si mcelog peut utiliser tous les ttys de l'utilisateur.
it: Se si desidera determinare se mcelog può utilizzre tutti i tty degli utenti.

source: If you want to allow confined virtual guests to manage nfs files
es: Si quiere permitir a lso invitados virtuales confinados administrar archivos nfs
fr: Si vous souhaitez autoriser les invités virtuels confinés à gérer des fichiers nfs
it: Se si desidera consentire ai guest virtuali confinati di gestire file nfs

source: If you want to allow confined virtual guests to use serial/parallel communication ports
es: Si quiere permitir a todos invitados virtuales confinados utilizar puertos de comunicación seriales/paralelos
fr: Si vous souhaitez autoriser les invités virtuels confinés à utiliser des ports de communication série/parallèles
it: Se si desidera consentire ai guest virtuali confinati di usare porte di comunicazione seriali/parallele

source: If you want to allow rsync to run as a client
es: Si quiere que rsync sea ejecutado como cliente
fr: Si vous souhaitez autoriser rsync à s'exécuter en tant que client
it: Se si desidera consentire a rsync l'esecuzione come client

source: If you want to allow rgmanager domain to connect to the network using TCP.
es: Si quiere permitir que el dominio rgmanager se conecte a la red utilizando TCP.
fr: Si vous souhaitez autoriser le domaine rgmanager à se connecter au réseau en utilisant TCP.
it: Se si desidera consentire al domain rgmanager di connettersi alla rete usando TCP.

source: If you want to determine whether exim can read generic user content files.
es: Si quiere comprobar si exim puede leer el contenido de archivos genéricos de usuario
fr: Si vous souhaitez déterminer si exim peut lire les fichiers utilisateurs génériques.
it: Se si desidera determinare se exim può leggere il contenuto dei file dell'utente generico.

source: If you want to allow piranha-lvs domain to connect to the network using TCP.
es: Si quiere permitir que los dominios piranha-lvs puedan conectarse a la red utilizando TCP.
fr: Si vous souhaitez autoriser le domaine piranha-lvs à se connecter au réseau en utilisant TCP.
it: Se si desidera consentire al dominio piranha-lvs di connettersi alla rete usando TCP.

source: If you want to allows clients to write to the X server shared memory segments.
es: Si quiere permitir que clientes modifiquen segmentos de memoria compartidos en el servidor X.
fr: Si vous souhaitez autoriser les clients à écrire sur les segments de la mémoire partagée du serveur X.
it: Se si desidera consentire ai client di scrivere sui segmenti di memoria condivisi del server X.

source: If you want to allow Puppet client to manage all file types.
es: Si quiere permitir que el cliente Puppet administre todos los tipos de archivos.
fr: Si vous souhaitez autoriser le client Puppet à gérer tous les types de fichiers.
it: Se si desidera consentire al client Puppet di gestire tutti i tipi di file.

source: If you want to determine whether entropyd can use audio devices as the source for the entropy feeds.
es: Si quiere comprobar si entropyd puede usar dispositivos de audio como origen para las semillas de entropía.
fr: Si vous souhaitez autoriser si entropyd peut utiliser les périphériques audio comme source d'entropie.
it: Se si desidera determinare se entropyd può utilizzare i dispositivi audio come la sorgente per i feed di entropia.

source: If you want to allow user music sharing
es: Si quiere permitir a los usuarios compartir música
fr: Si vous souhaitez autoriser le partage de musique des utilisateurs
it: Se si desidera consentire la condivisione della musica degli utenti

source: If you want to allow ssh logins as sysadm_r:sysadm_t
es: Si quiere permitir los accesos ssh como sysadm_r:sysadm_t
fr: Si vous souhaitez autoriser les connexions ssh en tant que sysadm_r:sysadm_t
it: Se si desidera consentire a ssh il login come sysadm_r:sysadm_t

source: If you want to determine whether Bind can write to master zone files. Generally this is used for dynamic DNS or zone transfers.
es: Si quiere comprobar si Bind puede escribir a los archivos de zona maestra. Normalmente ésto se usa para DNS dinámico o transferencias de zona.
fr: Si vous souhaitez déterminer si BIND peut accéder en écriture aux fichiers de la zone principale. Ceci est habituellement utilisé pour le DNS dynamique ou les transferts de zone.
it: Se si desidera determinare se Bind può scrivere i file della zona master. Gereralmente è utilizzata per i DNS dinamici o i trasferimenti di zona.

source: If you want to determine whether Git system daemon can access cifs file systems.
es: Si quiere determinar si el demonio del sistema Git puede acceder a sistemas de archivos cifs.
fr: Si vous souhaitez déterminer si le démon système Git peut accéder aux systèmes de fichiers cifs.
it: Se si desidera determinare se il demone del sistema Git può accedere ai file system cifs.

source: If you want to allow unprivileged users to execute DDL statement
es: Si quiere permitir a usuarios sin privilegios ejecutar la declaración DDL
fr: Si vous souhaitez autoriser les utilisateurs non-privilégiés à exécuter des instructions DDL
it: Se si desidera consentire agli utenti non privilegiati di eseguire statement DDL

source: If you want to determine whether tor can bind tcp sockets to all unreserved ports.
es: Si quiere comprobar si tor puede enlazar sockets tcp en todos los puertos no reservados.
fr: Si vous souhaitez déterminer si tor peut lier les sockets tcp sur tout port non-réservé.
it: Se si vuole determinare se tor può associare i socket tcp a tutte le porte disponibili.

source: If you want to determine whether mpd can use nfs file systems.
es: Si quiere comprobar si mpd puede usar sistemas de archivos nfs.
fr: Si vous souhaitez déterminer si mpd peut utiliser les systèmes de fichiers nfs.
it: Se si desidera determinare se mpd può utilizzare il file system nfs.

source: If you want to determine whether mcelog can execute scripts.
es: Si quiere comprobar si mcelog puede ejecutar scripts.
fr: Si vous souhaitez déterminer si mcelog peut exécuter des scripts.
it: Se si desidera determinare se mcelog può eseguire script.

source: If you want to determine whether cvs can read shadow password files.
es: Si quiere comprobar si cvs puede leer archivos shadow de contraseña.
fr: Si vous souhaitez déterminer si clamscan peut lire les fichiers shadow de mots de passe.
it: Se si desidera determinare se cvs può leggere i file shadow password.

source: If you want to allow httpd to access cifs file systems
es: Si quiere permitir que httpd tenga acceso a sistemas de archivos cifs
fr: Si vous souhaitez autoriser httpd à accéder aux systèmes de fichiers cifs
it: Se si desidera consentire ad httpd di accedere ai file system cifs.

source: If you want to determine whether Git CGI can search home directories.
es: Si quiere comprobar si el CGI de Git puede buscar en las carpetas de usuario.
fr: Si vous souhaitez autoriser le CGI Git à effectuer des recherches dans les répertoires utilisateurs.
it: Se si desidera determinare se Git CGI può eseguire una ricerca delle directory home.

source: If you want to allow host key based authentication
es: Si quiere permitir autenticaciones basadas en llaves de equipos
fr: Si vous souhaitez autoriser l'authentification basée sur clé de l'hôte.
it: Se si desidera consentire l'autenticazione basata su combinazioni di tasti

source: If you want to support NFS home directories
es: Si quiere tener soporte para carpetas de usuario sobre NFS
fr: Si vous souhaitez prendre en charge les répertoires utilisateurs NFS
it: Se si desidera il supporto NFS per le cartelle home

source: If you want to allow postfix_local domain full write access to mail_spool directories
es: Si quiere permitir al dominio postfix_local acceso completo de escritura a las carpetas mail_spool
fr: Si vous souhaitez autoriser le domaine postfix_local à accéder en écriture aux répertoires mail_spool.
it: Se si desidera consentire al dominio postfix_local l'accesso in completa scrittura alle cartelle mail_spool

source: If you want to determine whether can antivirus programs use JIT compiler.
es: Si quiere comprobar si los programas antivirus pueden usar un compilador JIT.
fr: Si vous souhaitez déterminer si les programmes antivirus peuvent utiliser le compilateur JIT.
it: Se si desidera determinare se i programmi antivirus possono utilizzare il compilatore JIT.

source: If you want to disallow programs, such as newrole, from transitioning to administrative user domains.
es: Si quiere impedir que los programas, como por ejemplo newrole, se trasladen a dominios de usuario administrativos.
fr: Si vous souhaitez interdire à des programmes, comme newrole, de transitionner vers des domaines utilisateurs administratifs.
it: Se si desidera impedire ai programmi, come newrole, il transito attraverso i domini utente amministrativi.

source: If you want to allow glusterfsd to share any file/directory read only.
es: Si quiere permitir a glusterfsd compartir cualquier archivo/carpeta de sólo lectura.
fr: Si vous souhaitez autoriser glusterfsd à partager n'importe quel fichier/répertoire accessible en lecture seule.
it: Se si desidera permettere a glusterfsd di condividere un qualsiasi file/cartella in sola lettura.

source: If you want to allow httpd processes to manage IPA content
es: Si quiere permitir a los procesos httpd administrar el contenido IPA
fr: Si vous souhaitez autoriser les processus httpd à gérer le contenu IPA
it: Se si desidera consentire ai processi httpd di gestire contenuto IPA

source: If you want to determine whether clamscan can read user content files.
es: Si quiere comprobar si clamscan puede leer archivos de contenido de usuario.
fr: Si vous souhaitez autoriser clamscan à lire le contenu des fichiers utilisateur
it: Se si desidera determinare se clamscan può leggere il contenuto dei file degli utenti.

source: If you want to determine whether clamscan can read all non-security files.
es: Si quiere determinar si clamscan puede leer todos los ficheros no de seguridad.
fr: Si vous souhaitez déterminer si clamscan peut lire tous les fichiers non relatifs à la sécurité.
it: Se si desidera determinare se clamscan può leggere tutti i file non di sicurezza.

source: If you want to allow pppd to be run for a regular user
es: Si quiere permitir a pppd ser ejecutado por un usuario regular
fr: Si vous souhaitez autoriser pppd à être exécuté pour un utilisateur normal
it: Se si desidera consentire a pppd di essere eseguito da un utente normale

source: If you want to allow samba to share any file/directory read only.
es: Si quiere permitir a samba compartir cualquier archivo/carpeta de solo lectura.
fr: Si vous souhaitez autoriser samba à partager tout fichier/répertoire en lecture-seule.
it: Se si desidera consentire a samba di condividere un qualsiasi file/directory di sola scrittura.
