Repository: Justasic/setroubleshoot
Catalog: plugins/po/*.po
Languages: es, fr, it

source: SELinux denied access to $TARGET_PATH requested by $SOURCE. $TARGET_PATH has a context used for sharing by a different program. If you would like to share $TARGET_PATH from $SOURCE also, you need to change its file context to public_content_t. If you did not intend to allow this access, this could signal an intrusion attempt.
es: SELinux impidió el acceso a $TARGET_PATH solicitado por $SOURCE. $TARGET_PATH tiene un contexto usado para ser compartido por distintos programas. Si quiere compartir $TARGET_PATH también desde $SOURCE, necesita cambiar su contexto de archivo a public_content_t. Si no pretende permitir este acceso, ésto podría indicar un intento de ataque.
fr: SELinux a refusé l'accès à $TARGET_PATH, demandé par $SOURCE. $TARGET_PATH a un contexte utilisé pour le partage par un autre programme. Si vous souhaitez partager $TARGET_PATH depuis $SOURCE également, vous devez changer son fichier de contexte sur public_content_t. Si vous n'en aviez pas l'intention, cela pourrait signaler une tentative d'intrusion.
it: SELnux ha negato l'accesso a $TARGET_PATH richiesto da $SOURCE. $TARGET_PATH presenta un contesto utilizzato per una condivisione tra diversi programmi. Se si desidera condividere anche $TARGET_PATH da $SOURCE, bisogna modificare il contesto del file in public_content_t. Se non si desiderava consentire questo accesso, ciò potrebbe segnalare un tentativo d'intrusione.

source: You can alter the file context by executing chcon -t public_content_t '$TARGET_PATH' You must also change the default file context files on the system in order to preserve them even on a full relabel. "semanage fcontext -a -t public_content_t '$FIX_TARGET_PATH'"
es: Puede modificar el contexto de archivo ejecutando chcon -t public_content_t '$TARGET_PATH' También debe cambiar el archivo predeterminado de contexto de archivos en el sistema, para preservarlos incluso después de un reetiquetado completo. "semanage fcontext -a -t public_content_t '$FIX_TARGET_PATH'"
fr: Vous pouvez modifier le fichier de contexte en exécutant chcon -t public_content_t '$TARGET_PATH' Vous devez aussi changer le dossier par défaut des fichiers de contexte de votre système, même lors d'un réétiquetage complet, de manière à les préserver. « semanage fcontext -a -t public_content_t '$FIX_TARGET_PATH' »
it: È possibile alterare il contesto del file eseguendo chcon -t public_content_t '$TARGET_PATH' È necessario inoltre modificare il contesto file predefinito dei file sul sistema per preservarli da una completa rietichettatura. "semanage fcontext -a -t public_content_t '$FIX_TARGET_PATH'"

source: you want to treat $TARGET_BASE_PATH as public content
es: Si quiere tratar a $TARGET_BASE_PATH como contenido público
fr: vous souhaitez considérer $TARGET_BASE_PATH comme contenu public
it: si vuole trattare $TARGET_BASE_PATH come contenuto pubblico

source: You need to change the label on $TARGET_BASE_PATH to public_content_t or public_content_rw_t.
es: necesita modificar la etiqueta en $TARGET_BASE_PATH a public_content_t o public_content_rw_t.
fr: Vous devez modifier l'étiquette de $TARGET_BASE_PATH en public_content_t ou public_content_rw_t.
it: E' necessario modificare l'etichetta su $TARGET_BASE_PATH in public_content_t oppure public_content_rw_t.

source: SELinux denied qemu access to the block device $TARGET_PATH. If this is a virtualization image, it needs to be labeled with a virtualization file context (virt_image_t). You can relabel $TARGET_PATH to be virt_image_t using chcon. You also need to execute semanage fcontext -a -t virt_image_t '$FIX_TARGET_PATH' to add this new path to the system defaults. If you did not intend to use $TARGET_PATH as a qemu image it could indicate either a bug or an intrusion attempt.
es: SELinux impidió a qemu acceder al dispositivo de bloque $TARGET_PATH. Si ésta es una imagen de virtualización, tendrá que etiquetarla con el contexto de archivo de virtualización (virt_image_t). Puede re-etiquetar $TARGET_PATH mediante chcon para que sea virt_image_t . También necesita ejecutar semanage fcontext -a -t virt_image_t '$FIX_TARGET_PATH' para añadir esta nueva ruta a los sistemas predeterminados. Si no trató de usar $TARGET_PATH como imagen qemu podría indicar un error o un intento de ataque.
fr: SELinux a refusé à qemu l'accès au périphérique de bloc $TARGET_PATH. S'il s'agit d'une image virtualisation, elle doit porter un étiquetage de contexte propre à la virtualisation (virt_image_t). Vous pouvez réétiqueter $TARGET_PATH en virt_image_t en utilisant chcon. Vous devriez également exécuter semanage fcontext -a -t virt_image_t '$FIX_TARGET_PATH' pour ajouter ce nouveau chemin à la configuration par défaut du système. Si vous n'aviez pas l'intention d'utiliser $TARGET_PATH en tant qu'image qemu, cela signifie soit un bug, soit une tentative d'intrusion.
it: SELinux ha negato a qemu l'accesso al dispositivo a blocchi $TARGET_PATH. Se questa è un immagine di virtualizzazione, essa deve essere etichettata con un contesto di file di virtualizzazione (virt_image_t). E' possibile rietichettare $TARGET_PATH per essere virt_image_t usando chcon. E' inoltre possibile eseguire semanage fcontext -a -t virt_image_t '$FIX_TARGET_PATH' per aggiungere questo nuovo percorso alle impostazioni di sistema predefinite. Se non si intendeva utilizzare $TARGET_PATH come immagine qemu, ciò potrebbe indicare un errore o un tentativo di intrusione.

source: You can alter the file context by executing chcon -t virt_image_t '$TARGET_PATH' You must also change the default file context files on the system in order to preserve them even on a full relabel. "semanage fcontext -a -t virt_image_t '$FIX_TARGET_PATH'"
es: Puede modificar el contexto de archivo chcon -t virt_image_t '$TARGET_PATH' También debe cambiar el archivo predeterminado de contexto de archivos en el sistema, para preservarlos incluso después de un reetiquetado completo. "semanage fcontext -a -t virt_image_t '$FIX_TARGET_PATH'"
fr: Vous pouvez modifier le contexte du fichier en exécutant chcon -t virt_image_t '$TARGET_PATH' Vous devez aussi changer le dossier par défaut des fichiers de contexte de votre système, même lors d'un réétiquetage complet, de manière à les préserver. « semanage fcontext -a -t virt_image_t '$FIX_TARGET_PATH' »
it: E' possibile alterare il contesto del file eseguendo chcon -t virt_image_t '$TARGET_PATH' È necessario inoltre modificare il contesto file predefinito dei file sul sistema per preservarli da una completa rietichettatura. "semanage fcontext -a -t virt_image_t '$FIX_TARGET_PATH'"

source: SELinux denied qemu access to $TARGET_PATH. If this is a virtualization image, it has to have a file context label of virt_image_t. The system is setup to label image files in directory./var/lib/libvirt/images correctly. We recommend that you copy your image file to /var/lib/libvirt/images. If you really want to have your qemu image files in the current directory, you can relabel $TARGET_PATH to be virt_image_t using chcon. You also need to execute semanage fcontext -a -t virt_image_t '$FIX_TARGET_PATH' to add this new path to the system defaults. If you did not intend to use $TARGET_PATH as a qemu image it could indicate either a bug or an intrusion attempt.
es: SELinux impidió a qemu el acceso a $TARGET_PATH. Si ésta es una imágen de virtualización, tiene que estar etiquetado con el contexto de archivo virt_image_t. El sistema está configurado para etiquetar correctamente los archivos de imagen en la carpeta /var/lib/libvirt/images. Le recomendamos que copie su archivo de imagen a /var/lib/libvirt/images. Si realmente quiere mantener sus archivos de imagen qemu en la carpeta actual, puede reetiquetar $TARGET_PATH como virt_image_t utilizando chcon. También necesitará ejecutar semanage fcontext -a -t virt_image_t '$FIX_TARGET_PATH' para añadir esta nueva ruta a las predeterminadas del sistema. Si no pretende utilizar $TARGET_PATH como una imagen qemu, ésto podría indicar un error o un intento de ataque.
fr: SELinux a refusé à qemu l'accès à $TARGET_PATH. S'il s'agit d'une image de virtualisation, elle doit porter un étiquetage de contexte tel que virt_image_t. Ce système est configuré pour étiqueter les fichiers image dans /var/lib/libvirt/images Nous vous recommandons de copier votre fichier image dans le répertoire /var/lib/libvirt/images. Si vous souhaitez vraiment avoir votre fichier image qemu dans ce répertoire, vous pouvez réétiqueter $TARGET_PATH en virt_image_t en utilisant chcon. Vous devriez également exécuter semanage fcontext -a -t virt_image_t '$FIX_TARGET_PATH' pour ajouter ce nouveau chemin à la configuration par défaut du système. Si vous n'aviez pas l'intention d'utiliser $TARGET_PATH en tant qu'image qemu, cela signifie soit une anomalie, soit une tentative d'intrusion.
it: SELinux ha negato a qemu l'accesso a $TARGET_PATH. Se questa è un immagine di virtualizzazione allora dovrà avere una etichetta del contesto di file virt_image_t. Il sistema è impostato per etichettare correttamente i file immagine in directory./var/lib/libvirt/images Si consiglia di copiare il proprio file immagine in /var/lib/libvirt/images. Se si desidera veramente avere i file immagine qemu nella directory corrente, è possibile rietichettare $TARGET_PATH in modo da diventare virt_image_t usando chcon. Si dovrà anche eseguire semanage fcontext -a -t virt_image_t '$FIX_TARGET_PATH' per aggiungere questo nuovo percorso alle impostazioni di sistema predefinite. Se non si intendeva utilizzare $TARGET_PATH come una immagine qemu ciò potrebbe indicare un errore o un tentativo di intrusione.

source: $TARGET_BASE_PATH is a virtualization target
es: $TARGET_BASE_PATH es un destino de virtualización
fr: $TARGET_BASE_PATH est une cible de virtualisation
it: $TARGET_BASE_PATH è un target di virtualizzazione

source: You can restore the default system context to this file by executing the restorecon command. restorecon '$TARGET_PATH', if this file is a directory, you can recursively restore using restorecon -R '$TARGET_PATH'.
es: Puede restaurar el contexto predeterminado del sistema para este archivo ejecutando el comando restorecon. restorecon '$TARGET_PATH', si este archivo es una carpeta, puede aplicar restore recursivamente ejecutando restorecon -R '$TARGET_PATH'.
fr: Vous pouvez restaurer le contexte par défaut du système sur ce fichier en exécutant la commande restorecon. restorecon '$TARGET_PATH'. Si ce fichier est un répertoire, vous pouvez restaurer le contexte récursivement en utilisant restorecon -R '$TARGET_PATH'.
it: È possibile ripristinare il contesto del sistema predefinito a questo file eseguendo il comando restorecon. restorecon '$TARGET_PATH', se il file indicato è una cartella, è possibile ripristinare ricorsivamente utilizzando restorecon -R '$TARGET_PATH'.

source: SELinux denied access requested by $SOURCE. $TARGET_PATH may be a mislabeled. $TARGET_PATH default SELinux type is <B>%s</B>, but its current type is <B>$TARGET_TYPE</B>. Changing this file back to the default type, may fix your problem. <p> File contexts can be assigned to a file in the following ways. <ul> <li>Files created in a directory receive the file context of the parent directory by default. <li>The SELinux policy might override the default label inherited from the parent directory by specifying a process running in context A which creates a file in a directory labeled B will instead create the file with label C. An example of this would be the dhcp client running with the dhclient_t type and creating a file in the directory /etc. This file would normally receive the etc_t type due to parental inheritance but instead the file is labeled with the net_conf_t type because the SELinux policy specifies this. <li>Users can change the file context on a file using tools such as chcon, or restorecon. </ul> This file could have been mislabeled either by user error, or if an normally confined application was run under the wrong domain. <p> However, this might also indicate a bug in SELinux because the file should not have been labeled with this type. <p> If you believe this is a bug, please file a bug report against this package.
es: SELinux impidió el acceso solicitado por $SOURCE. $TARGET_PATH puede estar mal etiquetado. El tipo SELinux predeterminado de $TARGET_PATH es <B>%s</B>, pero su tipo actual es <B>$TARGET_TYPE</B>. Modificar este archivo a su tipo predeterminado podría corregir el problema. <p> Los contextos de archivo pueden ser asignados a un archivo de las siguientes maneras. <ul> <li>De manera predeterminada, los archivos creados en una carpeta reciben el contexto de archivo de la carpeta padre. <li>La política de SELinux puede cambiar esta etiqueta heredada en forma predeterminada desde la carpeta padre, especificando que un proceso que se ejecuta en el contexto A, en vez de crear un archivo en una carpeta etiquetada como B, en realidad creará archivos etiquetados como C. Un ejemplo de esto sería el cliente dhcp ejecutándose con el tipo dhclient_t creando un archivo en la carpeta /etc. Este archivo recibiría normalmente el tipo etc_t debido a la herencia, pero en su lugar el archivo es etiquetado con el tipo net_conf_t porque la política SELinux así lo indica. <li> Los usuarios pueden modificar el contexto de un archivo utilizando herramientas como chcon o restorecon. </ul> Este archivo puede haber sido mal etiquetado por un error del usuario, o bien por una aplicación normalmente confinada que estuvo ejecutándose en el dominio incorrecto. <p> Sin embargo, esto también puede indicar un error de SELinux, ya que el archivo no debería haber sido etiquetado con este tipo. <p> Si piensa que podría tratarse de un error, envíe un informe de errores acerca de este paquete.
fr: SELinux a refusé l'accès requis par $SOURCE. $TARGET_PATH pourrait être mal étiqueté. Le type SELinux par défaut de $TARGET_PATH est <B>%s</B>, mais son type actuel est <B>$TARGET_TYPE</B>. Modifier ce fichier en utilisant son type par défaut pourrait corriger le problème. <p> Les contextes de fichiers peuvent être assignés à un fichier comme suit. <ul> <li>Les fichiers créés dans un répertoire recoivent le contexte de fichier du répertoire parent par défaut. <li>La stratégie SELinux peut remplacer l'étiquette héritée par défaut du répertoire parent en spécifiant un processus exécuté dans le contexte A, qui crée un fichier dans un répertoire étiqueté B et au lieu de cela, créera un fichier avec l'étiquette C. Par exemple, un client dhcp exécuté avec le type dhclient_t créera un fichier dans le répertoire /etc. Ce fichier devrait normalement recevoir le type etc_t à cause de son héritage parental mais à la place, le fichier est étiqueté avec le type net_conf_t car la stratégie SELinux le spécifie. <li>Les utilisateur peuvent modifier le contexte de fichier d'un fichier à l'aide d'outils tels que chcon ou restorecon. </ul> Ce fichier pourrait avoir été mal étiqueté à cause d'une erreur de l'utilisateur ou si une application normalement confinée a été exécutée sous le mauvais domaine. <p> Cependant, ceci pourrait aussi indiquer une anomalie dans SELinux, car le fichier n'aurait pas dû être étiqueté avec ce type. <p> Si vous pensez qu'il s'agit d'une anomalie, veuillez remplir un rapport d'anomalie pour ce paquet.
it: SELinux ha rifiutato l'accesso richiesto da $SOURCE. $TARGET_PATH potrebbe essere etichettato male. Il tipo SELinux predefinito di $TARGET_PATH è <B>%s</B>, ma il tipo attuale è <B>$TARGET_TYPE</B>. modificando questo file al tipo predefinito si potrebbe risolvere il problema. <p> I contesti dei file possono essere assegnati ad un file nei seguenti modi. <ul> <li>I file creati in una cartella ricevono il contesto file della cartella principale in modo predefinito. <li>La politica di SELinux potrebbe sovrascrivere l'etichetta predefinita ereditata dalla cartella superiore specificando un processo in esecuzione nel contesto A che crea un file nella cartella con etichetta B creerà il file con l'etichetta C. Un esempio potrebbe essere un client DHCP in esecuzione con il tipo dhclient_t e la creazione di un file nella cartella /etc. Questo file normalmente riceverebbe il tipo etc_t grazie all'eredità della cartella mentre invece il file viene etichettato con il tipo net_conf_t perché la politica di SELinux lo specifica. <li>Gli utenti possono modificare il contesto del file su un file usando strumenti come chcon, o restorecon. </ul> Questo file potrebbe essere stato etichettato male anche da un errore dell'utente, oppure se un applicazione normalmente confinata viene eseguita nel dominio sbagliato. <p> Comunque, ciò potrebbe anche indicare un bug di SELinux dato che il file non dovrebbe essere etichettato con questo tipo. <p> Se si pensa che il problema sia dovuto ad un bug, si prega di riportare un bug su questo pacchetto.

source: you want to fix the label. $TARGET_PATH default label should be %s.
es: quiere arreglar la etiqueta. La etiqueta predeterminada de $TARGET_PATH debería ser %s.
fr: vous souhaitez corriger l'étiquette. L'étiquette par défaut de $TARGET_PATH devrait être %s.
it: Si desidera sistemare l'etichetta. L'etichetta predefinita di $TARGET_PATH dovrebbe essere %s.

source: you can run restorecon.
es: puede ejecutar restorecon.
fr: vous pouvez exécuter restorecon.
it: è possibile avviare restorecon.

source: Restore Context
es: Restaurar Contexto
fr: Restaurer Contexte

source: You can restore the default system context to this file by executing the restorecon command. restorecon '$SOURCE_PATH'.
es: Puede restaurar el contexto por defector del sistema para este archivo ejecutando el comando restorecon. restorecon '$SOURCE_PATH'.
fr: Vous pouvez restaurer le contexte par défaut du système pour ce fichier en exécutant la commande restorecon. restorecon '$SOURCE_PATH'.
it: E' possibile ripristinare il contesto predefinito del sistema su questo file eseguendo il comando restorecon. restorecon '%SOURCE_PATH'.

source: SELinux denied access requested by $SOURCE. $SOURCE_PATH may be a mislabeled. $SOURCE_PATH default SELinux type is <B>%s</B>, but its current type is <B>$SOURCE_TYPE</B>. Changing this file back to the default type, may fix your problem. <p> This file could have been mislabeled either by user error, or if an normally confined application was run under the wrong domain. <p> However, this might also indicate a bug in SELinux because the file should not have been labeled with this type. <p> If you believe this is a bug, please file a bug report against this package.
es: SELinux denegó el acceso requerido por $SOURCE. $SOURCE_PATH puede estar mal etiquetado. $SOURCE_PATH el tipo SELinux por defecto es <B>%s</B>, pero el actual es <B>$SOURCE_TYPE</B>. Cambiar este archivo de vuelta al tipo por defecto, podria resolver su problema. <p> Este archivo puede haber sido mal etiquetado por un error de usuario, o si una aplicación normalmente confinada se ejecutó en un dominio erroneo. <p> De todas formas, esto también puede indicar un error en SELinux si el archivo no debiera estar etiquetado. con este tipo. <p> Si cree que esto es un error, por favor archive el reporte de error sobre este paquete.
fr: SELinux a refusé l'accès demandé par $SOURCE. $SOURCE_PATH peut être mal étiqueté. Le type SELinux par défaut de $SOURCE_PATH est <B>%s</B>, mais son type actuel est <B>$SOURCE_TYPE</B>. Revenir au type par défaut pour ce fichier pourrait corriger le problème. <p> Ce fichier peut avoir été mal étiqueté suite à une erreur utilisateur, ou bien si une application normalement confinée a été exécutée dans le mauvais domaine. <p> Néanmoins, ceci peut aussi indiquer une anomalie dans SELinux parce que le fichier ne devrait pas avoir été étiqueté avec ce type. <p> Si vous pensez qu'il s'agit d'une anomalie, veuillez émettre un rapport d'anomalie à propos de ce paquet.
it: SELinux ha negato l'accesso richiesto da $SOURCE. $SOURCE_PATH potrebbbe essere etichettato non correttamente. Il tipo predefinito di SELinux di $SOURCE_PATH è <B>%s</B>, ma il tipo corrente è <B>$SOURCE_TYPE</B>. Riportando questo tipo di file al tipo predefinito, si potrebbe risolvere il problema. <p> Questo file potrebbere essere stato etichettato in modo non corretto per errore da un utente, o se un'applicazione confinata normalmente è stata eseguita sotto un dominio erratto. <p> Comunque, questo potrebbe anche essere un bug di SELinux poiché il file non dovrebbe essere etichettato con questo tipo. <p> Se si pensa che questo è un bug, inviare una segnalazione di bug per il pacchetto.

source: you want to fix the label. $SOURCE_PATH default label should be %s.
es: quiere arreglar la etiqueta. La eqtiqueta predeterminada de $SOURCE_PATH debería ser %s.
fr: vous souhaitez corriger l'étiquette. L'étiquette par défaut de $SOURCE_PATH devrait être %s.
it: si desidera sistemare l'etichetta. $SOURCE_PATH l'etichetta predefinita dovrebbe essere %s.

source: SELinux denied rsync access to $TARGET_PATH. If this is a RSYNC repository it has to have a file context label of rsync_data_t. If you did not intend to use $TARGET_PATH as a rsync repository it could indicate either a bug or it could signal a intrusion attempt.
es: SELinux impidió a rsync acceder a $TARGET_PATH. Si éste es un repositorio RSYNC debería tener la etiqueta de contexto de archivo de rsync_data_t. Si no pretende usar $TARGET_PATH como un repositorio rsync, ésto podría indicar un error o un intento de ataque.
fr: SELinux a refusé à rsync l'accès à $TARGET_PATH. S'il s'agit d'un dépôt RSYNC il doit comporter un étiquetage de contexte de fichier tel que rsync_data_t. Si vous n'avez pas l'intention d'utiliser $TARGET_PATH en tant que dépôt rsync cela peut soit signifier une anomalie, soit une tentative d'intrusion.
it: SELinux ha negato a rsync l'accesso a $TARGET_PATH. Se risulta essere un repository RSYNC sarà necessaria un'etichetta del contesto del file rsync_data_t. Se non si voleva utilizzare $TARGET_PATH come repository rsync, tale comportamento potrebbe indicare un bug oppure un tentativo d'intrusione.

source: You can alter the file context by executing chcon -R -t rsync_data_t '$TARGET_PATH' You must also change the default file context files on the system in order to preserve them even on a full relabel. "semanage fcontext -a -t rsync_data_t '$FIX_TARGET_PATH'"
es: Puede modificar el contexto de archivo ejecutando chcon -R -t rsync_data_t '$TARGET_PATH' También debe cambiar el archivo predeterminado de contexto de archivos en el sistema, para que se preserven incluso después de un reetiquetado completo. "semanage fcontext -a -t rsync_data_t '$FIX_TARGET_PATH'"
fr: Vous pouvez changer le contexte du fichier en exécutant chcon -R -t rsync_data_t '$TARGET_PATH' Vous devez aussi changer le dossier par défaut des fichiers de contexte de votre système, même lors d'un réétiquetage complet, de manière à les préserver. « semanage fcontext -a -t rsync_data_t '$TARGET_PATH' »
it: È possibile alterare il contesto del file eseguendo chcon -R -t rsync_data_t '$TARGET_PATH' È necessario inoltre modificare il contesto file predefinito dei file sul sistema per preservarli anche da una completa rietichettatura. "semanage fcontext -a -t rsync_data_t '$FIX_TARGET_PATH'"

source: $TARGET_BASE_PATH should be shared via the rsync daemon
es: $TARGET_BASE_PATH debería ser compartido mediante el demonio rsync
fr: $TARGET_BASE_PATH devrait être partagé via le démon rsync
it: $TARGET_BASE_PATH dovrebbe essere condiviso tramite il demone rsync

source: You need to change the label on $TARGET_BASE_PATH
es: Necesita modificar la etiqueta en $TARGET_BASE_PATH
fr: Vous devez modifier l'étiquette sur $TARGET_BASE_PATH
it: E' necessario modificare l'etichetta su $TARGET_BASE_PATH
